{
  "lastUpdated": "2025-03-10T21:33:47.159Z",
  "movies": [
    {
      "title": "Master and Commander: The Far Side of the World",
      "link": "https://letterboxd.com/peruvianidol/film/master-and-commander-the-far-side-of-the-world/",
      "watchedDate": "2025-03-08",
      "filmYear": "2003",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/du/jf/g4/jt/4o4JyEQldHQiqJn0BBRFppDmI65-0-600-0-900-crop.jpg?v=4d07bad0bd",
      "reviewText": "I don't think I'd seen this since it came out and at that time I thought it was pretty forgettable. But wow, this thing really holds up and is a helluva movie. There's scenes where I'm just like, \"how did they film this without anyone dying?\" That's when you know you're watching greatness. Being a dad definitely gave me a different perspective, particularly around the young crew members. Why did we get like 30 MCU movies but just one of these?"
    },
    {
      "title": "V for Vendetta",
      "link": "https://letterboxd.com/peruvianidol/film/v-for-vendetta/",
      "watchedDate": "2025-03-05",
      "filmYear": "2005",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/4/0/0/51400-v-for-vendetta-0-600-0-900-crop.jpg?v=c962ca4bec",
      "reviewText": "Decided to revisit this for no particular reason. This movie predicted the Ulcered Sphincter of Ass-erica that we find ourselves in today. It's a little heavy-handed in its imagery, but that finale is just what we need right now, except instead of Guy Fawkes masks they're wearing Luigi hats."
    },
    {
      "title": "Le Samouraï",
      "link": "https://letterboxd.com/peruvianidol/film/le-samourai/",
      "watchedDate": "2025-03-05",
      "filmYear": "1967",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/8/8/1/7/48817-le-samourai-0-600-0-900-crop.jpg?v=11267d74cc",
      "reviewText": "This movie is a vibe. Looks great but I was distracted by the protagonist's fashion choices. He commits a murder early in the movie and then there's a whole half hour of him at the police station and despite there being a ton of witnesses, no one is like \"yeah, it was that Inspector Gadget-looking motherfucker right there.\" A tan trenchcoat and fedora is like the most sus, cliched outfit ever. Anyway, I couldn't stop thinking about it and it kept me from fully enjoying this movie."
    },
    {
      "title": "This Is the Tom Green Documentary",
      "link": "https://letterboxd.com/peruvianidol/film/this-is-the-tom-green-documentary/",
      "watchedDate": "2025-02-24",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/9/7/7/7/6/1297776-this-is-the-tom-green-documentary-0-600-0-900-crop.jpg?v=00ddafd010",
      "reviewText": "Say what you will about Tom Green's humor but he's undeniably a comedy pioneer. This doc, directed by Green himself, covers his rise to stardom and what he's been up to more recently since leaving LA to live on a farm in his native Ottawa. I remember a lot of his early work on MTV but there was so much fun stuff I missed and it's great to see that Tom is still at it."
    },
    {
      "title": "The Brutalist",
      "link": "https://letterboxd.com/peruvianidol/film/the-brutalist/",
      "watchedDate": "2025-02-18",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/8/4/2/8/478428-the-brutalist-0-600-0-900-crop.jpg?v=2f8cae2ea5",
      "reviewText": "I appreciate the ambition here but the last 20 minutes or so elicited a big Aunt Linda reaction from me. I had heard almost universally that the first half was a masterpiece and the end was disappointing but it seems like they oversold the former and undersold the latter. Beautiful looking film and a good performance by Brody, but best picture? Meh."
    },
    {
      "title": "SNL50: Beyond Saturday Night",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-beyond-saturday-night/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/9/9/0/2/8/1299028-snl50-beyond-saturday-night-0-600-0-900-crop.jpg?v=eb23391bf7",
      "reviewText": "A pretty entertaining docu-series covering some lesser known aspects of the show (the audition process, the writers, Lorne Michaels' season 11 return) and an entire episode on the cowbell sketch. As someone who dreamed of being on SNL practically since birth, I found a lot to love here. It's like the comedy version of The Last Dance but with less of a cohesive through line between episodes."
    },
    {
      "title": "Punch-Drunk Love",
      "link": "https://letterboxd.com/peruvianidol/film/punch-drunk-love/",
      "watchedDate": "2025-02-10",
      "filmYear": "2002",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/9/1/4/47914-punch-drunk-love-0-600-0-900-crop.jpg?v=032fc20313",
      "reviewText": "Bought the 4k Criterion of this even though I hadn't seen it since it came out and only remember being disappointed with PTA's follow-up to Boogie Nights and Magnolia. 20+ years later he's made some more great movies (There Will Be Blood, Phantom Thread) and some stinkers (Inherent Vice, Licorice Pizza) putting this somewhere in the middle for me. Having watched Billy Madison and Happy Gilmore about a hundred times in college, I was pleasantly surprised by Sandler's dramatic turn back then. In the years since he's gotten worse at comedy and better at drama, even if he seldom does serious roles. I love the low-budget feel of this, Emily Watson's tender performance, and PSH, my god. To think of all the brilliant performances we've missed out on since his passing. Tragic. He's the perfect foil to Sandler's Barry Egan."
    },
    {
      "title": "Wonder Boys",
      "link": "https://letterboxd.com/peruvianidol/film/wonder-boys/",
      "watchedDate": "2025-02-07",
      "filmYear": "2000",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/6/9/8/45698-wonder-boys-0-600-0-900-crop.jpg?v=68d29ccfd2",
      "reviewText": "One of my all-time favorite screenplays, I must have seen this movie a dozen times, though not recently enough to spot Rob McElhenney for the split second he appears in it. Peak Michael Douglas and a fun supporting performance from Robert Downey Jr. Watching this movie is like slipping into Grady's old robe."
    },
    {
      "title": "Oh, Canada",
      "link": "https://letterboxd.com/peruvianidol/film/oh-canada/",
      "watchedDate": "2025-03-10",
      "filmYear": "2024",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/0/4/0/1/5/1004015-oh-canada-0-600-0-900-crop.jpg?v=9261d4907f",
      "reviewText": "A character study about a mediocre white guy who became successful in spite of himself, coming to terms with his life in front of a documentary crew as he's dying from cancer. Great performance by Richard Gere but woof."
    },
    {
      "title": "Virtuosity",
      "link": "https://letterboxd.com/peruvianidol/film/virtuosity/",
      "watchedDate": "2025-03-09",
      "filmYear": "1995",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/3/2/1/47321-virtuosity-0-600-0-900-crop.jpg?v=7d3dbd4729",
      "reviewText": "An extremely dumb B-movie that somehow lucked out in convincing Denzel to lead it and finding a young Russell Crowe to play its over-the-top VR villain come to life. The writing is awful but you can still see Crowe is a star in the making, and Denzel just naturally elevates everything he's in. It's hilarious to me that despite its sci-fi premise, nothing about this world aside from the concept of VR in the 1990s is particularly futuristic."
    },
    {
      "title": "A Bridge Too Far",
      "link": "https://letterboxd.com/peruvianidol/film/a-bridge-too-far/",
      "watchedDate": "2025-03-08",
      "filmYear": "1977",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/ck/3j/e7/yn/lszOk3Xmh7qpLaM9J4K9E6ADLk1-0-600-0-900-crop.jpg?v=aacf86062a",
      "reviewText": "Like the operation this WW2 movie depicts, A Bridge Too Far is overly-ambitious and doesn't quite succeed. The cast is stacked with a who's who of famous actors, but like the Avengers movies, there's too many characters to give any meaningful time to develop. A lot of the action looks like stock footage, even though it's not. The movie gets more interesting in the last third as it focuses more on the plight of the soldiers on the ground and less on the logistics that the first third painfully drags out. It could have easily been an hour shorter and much improved if it just focused on the soldiers and didn't try to give equal screen time to all the higher-ups played by big name actors."
    },
    {
      "title": "Mickey 17",
      "link": "https://letterboxd.com/peruvianidol/film/mickey-17/",
      "watchedDate": "2025-03-07",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/2/0/2/8/1/620281-mickey-17-0-600-0-900-crop.jpg?v=93e4d2af6d",
      "reviewText": "I had a huge grin on my face through most of this movie. Everyone is just hamming it up and having a good time. Landed in a way that Snowpiercer didn't for me. Robert Pattinson continues to make interesting choices, both in his projects and characters."
    },
    {
      "title": "The Legend of Fong Sai Yuk",
      "link": "https://letterboxd.com/peruvianidol/film/the-legend-of-fong-sai-yuk/",
      "watchedDate": "2025-03-05",
      "filmYear": "1993",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/0/8/6/1/40861-the-legend-0-600-0-900-crop.jpg?v=d8e1b1eb50",
      "reviewText": "Probably the funniest movie Jet Li has made. In most of his movies he plays a very serious martial artist, but here he's letting loose and having fun. Some incredibly inventive wire work and choreography and a few laugh out loud props that had me screaming. There's a sequence near the beginning where Li is battling the wife of a local merchant and must knock her to the ground to win the hand of their daughter that is just wildly outrageous. If that's not enough, Li's mom, played by Josephine Siao, takes a turn, posing as Li's older brother. Delightful. The 4k transfer looks great."
    },
    {
      "title": "The Poseidon Adventure",
      "link": "https://letterboxd.com/peruvianidol/film/the-poseidon-adventure/",
      "watchedDate": "2025-03-03",
      "filmYear": "1972",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/5/6/7/51567-the-poseidon-adventure-0-600-0-900-crop.jpg?v=66fd1216a2",
      "reviewText": "Fairly entertaining with some great back and forth between Gene Hackman's renegade preacher and Ernest Borgnine's ex-cop. One too many screaming damsel characters. Leslie Nielsen as the captain!"
    },
    {
      "title": "Night Moves",
      "link": "https://letterboxd.com/peruvianidol/film/night-moves/",
      "watchedDate": "2025-03-02",
      "filmYear": "1975",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/0/7/0/1/30701-night-moves-0-600-0-900-crop.jpg?v=b65152bdf2",
      "reviewText": "The Hackman marathon continues. I didn't quite care for this 70s noir where Hackman's detective, Harry Mosby, isn't particularly good at his job, or maybe it's just that the central \"mystery\" just isn't that compelling. The real mystery doesn't become evident until nearly the end and even then it feels like a lot is left unsolved, including Harry's own personal life. Man, people sure were horny in the 70s. It seems that everyone in this movie is looking to score, including a young Melanie Griffith. (I didn't even realize it was her until the credits rolled.) Hackman was good though. Just about the only thing keeping me from falling asleep."
    },
    {
      "title": "No Way Out",
      "link": "https://letterboxd.com/peruvianidol/film/no-way-out-1987/",
      "watchedDate": "2025-03-01",
      "filmYear": "1987",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/79/cr/fo/t2/f1u4r6jZwFie18yjJ2uhYXOXsjl-0-600-0-900-crop.jpg?v=873cc9eae7",
      "reviewText": "This movie is a prime example of how a twist ending doesn't make a bad/average movie better in retrospect. No Way Out is a decent thriller but the ending is so nonsensical. Went in looking to fill some gaps in my Gene Hackman watches and was disappointed to get way more Costner. Hackman is good here, playing sleazy and desperate in equal measure but he just doesn't get enough screen time. Instead, Costner, who I've always felt is less an actor than a \"movie star\" runs around the Pentagon like a maniac for half the movie. Was hoping Hackman would be more adversarial but after the \"incident\" he's largely out of play until the end. Will Patton seems like he's in a completely different movie than everyone else but is maybe the best part."
    },
    {
      "title": "Fist of Legend",
      "link": "https://letterboxd.com/peruvianidol/film/fist-of-legend/",
      "watchedDate": "2025-02-27",
      "filmYear": "1994",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/0/7/6/5/40765-fist-of-legend-0-600-0-900-crop.jpg?v=ce49ed6888",
      "reviewText": "I have fond memories of Fist of Legend, my first introduction to Jet Li. There's a ton of kinetic, hard-hitting fight scenes in this, including a prolonged fight with an imposing final boss-type at the end. There are some painful lulls in between but the fights are so well-choreographed and filmed, compared to anything I'd ever seen before in the 90s. This 4k blu-ray looks great but the sound is unfortunately mono. Looking forward to filling out my 4k collection with more Jet Li films, including Tai Chi Master and Fong Sai Yuk."
    },
    {
      "title": "The Hidden",
      "link": "https://letterboxd.com/peruvianidol/film/the-hidden/",
      "watchedDate": "2025-02-26",
      "filmYear": "1987",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/07/47/cd/lc/5CEVBtcNEhz9zJxAKpdaYUAL700-0-600-0-900-crop.jpg?v=171817c2dd",
      "reviewText": "This movie is amazing. It dives right in and keeps getting crazier and more (inadvertently?) funny as it goes. Extremely 80s."
    },
    {
      "title": "Body Parts",
      "link": "https://letterboxd.com/peruvianidol/film/body-parts/",
      "watchedDate": "2025-02-25",
      "filmYear": "1991",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/0/6/1/1/30611-body-parts-0-600-0-900-crop.jpg?v=6661a5e163",
      "reviewText": "\"CAN'T YOU SEE THIS ARM IS KILLING ME?!\"An underrated and unhinged horror classic. I remember seeing this in the theater as a sophomore in high school and it still delights me now more than ever. Just a brilliant premise carried out to its ridiculously over-the-top conclusion. Jeff Fahey plays the lead with earnestness and his sweater game is on point. Brad Dourif pops up in this so you know it's good."
    },
    {
      "title": "Demolition Man",
      "link": "https://letterboxd.com/peruvianidol/film/demolition-man/",
      "watchedDate": "2025-02-24",
      "filmYear": "1993",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/8/6/8/46868-demolition-man-0-600-0-900-crop.jpg?v=2a6b346a45",
      "reviewText": "This movie predicted Uber Eats, Zoom calls, AI agents, and self-driving cars and was directed by a guy whose only credit before this was apparently a C+C Music Factory video. It's not a top tier 90s action movie but it's incredibly watchable, largely thanks to Wesley Snipes' charisma and action chops and Sandra Bullock going all-in as Stallone's hopelessly optimistic and 20th century-loving partner. There are some fun action set pieces, including one of the most memorable demises of a villain. How this got made I have no idea but I wish they still made stuff like this."
    },
    {
      "title": "The Social Network",
      "link": "https://letterboxd.com/peruvianidol/film/the-social-network/1/",
      "watchedDate": "2025-02-23",
      "filmYear": "2010",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/nw/cm/pa/ai/sGQv3ZMZBDBnl3z42Q0mEQ5uiDe-0-600-0-900-crop.jpg?v=54ee59f7cd",
      "reviewText": "Zuckerberg sucks. Not sure how much of this movie is true but Fincher's direction, Sorkin's writing, and Reznor and Ross' score add up to a hell of a movie. Looking forward to the legacy-quel in a few years that covers Facebook's (and Zuck's) role in the downfall of society."
    },
    {
      "title": "To Live and Die in L.A.",
      "link": "https://letterboxd.com/peruvianidol/film/to-live-and-die-in-la/",
      "watchedDate": "2025-02-21",
      "filmYear": "1985",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/7/6/9/46769-to-live-and-die-in-l-a--0-600-0-900-crop.jpg?v=4a55db27ed",
      "reviewText": "Just a fun, sleazy, 80s crime movie featuring a pretty epic chase scene and one ridiculous turn after another. Willem Dafoe shines as an expert counterfeiter being pursued by two increasingly incompetent secret service agents. Not a great movie by any means but you can tell this probably inspired Tarantino and others to make similarly over-the-top crime capers."
    },
    {
      "title": "Nickel Boys",
      "link": "https://letterboxd.com/peruvianidol/film/nickel-boys/",
      "watchedDate": "2025-02-18",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/6/5/8/9/926589-nickel-boys-0-600-0-900-crop.jpg?v=c90912e607",
      "reviewText": "A fascinating film that immerses you in the experience of these two young men. Hard to sustain over 2 hours and 20 minutes but the end hits hard. Sadly relevant given our current political climate."
    },
    {
      "title": "SNL50: The Homecoming Concert",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-homecoming-concert/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/1/1/6/5/2/1311652-snl50-the-homecoming-concert-0-600-0-900-crop.jpg?v=9b3187bd1c",
      "reviewText": "A joyous mix of SNL cast doing musical numbers and a who's who of former musical guests doing their hits and collaborating with other artists. I was constantly surprised so I won't spoil it here, but if you love SNL and music in general, you'll dig this!"
    },
    {
      "title": "SNL50: The Anniversary Special",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-anniversary-special/",
      "watchedDate": "2025-02-16",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/0/8/6/1/2/1308612-snl50-the-anniversary-special-0-600-0-900-crop.jpg?v=cdf893e1c4",
      "reviewText": "A lot of fun seeing new sketches with a mix of cast members from the show's 50 years and random famous people. It felt like they could have went a little harder though."
    },
    {
      "title": "SNL50: The Homecoming Concert",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-homecoming-concert/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/1/1/6/5/2/1311652-snl50-the-homecoming-concert-0-600-0-900-crop.jpg?v=9b3187bd1c",
      "reviewText": "A joyous mix of SNL cast doing musical numbers and a who's who of former musical guests doing their hits and collaborating with other artists. I was constantly surprised so I won't spoil it here, but if you love SNL and music in general, you'll dig this!"
    },
    {
      "title": "Wild Things",
      "link": "https://letterboxd.com/peruvianidol/film/wild-things/",
      "watchedDate": "2025-02-10",
      "filmYear": "1998",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/5/0/6/51506-wild-things-0-600-0-900-crop.jpg?v=bc7b982455",
      "reviewText": "I feel like maybe I saw this before but it was so forgettable that nothing stuck. I definitely remember the poster. Anyway, this movie is very 90s in just about every way. A modern-ish noir with lots of twists and turns and plot points that fall apart if you think about them for more than half a second. It's like a Lifetime movie made for Cinemax, with Denise Richards providing lots of male gaze bits. It's not a good movie by any means but it's pretty fun and trashy all the way through to the credits, where a bunch of stuff is revealed that happened off-camera."
    },
    {
      "title": "Dog Man",
      "link": "https://letterboxd.com/peruvianidol/film/dog-man/",
      "watchedDate": "2025-02-07",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/9/3/7/3/3/693733-dog-man-0-600-0-900-crop.jpg?v=c978774be5",
      "reviewText": "This was more fun than I was expecting. Dog Man is the hero but it's really Pete Davidson's movie. There was a lot to relate to in being a parent and dog owner. At one point Petey asks L'il Petey, \"how come I made you but you're not like me?\" To which L'il Petey responds, \"maybe I am but you just don't like that part.\" That gutted me. Some great humor and 80s references for parents and came in at under 90 minutes."
    },
    {
      "filmTitle": "Sing Sing",
      "link": "https://letterboxd.com/peruvianidol/film/sing-sing-2023/",
      "watchedDate": "2025-02-02",
      "filmYear": "2023",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/4/1/9/5/7/1041957-sing-sing-2023-0-600-0-900-crop.jpg?v=f893b22924",
      "reviewText": "There’s a vulnerability in acting that almost seems incongruous with prison life. Yet this story, about the real-life Rehabilitation Through the Arts program at Sing Sing, proves that wrong, blending fact with fiction with a cast of real RTA alums. Coleman Domingo gives a powerful performance and deserves all of the awards buzz. But the real standout for me was Clarence Maclin, one of the RTA members, who plays his vital arc with convincing nuance. A great pairing with Ghostlight, which also shows the redemptive power of theater."
    },
    {
      "filmTitle": "Land of Bad",
      "link": "https://letterboxd.com/peruvianidol/film/land-of-bad/",
      "watchedDate": "2025-01-30",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/7/2/7/5/5/872755-land-of-bad-0-600-0-900-crop.jpg?v=0d2d580e81",
      "reviewText": "A perfectly cromulent dadcore movie with two Hemsworths (but not the good one) and a thicc Russell Crowe as the guy in the chair. Strains credulity near the end but mostly enjoyable otherwise."
    },
    {
      "filmTitle": "Babygirl",
      "link": "https://letterboxd.com/peruvianidol/film/babygirl-2024/",
      "watchedDate": "2025-01-29",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/9/1/2/5/989125-babygirl-2024-0-600-0-900-crop.jpg?v=b175884970",
      "reviewText": "The horniest movie since Sanctuary, which it has a lot in common with. Kidman is great, you don’t often see older women depicted in positions of power while also screwing a much younger guy. Dickinson is kind of an empty vessel here, but maybe that was the point. I don’t buy for a minute that Antonio Banderas can’t get it done in the bedroom."
    },
    {
      "filmTitle": "Number 24",
      "link": "https://letterboxd.com/peruvianidol/film/number-24/",
      "watchedDate": "2025-01-27",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/0/5/8/9/5/1105895-number-24-0-600-0-900-crop.jpg?v=e7ca84c935",
      "reviewText": "A timely tale of the Norwegian resistance during WW2, and Norway’s most decorated hero, Gunnar Sønsteby. Framed by a Q&A many years after the war, Gunnar tells the audience of young Norwegians, “All these stories that you see that are published in the papers, they tell them. It’s the owners. What to print and what not to print. Every single time. So in the case of war, well, those papers should be lit instead. They’re mere kindling.” That really stuck with me given the current state of things. The flashbacks to the war are pretty standard fare, but Gunnar’s reckoning with his actions after being questioned by a young woman at the Q&A was quite poignant. Worth watching."
    },
    {
      "filmTitle": "Zero Effect",
      "link": "https://letterboxd.com/peruvianidol/film/zero-effect/",
      "watchedDate": "2025-01-27",
      "filmYear": "1998",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/5e/g1/tb/du/qmgUyhyJQwHzZ7ulaYCJLBon7gG-0-600-0-900-crop.jpg?v=6b30952605",
      "reviewText": "Such an underrated 90s gem. Maybe my favorite Bill Pullman movie. Kim Dickens is great, playing vulnerable, calculating and mysterious in equal turns. And Ben Stiller! It’s wild to me that the same director also did Walk Hard AND Red One. This movie practically begs for a TV show."
    },
    {
      "filmTitle": "Blink Twice",
      "link": "https://letterboxd.com/peruvianidol/film/blink-twice/",
      "watchedDate": "2025-01-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/7/5/6/0/4/2/756042-blink-twice-0-600-0-900-crop.jpg?v=2f35ddcd4e",
      "reviewText": "Wow, that was deeply unsettling. Blink Twice sets the table and then just kinda of lets you stew in a sense of unease before finally revealing itself. From there it gets wild. I never thought much of Channing Tatum as an actor but he’s perfectly cast here, delivering a mix of charm and menace. The ending is *chef’s kiss*."
    },
    {
      "filmTitle": "Gangs of New York",
      "link": "https://letterboxd.com/peruvianidol/film/gangs-of-new-york-2002/",
      "watchedDate": "2025-01-23",
      "filmYear": "2002",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/9/8/4/6/49846-gangs-of-new-york-0-600-0-900-crop.jpg?v=5c4435acc6",
      "reviewText": "There’s a lot to love here, particularly Daniel Day-Lewis’ performance as Bill the Butcher. It feels like both DiCaprio and Diaz are miscast and Scorsese just tries to do too much at the end. There’s a lot of build-up to a climactic confrontation that’s largely disrupted by a historical event. This movie is probably more relevant to today’s political climate than it was in 2002. If only we could see we should be fighting the “$300 men” instead of each other."
    },
    {
      "filmTitle": "Nosferatu",
      "link": "https://letterboxd.com/peruvianidol/film/nosferatu-2024/",
      "watchedDate": "2025-01-22",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/5/9/5/0/5/359505-nosferatu-2024-0-600-0-900-crop.jpg?v=a12d4ad648",
      "reviewText": "Incredible. A feast for the eyes. Riveting from beginning to end. Perhaps my favorite Eggers film so far. Willem Dafoe is my king."
    },
    {
      "filmTitle": "2073",
      "link": "https://letterboxd.com/peruvianidol/film/2073/",
      "watchedDate": "2025-01-21",
      "filmYear": "2024",
      "memberRating": "1.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/2/8/8/2/922882-2073-0-600-0-900-crop.jpg?v=58a1e20c8e",
      "reviewText": "This “documentary” is like “Somebody Should Do Something About All the Problems” framed in a vague speculative fiction dystopia. It lists off problems that, to no one’s surprise, are bad! And if left unchecked, could lead to a disastrous future, as if it’s not already here. It asks us to take action before it’s too late but has no ideas about what those actions might be. One of the many problems it covers is AI, but it seems like AI was used to make the doc? 84 minutes of my life I’ll never get back."
    },
    {
      "filmTitle": "I Saw the Devil",
      "link": "https://letterboxd.com/peruvianidol/film/i-saw-the-devil/",
      "watchedDate": "2025-01-10",
      "filmYear": "2010",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/m3/dw/c1/xn/4o52BPrgvq7b2xFy1OdVSIoIn1T-0-600-0-900-crop.jpg?v=7cdd6fab3f",
      "reviewText": "Well that was bleak."
    },
    {
      "filmTitle": "Se7en",
      "link": "https://letterboxd.com/peruvianidol/film/se7en/1/",
      "watchedDate": "2025-01-08",
      "filmYear": "1995",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/3/4/5/51345-se7en-0-600-0-900-crop.jpg?v=76a14ef6b4",
      "reviewText": "Gorgeous 4K transfer. The last 20 minutes of this is perfect. Even after maybe a dozen viewings it’s still incredibly tense."
    },
    {
      "filmTitle": "A Real Pain",
      "link": "https://letterboxd.com/peruvianidol/film/a-real-pain/",
      "watchedDate": "2025-01-06",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/1/3/2/5/8/913258-a-real-pain-0-600-0-900-crop.jpg?v=893a943872",
      "reviewText": "This was really bizarre to watch as I recognized aspects of myself in both Kieran Culkin and Jesse Eisenberg’s characters that are often in conflict. It was like seeing my inner voice projected on the screen. Their journey together and their interactions with the people around them almost felt like set dressing to inform the relationship between these two cousins. I’ll have to give it another watch. The last shot shook me."
    },
    {
      "filmTitle": "Your Friend, Nate Bargatze",
      "link": "https://letterboxd.com/peruvianidol/film/your-friend-nate-bargatze/",
      "watchedDate": "2025-01-01",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/6/2/7/5/2/1262752-your-friend-nate-bargatze-0-600-0-900-crop.jpg?v=cfb5590e05",
      "reviewText": "I like Nate but his dry, clean humor doesn’t elicit much more than a hearty chuckle from me."
    },
    {
      "filmTitle": "We Live in Time",
      "link": "https://letterboxd.com/peruvianidol/film/we-live-in-time/",
      "watchedDate": "2024-12-31",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/9/1/7/8/6/991786-we-live-in-time-0-600-0-900-crop.jpg?v=14245ba118",
      "reviewText": "Not sure this needed to have such a non-linear narrative, except “time” is in the title, so I guess? I enjoyed the chemistry between Garfield and Pugh, but it probably would have worked the same as a conventional narrative. Some good moments but ultimately I don’t think it was terribly memorable."
    },
    {
      "filmTitle": "Challengers",
      "link": "https://letterboxd.com/peruvianidol/film/challengers/1/",
      "watchedDate": "2024-12-29",
      "filmYear": "2024",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/4/2/3/0/1/842301-challengers-0-600-0-900-crop.jpg?v=a7cd63cbef",
      "reviewText": "Struggled to stay awake through this as I was doped up on NyQuil as my wife and I watched this in a hotel room, both struggling with some unknown virus. On top of that the hotel TV had motion-smoothing turned on, which was extremely distracting. All that said, this movie still slaps. Incredible score and just a fun horny time with three great leads."
    },
    {
      "filmTitle": "Nightbitch",
      "link": "https://letterboxd.com/peruvianidol/film/nightbitch/",
      "watchedDate": "2024-12-28",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/5/1/2/2/6/651226-nightbitch-0-600-0-900-crop.jpg?v=9717400486",
      "reviewText": "Amy Adams is great in this spin on Teen Wolf. Lots to relate to here as tired parent."
    },
    {
      "filmTitle": "Red Rooms",
      "link": "https://letterboxd.com/peruvianidol/film/red-rooms/",
      "watchedDate": "2024-12-26",
      "filmYear": "2023",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/1/8/7/9/8/818798-red-rooms-0-600-0-900-crop.jpg?v=af37112bc2",
      "reviewText": "Absolutely chilling. Feels very of the moment with our obsession with true crime and its depiction of the dark web. Juliette Gariépy delivers an incredible performance, creepy and understated at the same time. This movie kept me guessing until the very end."
    },
    {
      "filmTitle": "Heretic",
      "link": "https://letterboxd.com/peruvianidol/film/heretic-2024/",
      "watchedDate": "2024-12-25",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/2/5/3/3/1/1025331-heretic-2024-0-600-0-900-crop.jpg?v=c79c5c8121",
      "reviewText": "My mom told me she once invited a Jehovah's Witness in for a chat and they by the time they left they were no longer a Jehovah's Witness and now I have questions. Anyway, this was fiendishly clever and it seems like the type of movie that will benefit from repeat viewings. Chilling performance from Hugh Grant."
    },
    {
      "filmTitle": "It's a Wonderful Life",
      "link": "https://letterboxd.com/peruvianidol/film/its-a-wonderful-life/9/",
      "watchedDate": "2024-12-24",
      "filmYear": "1946",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/4/9/50949-it-s-a-wonderful-life-0-600-0-900-crop.jpg?v=64b72dd083",
      "reviewText": "\"...this rabble you're talking about, they do most of the working and paying and living and dying in this community. Well, is it too much to have them work and pay and live and die in a couple of decent rooms and a bath?\"Turns out we're all living in Pottersville and Mr. Potter is President-elect."
    },
    {
      "filmTitle": "Y2K",
      "link": "https://letterboxd.com/peruvianidol/film/y2k-2024/",
      "watchedDate": "2024-12-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/6/2/5/7/986257-y2k-0-600-0-900-crop.jpg?v=f5b3bd7137",
      "reviewText": "Kyle Mooney's humor is definitely not for everyone but this movie had me laughing my ass off. Heavy on the late 90s nostalgia and includes maybe the best cameo of the year. Brilliantly spoofs movies of that era and mixes genres in a fun way. It's almost a millennial Wet Hot American Summer. Didn't love this as much as Brigsby Bear but was not disappointed."
    },
    {
      "filmTitle": "The Order",
      "link": "https://letterboxd.com/peruvianidol/film/the-order-2024/",
      "watchedDate": "2024-12-24",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/7/5/3/9/3/975393-the-order-2024-0-600-0-900-crop.jpg?v=4a956cfea6",
      "reviewText": "I dug the 80s aesthetic here and loved Jude Law as a grizzled FBI agent chasing down a group of white nationalists. The whole thing didn't add up to much, mostly because there's just not enough time to develop its characters. There's definitely some Heat and Sicario influences at play but The Order lacks the depth of those films. Might have been better as the next season of True Detective."
    },
    {
      "filmTitle": "The Substance",
      "link": "https://letterboxd.com/peruvianidol/film/the-substance/1/",
      "watchedDate": "2024-12-23",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/3/8/1/4/0/838140-the-substance-0-600-0-900-crop.jpg?v=ab9e1072f8",
      "reviewText": "Watched this again with my wife and it was delightful watching her squirm and squeal through the increasingly disturbing moments. Props to Demi for reading this script and going, \"hell yes, let's do this.\""
    }
  ]
}