{
  "lastUpdated": "2025-09-01T17:18:20.611Z",
  "movies": [
    {
      "title": "We're No Angels",
      "link": "https://letterboxd.com/peruvianidol/film/were-no-angels-1989/",
      "watchedDate": "2025-09-01",
      "filmYear": "1989",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/8/5/2/8/48528-we-re-no-angels-0-600-0-900-crop.jpg?v=d911e1322a",
      "reviewText": "Around the time this came out on cable I used to watch it all the time. It’s a goofy premise (which I only now learned was written by David Mamet, of all people) but DeNiro and Penn really sell it. DeNiro with his entire range of facial expressions and Penn with his earnestness. There’s also a spunky young Demi Moore, John C Reilly doing his thing, and Wallace Shawn. It’s almost cartoonishly silly, but it still tickled me all these years later."
    },
    {
      "title": "Unknown Number: The High School Catfish",
      "link": "https://letterboxd.com/peruvianidol/film/unknown-number-the-high-school-catfish/",
      "watchedDate": "2025-08-31",
      "filmYear": "2025",
      "memberRating": "0.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/9/3/7/7/5/1393775-unknown-number-the-high-school-catfish-0-600-0-900-crop.jpg?v=2ca7cc0cd5",
      "reviewText": "I hated every minute of this. It’s supposed to be a huge shock who the culprit is but it felt pretty obvious they wouldn’t make a documentary about it if it were anyone else. I felt bad for the kids involved and this makes me want to never get my kids a phone. Thanks for nothing to Dave who suggested we watch this."
    },
    {
      "title": "Malice",
      "link": "https://letterboxd.com/peruvianidol/film/malice/",
      "watchedDate": "2025-08-29",
      "filmYear": "1993",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/q1/5c/hb/qp/gyWTdehNMfZmU7pUpuKamNE0YeW-0-600-0-900-crop.jpg?v=934b7adf22",
      "reviewText": "I remember seeing this on opening night in a sold out theater, an impressionable 18-year-old, barely a month into my freshman year in college. I had never seen anything like it. Years later it’s obvious the movies that influenced it, but to mention them here would spoil the surprises. Suffice it to say, this movie still slaps. I love it unapologetically. The central cast is great, including an all-time monologue from Alec Baldwin about his “god complex.” Lots of great supporting actors pop up, including Anne Bancroft and a 21-year-old Gwenyth Paltrow. Also, I was shocked to learn it was co-written by Aaron Sorkin! When the final twist was revealed, I cackled out loud and it brought me back to that packed college theater where everyone was hooting and hollering."
    },
    {
      "title": "Naked Gun 33⅓: The Final Insult",
      "link": "https://letterboxd.com/peruvianidol/film/naked-gun-33-the-final-insult/",
      "watchedDate": "2025-08-29",
      "filmYear": "1994",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/7/7/7/5/27775-naked-gun-33-the-final-insult-0-600-0-900-crop.jpg?v=374b865724",
      "reviewText": "Certainly the horniest Naked Gun, if not the funniest. The opening spoof of the train station scene in The Untouchables is funnier than anything in Naked Gun 2. Lots of funny bits around Frank and Jane’s relationship. Fred Ward is having a blast hamming it up as the villain. As with the rest of the series, some of the jokes didn’t age well, but this one had me laughing out loud quite a bit."
    },
    {
      "title": "See No Evil, Hear No Evil",
      "link": "https://letterboxd.com/peruvianidol/film/see-no-evil-hear-no-evil/",
      "watchedDate": "2025-08-29",
      "filmYear": "1989",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/5/2/4/45524-see-no-evil-hear-no-evil-0-600-0-900-crop.jpg?v=584bce1c6c",
      "reviewText": "A cable staple when I was a teenager. Loved the chemistry between Wilder and Pryor. No one else could probably pull off this premise. Joan Severance was also formative to young Mike. 😅 Happy to say this movie still tickles me, even if some of the humor hasn’t aged well. This is like watching Magic and Larry Bird in their prime. But also, Kevin Spacey is in this?"
    },
    {
      "title": "Crimson Tide",
      "link": "https://letterboxd.com/peruvianidol/film/crimson-tide/",
      "watchedDate": "2025-08-28",
      "filmYear": "1995",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/4/7/2/47472-crimson-tide-0-600-0-900-crop.jpg?v=07d0e0d0aa",
      "reviewText": "Still holds up as one of the great submarine movies. Solid cast led by Denzel and Hackman, both doing their best work here, backed by a bunch of great character actors. Zimmer’s score is excellent, and Tony Scott’s flair for shooting action and tension is top notch. Even the lighting is awesome. This could have been released in 2025 and it would still be a banger."
    },
    {
      "title": "The Naked Gun 2½: The Smell of Fear",
      "link": "https://letterboxd.com/peruvianidol/film/the-naked-gun-2-the-smell-of-fear/",
      "watchedDate": "2025-08-26",
      "filmYear": "1991",
      "memberRating": "1.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/7/2/8/3/27283-the-naked-gun-2-the-smell-of-fear-0-600-0-900-crop.jpg?v=678103403b",
      "reviewText": "Even at 85 minutes this sequel is a slog to get through. I’m sure I’d seen this several times but almost none of it felt familiar. In fact, minutes after the credits rolled I’ve already forgotten most of it."
    },
    {
      "title": "Eenie Meanie",
      "link": "https://letterboxd.com/peruvianidol/film/eenie-meanie/",
      "watchedDate": "2025-08-25",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/3/7/5/8/0/1037580-eenie-meanie-0-600-0-900-crop.jpg?v=58370b6070",
      "reviewText": "Great premise, some fun car chases, loved the Elmore Leonard-ness of the script but I just couldn’t buy the central relationship. I don’t know if the guy was just miscast or was poorly written but yikes. Samara Weaving is great and it’s always nice when Andy Garcia and Marshawn Lynch pop up. The way things played out just didn’t work for me."
    },
    {
      "title": "F1",
      "link": "https://letterboxd.com/peruvianidol/film/f1/1/",
      "watchedDate": "2025-08-22",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/1/7/9/7/7/817977-f1-the-movie-0-600-0-900-crop.jpg?v=f5ae2b99b9",
      "reviewText": "Still thrilling the second time around. The cinematography on and inside the cars is wild. They’re not just static either, they pan seamlessly from the road ahead to the driver’s face. Love Zimmer’s score too. There’s not a ton in this movie that’s not racing. Maybe that’s to the detriment of the characters but even if you’re not into racing you still get a thrill watching the characters try and win."
    },
    {
      "title": "Barbarian",
      "link": "https://letterboxd.com/peruvianidol/film/barbarian-2022/1/",
      "watchedDate": "2025-08-21",
      "filmYear": "2022",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/1/9/6/4/8/819648-barbarian-0-600-0-900-crop.jpg?v=75b067327a",
      "reviewText": "How are you gonna set a film in Detroit and not put Tim Robinson in it? Revisited this after Weapons. It’s a solid debut and the first act is great but as it gets weirder it gets less interesting because it leaves less to your imagination."
    },
    {
      "title": "The Fly",
      "link": "https://letterboxd.com/peruvianidol/film/the-fly-1986/",
      "watchedDate": "2025-08-20",
      "filmYear": "1986",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/1/7/1/47171-the-fly-0-600-0-900-crop.jpg?v=30802b8573",
      "reviewText": "Incredible body horror classic. Hadn’t seen it in ages. I forgot how utterly disturbing the last 10 minutes were. Goldblum is perfectly cast as a twitchy nerd fused with a fly, his subtle mannerisms getting more fly-like throughout. For a relatively short movie, it drags at times, particularly all of the 80s obsession dudes had with getting laid. Still, the practical effects are still pretty amazing. A remake these days would probably be all CG and lose all of the magic."
    },
    {
      "title": "The Count of Monte Cristo",
      "link": "https://letterboxd.com/peruvianidol/film/the-count-of-monte-cristo-2002/",
      "watchedDate": "2025-08-19",
      "filmYear": "2002",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/3/7/2/45372-the-count-of-monte-cristo-0-600-0-900-crop.jpg?v=6b0dfe281a",
      "reviewText": "Had I seen this version first I may have enjoyed the 2024 version a bit less. This version is considerably more streamlined and has a very Hollywood ending. However, I loved the relationship between Dantes and Luis Guzman’s Jacopo, who is present in the 2024 version but has no lines and the nature of their relationship is never mentioned. I also loved Richard Harris as Abbé Faria, much more playful in this version. Guy Pierce really chews up the scenery as the main target of Dante’s’ vengeance, while the other two are relegated to almost footnotes. Also 18-year-old Henry Cavill! This version is great in its own right. I’d say if you like this version and haven’t seen the 2024 one, they’re quite different in style and execution, you might enjoy it as well though."
    },
    {
      "title": "The Count of Monte Cristo",
      "link": "https://letterboxd.com/peruvianidol/film/the-count-of-monte-cristo-2024/",
      "watchedDate": "2025-08-18",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/7/7/8/3/5/977835-the-count-of-monte-cristo-2024-0-600-0-900-crop.jpg?v=f72dd77674",
      "reviewText": "I have to confess I’ve never read the book or seen any other adaptation — this movie slapped. Beautifully shot with amazing production design. Damn near three hours long though the pace is so brisk you just lose yourself in it. The machinations of the Count’s revenge are so diabolical I was giddy. The disguises require a bit of suspension of disbelief, but each one was great. Feels like it will reward rewatching. I’m curious now where this ranks among all the other versions. This one is great."
    },
    {
      "title": "High and Low",
      "link": "https://letterboxd.com/peruvianidol/film/high-and-low/",
      "watchedDate": "2025-08-17",
      "filmYear": "1963",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/do/zm/ur/ug/dgnyE40yWdI7gbaHmmB5yCCIVpI-0-600-0-900-crop.jpg?v=b0fd9f50fd",
      "reviewText": "This movie surprised me at every turn. It starts as almost a stage play before turning into a full-on police procedural. It goes places both literally and figuratively that I wasn’t expecting. There are some extraordinary touches like a dash of color in an otherwise black and white movie, and the eerie reflection in the kidnapper’s sunglasses. The ending fell a little flat for me. I guess I’ve been conditioned by modern movies to expect big twist. It felt very Japanese. I can see why Spike’s remake is getting such tepid reviews. The bar is set pretty high here."
    },
    {
      "title": "The Martian",
      "link": "https://letterboxd.com/peruvianidol/film/the-martian/1/",
      "watchedDate": "2025-08-17",
      "filmYear": "2015",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/1/1/5/1/1/211511-the-martian-0-600-0-900-crop.jpg?v=71ca0c832e",
      "reviewText": "Suggested this to my space-obsessed six-year-old and he loved it. He’s only ever seen Matt Damon as a stranded astronaut (Interstellar). Just a really solid story about human ingenuity which somehow feels quaint 10 years later. Incredibly deep cast and surprisingly funny. The climactic rescue is pretty thrilling!"
    },
    {
      "title": "Eddington",
      "link": "https://letterboxd.com/peruvianidol/film/eddington/",
      "watchedDate": "2025-08-16",
      "filmYear": "2025",
      "memberRating": "1.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/7/4/5/9/5/574595-eddington-0-600-0-900-crop.jpg?v=925abc6d9b",
      "reviewText": "A frustratingly bad Coen Brothers ripoff. Tries to satirize the ridiculousness of conservatives and liberals alike during the height of the pandemic in such a ham-fisted way, it’s unclear what the movie is even trying to say. In the last 15 minutes things happen but it’s not entirely clear why or what any of it means. It’s wild that Pedro Pascal is in damn near everything this year but hardly in those things at the same time. Here again, like Materialists, he’s pretty much wasted."
    },
    {
      "title": "TRON: Legacy",
      "link": "https://letterboxd.com/peruvianidol/film/tron-legacy/",
      "watchedDate": "2025-08-13",
      "filmYear": "2010",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/8/9/5/7/38957-tron-legacy-0-600-0-900-crop.jpg?v=9452aea970",
      "reviewText": "This sequel looks gorgeous but maybe a little too pristine. Part of the charm of the first Tron was that the effects were scrappy. The change makes sense thematically but is undercut by the jarring uncanny valley of Clu, a digitized and de-aged Jeff Bridges. They should have leaned more into the imperfection. The plot is pretty nonsensical, not that the first one was incredible either. Bridges seems like he’s in full Lebowski mode here minus the laughs. The music and the aesthetic really carry this, but also show the beginnings of a style that Kosinski would go on to hone in Oblivion, Top Gun: Maverick, and F1."
    },
    {
      "title": "Weapons",
      "link": "https://letterboxd.com/peruvianidol/film/weapons-2025/",
      "watchedDate": "2025-08-12",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/7/2/1/0/9/972109-weapons-2025-0-600-0-900-crop.jpg?v=8100270337",
      "reviewText": "Went to a SOLD OUT screening on a Tuesday night. I can’t remember the last time I was at a sold out show, much less on a Tuesday. An incredible communal experience seldom had anymore. This movie is remarkable. Easily my favorite horror movie in ages. I can’t say much without spoiling it but suffice it to say, you should check this out in the theater while you can. Great cast, darkly funny and plays on so many of our current phobias in a really effective way. My jaw was on the floor as the credits rolled. If it wasn’t the last show I may have gotten right back in line for another ticket."
    },
    {
      "title": "Tron",
      "link": "https://letterboxd.com/peruvianidol/film/tron/",
      "watchedDate": "2025-08-06",
      "filmYear": "1982",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/x2/ki/kc/v5/cTF8lpXvAwT1SLH9kVFZZl0AO0D-0-600-0-900-crop.jpg?v=8ed1949fef",
      "reviewText": "Haven’t seen this since I was a kid. The story is not that great but wow, it’s visually breathtaking even all these years later. Apparently this wasn’t nominated for any visual effects awards because they thought using computers was cheating? How quaint. Oddly prescient about the dangers of giving computers control and their applications for making ridiculous sums of money. Never saw the sequel but with the third coming I thought I’d revisit these."
    },
    {
      "title": "Together",
      "link": "https://letterboxd.com/peruvianidol/film/together-2025/",
      "watchedDate": "2025-08-05",
      "filmYear": "2025",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/2/5/3/9/7/1125397-together-2025-0-600-0-900-crop.jpg?v=68e41bfaf3",
      "reviewText": "Talk about the beast with two backs. Yikes."
    },
    {
      "title": "House of Games",
      "link": "https://letterboxd.com/peruvianidol/film/house-of-games/",
      "watchedDate": "2025-08-04",
      "filmYear": "1987",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/qc/1d/pf/nz/6JfcymnGizEerV0X3wfdOwO0gmA-0-600-0-900-crop.jpg?v=05aea89392",
      "reviewText": "A slow burn with really stilted dialog but, boy, when this thing gets going it’s great. Kept me guessing until the end."
    },
    {
      "title": "Medium Cool",
      "link": "https://letterboxd.com/peruvianidol/film/medium-cool/",
      "watchedDate": "2025-08-02",
      "filmYear": "1969",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/2/4/7/4/22474-medium-cool-0-600-0-900-crop.jpg?v=ed4aaaaae8",
      "reviewText": "A fascinating time capsule of late 1960s Chicago, mixing documentary footage with actors and a narrative. I’m not sure the narrative part works, particularly the ending, but the idea is pretty bold. Highlights the city of Chicago with an authenticity few films have matched. Tracy Letts picked this in The Big Picture’s live Chicago movie draft, along with a few others I haven’t seen. Also stars Peter Bonerz. Great name."
    },
    {
      "title": "The Naked Gun: From the Files of Police Squad!",
      "link": "https://letterboxd.com/peruvianidol/film/the-naked-gun-from-the-files-of-police-squad/",
      "watchedDate": "2025-08-02",
      "filmYear": "1988",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/7/2/8/4/27284-the-naked-gun-0-600-0-900-crop.jpg?v=7f848fb394",
      "reviewText": "One of my all-time favorite comedies. I’ve probably seen it dozens of times, though not for many years. It still holds up, with jokes and gags coming at such a dizzying pace it seems like you pick up something new each time you watch it. Nielsen is so great, delivering even the dumbest of lines with deadpan gravitas. Even though I haven’t seen this in forever I was still able to remember damn near every line."
    },
    {
      "title": "The Naked Gun",
      "link": "https://letterboxd.com/peruvianidol/film/the-naked-gun/",
      "watchedDate": "2025-08-01",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/3/3/3/8/1/933381-the-naked-gun-0-600-0-900-crop.jpg?v=6acd6cd210",
      "reviewText": "Pales in comparison to the original. Even though it’s roughly the same runtime, it seems like it only lasted an hour. Neeson is inspired casting, especially if you’ve seen him on Life’s Too Short, but the script doesn’t give him much to work with. Pamela Anderson is also great, she really goes for it. I almost wish this were longer so we could get more Paul Walter Hauser as Drebin’s partner. There’s definitely some funny moments but I’d be hard pressed to recall any great lines, even less than an hour after getting out of the theater. This movie somehow made me reassess my rating of Happy Gilmore 2."
    },
    {
      "title": "The Counselor",
      "link": "https://letterboxd.com/peruvianidol/film/the-counselor/",
      "watchedDate": "2025-07-30",
      "filmYear": "2013",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/7/6/8/5/87685-the-counselor-0-600-0-900-crop.jpg?v=676ccd66bd",
      "reviewText": "Some things are greater than the sum of their parts. The Counselor is, well, the opposite of that. On paper, a Ridley Scott film written by Cormac McCarthy and starring this A-List cast seems like a sure fire hit. But what we get instead is a bunch of memorable scenes intercut with lots of talk about sex, and not in an interesting way. Half of the characters are like something out of a GTA game and the dialogue is so heavy-handed it doesn’t make sense coming out of these characters, even when it’s delivered by great actors. The whole thing adds up to very little because it seems the characters fall victim to their own actions which are only alluded to during the course of the movie, and their fates don’t really feel justified based on the plot of the movie. It’s just all so very random. But damn, Checkov’s Bolito."
    },
    {
      "title": "Prince of Darkness",
      "link": "https://letterboxd.com/peruvianidol/film/prince-of-darkness/",
      "watchedDate": "2025-07-26",
      "filmYear": "1987",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/5/6/9/47569-prince-of-darkness-0-600-0-900-crop.jpg?v=eb511413db",
      "reviewText": "Sorry but I just don’t find a bunch of grad students in khaki pants all that scary. This is one of Carpenter’s 80s movies that I somehow missed. Feels like a mashup of some of his previous work. The first hour is dreadfully dull but once the juice is loose, so to speak, things get interesting with some fun body horror and practical effects. This movie could explain why evangelicals are so opposed to higher education."
    },
    {
      "title": "Happy Gilmore 2",
      "link": "https://letterboxd.com/peruvianidol/film/happy-gilmore-2/",
      "watchedDate": "2025-07-25",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/4/7/3/7/1/1147371-happy-gilmore-2-0-600-0-900-crop.jpg?v=43c978d784",
      "reviewText": "There’s no reason for this sequel to exist besides the fact that Netflix dropped a boatload of money on Sandler. Despite that, this movie is a ton of fun. The plot is even thinner than the first but the sheer amount of jokes and cameos keep things interesting. Nearly all of the characters from 30 years ago make an appearance in some way (even the dead ones) and nearly all of them have offspring perfect for stunt casting. If, like me, you watched the original a bunch of times on VHS or cable TV in college, you’ll get a kick out of this."
    },
    {
      "title": "Mississippi Burning",
      "link": "https://letterboxd.com/peruvianidol/film/mississippi-burning/",
      "watchedDate": "2025-07-25",
      "filmYear": "1988",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/0/9/50909-mississippi-burning-0-600-0-900-crop.jpg?v=d5bd127e96",
      "reviewText": "Near the end of Mississippi Burning, Willem Dafoe’s FBI Agent Ward says, “Anyone’s guilty who watches this happen and pretends it isn’t.” As tough as the movie is to watch, some degree of justice is served at the end. But sadly enough, the guilty are now in the highest offices, inflicting greater wounds on larger swaths of people that aren’t like them. This was made some thirty years after the events depicted and now, 60 years on we haven’t done much better. This might be up there for Hackman’s greatest roles. The antithesis of his character in Unforgiven. Dafoe is also great as his partner, and there’s a slew of “that guy” to be found on both sides of the law. This movie is near perfect if only it had given its black characters as much depth and dialogue as it does its white characters. It’s left up to a bunch of white FBI agents to save the day which, in retrospect, seems highly implausible."
    },
    {
      "title": "The Fantastic Four: First Steps",
      "link": "https://letterboxd.com/peruvianidol/film/the-fantastic-four-first-steps/",
      "watchedDate": "2025-07-24",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/4/3/9/6/7/543967-the-fantastic-four-first-steps-0-600-0-900-crop.jpg?v=ab7c919b04",
      "reviewText": "The bar for recent Marvel movies is pretty low, and even lower for Fantastic Four movies, so I was pleasantly surprised how much I enjoyed this. I loved the retro-future aesthetic (spotted one of Chicago’s iconic Marina Towers at one point) and the chemistry between all the members was great and believable. This is the first Marvel movie in forever where it didn’t feel like you needed to do homework to follow the story, and they weren’t adding a bunch of storylines to set up the next thing. There’s no glowing MacGuffin and the stakes are both high and personal. F4 definitely feels like a spiritual companion to this summer’s Superman, which is similarly colorful and hope-filled. But I’d feel more comfortable taking my 3- and 6-year-old to F4 than Superman, which has a few moments that are a little too mature for younger kids."
    },
    {
      "title": "Vanishing Point",
      "link": "https://letterboxd.com/peruvianidol/film/vanishing-point/",
      "watchedDate": "2025-07-23",
      "filmYear": "1971",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/4/8/5/7/44857-vanishing-point-0-600-0-900-crop.jpg?v=3bb5b41b70",
      "reviewText": "This movie is a real vibe. The first half is great — mostly driving with an occasional flashback to a time Kowalski saw a titty — but the more people talked, the less I enjoyed it. This movie feels like it had a lot to say but I’m not sure I got it. Great cinematography. Lots of wide angle shots of the desert and mountains. I imagine this was pretty influential, with shades of Blues Brothers, Mad Max, Drive, and even Do the Right Thing. Also, Charlotte Rampling. Wowsa."
    },
    {
      "title": "Tremors",
      "link": "https://letterboxd.com/peruvianidol/film/tremors/",
      "watchedDate": "2025-07-21",
      "filmYear": "1990",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/as/zy/qv/ft/aC2wOckYHkLi9usARIfqR51OFV9-0-600-0-900-crop.jpg?v=71c5d815d7",
      "reviewText": "Haven’t seen this in ages but it’s fun as hell. Great chemistry between Kevin Bacon and Fred Ward, clever use of practical effects, and some delightful Raimi-esque shots. A perfect blend of comedy and creature horror. Sad that we’ll never see a movie where Fred Ward plays Jon Bernthal’s dad."
    },
    {
      "title": "The Beach",
      "link": "https://letterboxd.com/peruvianidol/film/the-beach/",
      "watchedDate": "2025-07-20",
      "filmYear": "2000",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/6z/mc/fc/co/2FBMTpxVgsAQOFQRMDUkGRsfREC-0-600-0-900-crop.jpg?v=f05b133c0d",
      "reviewText": "Imagine being so entitled to think you could just take up residence on the other side of a Thai island inhabited by armed weed farmers without consequences. Anyway, I missed this when it came out and only recently realized it was a Boyle/Garland joint. And much like Sunshine and, to a lesser extent, 28 Days/Years Later, it starts off with a strong premise before going completely off the rails. Leo and Tilda had not quite reached their primes but still made this highly watchable, even if it’s kind of a mess. Everything held up pretty well except the internet cafe filled with iMacs with their default homepage set to Excite."
    },
    {
      "title": "Bring Her Back",
      "link": "https://letterboxd.com/peruvianidol/film/bring-her-back/",
      "watchedDate": "2025-07-19",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/3/7/6/2/7/1037627-bring-her-back-0-600-0-900-crop.jpg?v=defe1dae77",
      "reviewText": "Well that was deeply disturbing. I’ve seen some shit but this movie had me looking away at several points. Buncha fuckin’ sickos made this movie and I kinda loved it. Sally Hawkins is great, though I will never be able to watch her in anything else and not think of this movie. Sick fucks, I tell ya."
    },
    {
      "title": "M3GAN 2.0",
      "link": "https://letterboxd.com/peruvianidol/film/m3gan-20/",
      "watchedDate": "2025-07-16",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/6/5/8/8/5/965885-m3gan-20-0-600-0-900-crop.jpg?v=d2ea19cd5c",
      "reviewText": "I had a great time with this. Goes full T2 with hilarious results. I was straight up cackling at several points. Not sure how they’ll be able to one up this for the inevitable third movie."
    },
    {
      "title": "Only Lovers Left Alive",
      "link": "https://letterboxd.com/peruvianidol/film/only-lovers-left-alive/",
      "watchedDate": "2025-07-14",
      "filmYear": "2013",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/4/5/6/3/114563-only-lovers-left-alive-0-600-0-900-crop.jpg?v=d6151d5d18",
      "reviewText": "Loved this slow-burn, kinda punk rock vampire film. Exceptionally cool hanging out with Hiddleston and Swinton as an old vampire couple. Great supporting cast as well. Feels like a fresh take on the vampire genre, which is saying a lot in a year where Sinners came out. Haven’t seen a ton of Jarmusch’s films but what I have seen are usually a good hang and this is no exception."
    },
    {
      "title": "The Phoenician Scheme",
      "link": "https://letterboxd.com/peruvianidol/film/the-phoenician-scheme/",
      "watchedDate": "2025-07-14",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/2/5/0/4/7/1025047-the-phoenician-scheme-0-600-0-900-crop.jpg?v=606059b69f",
      "reviewText": "After Asteroid City I wasn’t sure I’d ever watch another Wes Anderson movie. His whole shtick of what I described in my review of that movie as “a bunch of (mostly) white famous people saying words in meticulously crafted shots” has worn pretty thin. But I found this to be pretty entertaining, largely thanks to the trio of actors in the lead roles, particularly Michael Cera, who steals every scene he’s in. There are several laugh out loud moments, even if the plot is completely nonsensical."
    },
    {
      "title": "Perfect Days",
      "link": "https://letterboxd.com/peruvianidol/film/perfect-days-2023/2/",
      "watchedDate": "2025-07-12",
      "filmYear": "2023",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/7/9/2/2/9/879229-perfect-days-0-600-0-900-crop.jpg?v=4ea80661fd",
      "reviewText": "More like Perfect Movie, amirite? I, too, just want to read books, listen to tapes and not worry about the rise of fascism while I clean a toilet for the hundredth time this week."
    },
    {
      "title": "The Batman",
      "link": "https://letterboxd.com/peruvianidol/film/the-batman/3/",
      "watchedDate": "2025-07-11",
      "filmYear": "2022",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/4/8/9/1/4/348914-the-batman-0-600-0-900-crop.jpg?v=ec12a8b7ce",
      "reviewText": "I was compelled to watch this after Superman. The Batman is the antithesis of modern superhero movies. I don’t know how they will incorporate Batman into Gunn’s new DCU but it almost certainly won’t be this Batman. Where Snyder seemingly took Superman into the dark, Gunn seems certain to bring Batman into the light. I miss when things could just be a thing and didn’t have to spawn endless sequels or crossover with every other IP owned by a megacorp. That said, I’m looking forward to The Batman 2. lol"
    },
    {
      "title": "Superman",
      "link": "https://letterboxd.com/peruvianidol/film/superman-2025/",
      "watchedDate": "2025-07-10",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/5/7/0/5/0/957050-superman-2025-0-600-0-900-crop.jpg?v=54e41a55ff",
      "reviewText": "I am admittedly not a DC comics guy. But Superman (1978) was one of the first movies I ever saw in the theater and it left a lasting impression on me. None of the Superman movies or shows since have come close to giving me that same sense of wonder. So my expectations going into James Gunn’s take were pretty low. And this is pretty much what I expected it to be. Lighter and more fun than the Snyder films, but overstuffed with characters and quips. There’s sooooo many characters here. From the room full of tech dweebs that work for Luthor to the staff of the Daily Planet, many of whom add little to the story outside of Lois (and Jimmy’s bizarre connection to Luthor). Corenswet strikes a great balance of earnestness and playfulness, and his chemistry with Brosnahan’s Lois worked well. But there was just so much other stuff going on. The nascent Justice League is shoehorned in to setup future DCU installments, only adding to the glut of characters. Not a bad movie by any stretch but it just felt like a missed opportunity to have a bigger take on what it means to be Superman in 2025, where having empathy is considered either “woke” or punk rock, depending on your perspective."
    },
    {
      "title": "Heads of State",
      "link": "https://letterboxd.com/peruvianidol/film/heads-of-state/",
      "watchedDate": "2025-07-09",
      "filmYear": "2025",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/7/0/9/6/2/670962-heads-of-state-0-600-0-900-crop.jpg?v=96d524e0ea",
      "reviewText": "Fun cast, terrible script. Some fun action scenes but, as Idris Elba says, “I prefer real cinema.”"
    },
    {
      "title": "I'm Still Here",
      "link": "https://letterboxd.com/peruvianidol/film/im-still-here-2024/",
      "watchedDate": "2025-07-07",
      "filmYear": "2024",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/0/1/6/7/1/901671-im-still-here-2024-0-600-0-900-crop.jpg?v=62be7ea503",
      "reviewText": "A remarkable film. As Americans we like to think something like this could never happen here, but it already is. This film serves as a necessary and dire warning. Brave performance from Fernanda Torres, whose character Eunice says to the press, “I think it’s necessary to compensate the families, and do the most important thing, clarify and judge all crimes committed during the dictatorship. If that doesn’t happen, they will continue to be committed with impunity.” Hoping I live to see this happen in the U.S."
    },
    {
      "title": "Lethal Weapon",
      "link": "https://letterboxd.com/peruvianidol/film/lethal-weapon/",
      "watchedDate": "2025-07-07",
      "filmYear": "1987",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/zv/vc/5m/ax/mF2bTqJuxbZPeEJRIMrA2WeQVxu-0-600-0-900-crop.jpg?v=9b73046ce8",
      "reviewText": "Not sure this 80s smash hit holds up very well. The action is ok but it’s really the chemistry between Glover (who was 10 years younger than I am now when he was “too old for this shit”) and Gibson that makes the movie. Gary Busey is woefully miscast as the lead henchman who dukes it out in a blurry mess of a hand-to-hand combat scene with Gibson in the climax. The plot is pretty incomprehensible, even by 80s standards. Some fun writing by Shane Black though not on the level of Kiss Kiss Bang Bang or The Nice Guys. Overall kind of a disappointing rewatch."
    },
    {
      "title": "I'm Gonna Git You Sucka",
      "link": "https://letterboxd.com/peruvianidol/film/im-gonna-git-you-sucka/",
      "watchedDate": "2025-07-06",
      "filmYear": "1988",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/1/2/6/6/41266-i-m-gonna-git-you-sucka-0-600-0-900-crop.jpg?v=e906d290bd",
      "reviewText": "I’m Gonna Git You Sucka holds a special place in my heart. My best friend Eldridge, who passed away last year, introduced me to it in high school. My friends and I must have watched it dozens of times. Even all these years later I can practically recite the whole thing. Plus it paved the way for In Living Color, in which many of the cast here would go on to star. This is a brilliant spoof of blaxploitation films in the same vein as Airplane and The Naked Gun, and arguably as funny or funnier than either of those movies. Shoutout to legendary costume designer Ruth E. Carter, whose incredible work here adds so much to the humor."
    },
    {
      "title": "Sneakers",
      "link": "https://letterboxd.com/peruvianidol/film/sneakers/",
      "watchedDate": "2025-07-05",
      "filmYear": "1992",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/3/3/1/50331-sneakers-0-600-0-900-crop.jpg?v=c14544e0f1",
      "reviewText": "In hindsight, Cosmo was right."
    },
    {
      "title": "Waves",
      "link": "https://letterboxd.com/peruvianidol/film/waves-2019/2/",
      "watchedDate": "2025-07-04",
      "filmYear": "2019",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/2/5/7/3/462573-waves-0-600-0-900-crop.jpg?v=5a8ec53acd",
      "reviewText": "This movie still hits hard on my third watch several years after its release. I connected with it on so many levels — as a parent, a son, a husband. This is essentially two movies, one about a brother and the other about his sister, divided by a twist of fate. The two halves feel very different but vital to each other. The color in this film is so vibrant. The performances are exquisite and vulnerable, particularly the two young leads. I really wish this were available in 4K. This might be one of my all-time top 10 films."
    },
    {
      "title": "Point Blank",
      "link": "https://letterboxd.com/peruvianidol/film/point-blank/",
      "watchedDate": "2025-07-03",
      "filmYear": "1967",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/5/5/9/2/35592-point-blank-0-600-0-900-crop.jpg?v=82ba2b6ea3",
      "reviewText": "This movie goes harder than it needed to for a pretty standard revenge flick. The pace is dizzying, so much happens in just 91 minutes, but it takes its time with some great shots along the way. Lee Marvin is a stoic badass. No doubt this influenced a ton of great modern crime films."
    },
    {
      "title": "F1",
      "link": "https://letterboxd.com/peruvianidol/film/f1/",
      "watchedDate": "2025-07-02",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/1/7/9/7/7/817977-f1-the-movie-0-600-0-900-crop.jpg?v=f5ae2b99b9",
      "reviewText": "F1 is like a summer blockbuster designed in a lab. Hits all the right notes, looks incredible, and delivers thrills, even if some of the beats are cliched and the character development is a bit shallow. Whatever this movie cost it is all on the screen. The racing scenes are plentiful and feel as immersive as the flying scenes in Kosinski’s Top Gun: Maverick. Pitt is great here, but the rest of the cast deserves credit for carving out distinct characters with very little screen time. By the end of the film you feel like part of the team, sharing the victory with them. Exhilarating."
    },
    {
      "title": "Running Scared",
      "link": "https://letterboxd.com/peruvianidol/film/running-scared/",
      "watchedDate": "2025-07-01",
      "filmYear": "1986",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/2/1/7/2/42172-running-scared-0-600-0-900-crop.jpg?v=1c703586d1",
      "reviewText": "Not a great movie but it made quite an impression on 11-year-old me, who loved Crystal from SNL. I respect a movie that makes great use of Chicago locations and there’s some good ones here, culminating in a shootout at the Thompson Center (recently bought by Google). There’s also a fun chase scene that takes lots of liberties with geography, going from O’Hare to Skokie and onto the L tracks downtown in a matter of minutes. I’d love to know the logistics of how they got two cars up there. If you can suspend your disbelief that a tap dancer and a comedian can pass for Chicago cops, there’s some fun to be had here."
    },
    {
      "title": "Cobra",
      "link": "https://letterboxd.com/peruvianidol/film/cobra-1986/",
      "watchedDate": "2025-07-01",
      "filmYear": "1986",
      "memberRating": "1.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/7/5/9/46759-cobra-0-600-0-900-crop.jpg?v=fbd949c36b",
      "reviewText": "Antonio Banderas laptop meme but it’s Sylvester Stallone after typing “you’re the disease and I’m the cure” in Cobra’s script."
    },
    {
      "title": "Jennifer's Body",
      "link": "https://letterboxd.com/peruvianidol/film/jennifers-body/",
      "watchedDate": "2025-07-01",
      "filmYear": "2009",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/9/3/0/5/39305-jennifer-s-body-0-600-0-900-crop.jpg?v=af7fb6bd86",
      "reviewText": "Felt like an angsty millennial teen wrote a David Lynch movie. Some fun moments and sharp dialogue but didn’t quite come together. Also will make me forever suspicious of any beautiful woman who pays me the slightest bit of attention."
    },
    {
      "title": "A Simple Plan",
      "link": "https://letterboxd.com/peruvianidol/film/a-simple-plan/",
      "watchedDate": "2025-06-25",
      "filmYear": "1998",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/4/2/8/46428-a-simple-plan-0-600-0-900-crop.jpg?v=ff2855b9bf",
      "reviewText": "Stylistically this is maybe Raimi's most subtle film, forgoing a lot of the dutch angles and wild shots he's known for in his horror and super hero films. Seems like an obvious riff on Fargo but is doing something a little different. There's a little Twilight Zone mixed in for good measure. The performances feel a little too heightened, particularly Bridget Fonda, who becomes increasingly unhinged and diabolical as the movie goes on. Great ensemble cast though. Loved Chelcie Ross as the sheriff and Gary Cole as the mysterious and slightly menacing FBI agent."
    },
    {
      "title": "Elio",
      "link": "https://letterboxd.com/peruvianidol/film/elio/",
      "watchedDate": "2025-06-22",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/1/5/7/5/921575-elio-0-600-0-900-crop.jpg?v=d3f4e92f5e",
      "reviewText": "Delightful to enjoy an original and heartwarming story with my kids rather than another rehash of something that was popular when I was a kid or some other shameless cash grab. My space-loving six-year-old especially loved it and the smile on his face was worth the price of admission alone. It’s a shame it did so poorly at the box office, reinforcing the idea that only existing IP is worth producing."
    },
    {
      "title": "Deadwood: The Movie",
      "link": "https://letterboxd.com/peruvianidol/film/deadwood-the-movie/1/",
      "watchedDate": "2025-06-22",
      "filmYear": "2019",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/xr/mo/gs/6t/fCQ13cqd02dop7Chkov0fPl4r3t-0-600-0-900-crop.jpg?v=51286c0adf",
      "reviewText": "First time watching this immediately after rewatching the HBO show, which unceremoniously ended after its third season. The lack of closure was really the only knock on this incredible series. This is less a movie than a proper send-off for nearly all the characters that last appeared 13 years earlier. And to boot we finally get to see the comeuppance of a cocksucking murderous land baron turned shitheel politician (in the parlance of the show), even if we may never see it play out in real life."
    },
    {
      "title": "Final Destination Bloodlines",
      "link": "https://letterboxd.com/peruvianidol/film/final-destination-bloodlines/",
      "watchedDate": "2025-06-19",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/2/6/2/2/502622-final-destination-bloodlines-0-600-0-900-crop.jpg?v=3c04d3a110",
      "reviewText": "The opening set piece of this movie is a sight to behold. Unfortunately the rest of the movie has a hard time living up to it. Some really inventive kills and clever misdirects with visual cues. And hilariously on-the-nose needle drops. Everything between the kills is just mind-numbingly dumb."
    },
    {
      "title": "28 Years Later",
      "link": "https://letterboxd.com/peruvianidol/film/28-years-later/",
      "watchedDate": "2025-06-19",
      "filmYear": "2025",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/9/2/7/8/6/992786-28-years-later-0-600-0-900-crop.jpg?v=fc48e61af3",
      "reviewText": "Woof. Even though two couples walked out of my screening I pressed on and was rewarded with a brief moment of transcendence, only for the ending to just completely ruin it. Here’s hoping 28 Decades Later gives us something better."
    },
    {
      "title": "Friendship",
      "link": "https://letterboxd.com/peruvianidol/film/friendship-2024/1/",
      "watchedDate": "2025-06-17",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/2/2/6/9/1/1122691-friendship-2024-0-600-0-900-crop.jpg?v=9ea74152f4",
      "reviewText": "Deeply unhinged. Love the way this movie is shot/graded. It almost feels like a horror movie. People are saying it’s actually nuts. It’s driving people crazy."
    },
    {
      "title": "Broadcast News",
      "link": "https://letterboxd.com/peruvianidol/film/broadcast-news/",
      "watchedDate": "2025-06-16",
      "filmYear": "1987",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/4/4/1/6/44416-broadcast-news-0-600-0-900-crop.jpg?v=d3dc914edb",
      "reviewText": "I appreciate the effort here but I just could not relate to any of the three main characters, who were all just such self-absorbed assholes. I also found the ending to be pretty unsatisfying. William Hurt’s character probably went on to work at Fox News. As someone who majored in print and broadcast journalism but ended up making websites for a living, this movie reaffirmed I made the right move."
    },
    {
      "title": "Ronin",
      "link": "https://letterboxd.com/peruvianidol/film/ronin/",
      "watchedDate": "2025-06-15",
      "filmYear": "1998",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/8/6/5/47865-ronin-0-600-0-900-crop.jpg?v=0470933060",
      "reviewText": "I remember being disappointed by this when it first came out but it’s definitely aged well, aside from the laughable technology. Several thrilling car chases that rival some of the best we’ve seen since. Feels like a throwback to 70s movies. And a bromance for the ages between DeNiro and Reno. I couldn’t tell you why I didn’t like it all those years ago but as a dad movie on Father’s Day it’s pure cinema."
    },
    {
      "title": "Deep Cover",
      "link": "https://letterboxd.com/peruvianidol/film/deep-cover-2025/",
      "watchedDate": "2025-06-13",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/2/2/5/3/6/1122536-deep-cover-2025-0-600-0-900-crop.jpg?v=1c21327945",
      "reviewText": "I don't think anyone involved in this movie has ever done or seen improv before."
    },
    {
      "title": "Shutter Island",
      "link": "https://letterboxd.com/peruvianidol/film/shutter-island/",
      "watchedDate": "2025-06-13",
      "filmYear": "2010",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/4/0/9/45409-shutter-island-0-600-0-900-crop.jpg?v=85dd4c38e3",
      "reviewText": "This movie is fucking wild. Even with a vague recollection of the ending when I saw this in the theater 15 years ago(!) it fucked me up all over again. Great production design and cinematography. Could have been a little shorter, but wow. Better than I remembered."
    },
    {
      "title": "Lone Star",
      "link": "https://letterboxd.com/peruvianidol/film/lone-star-1996/",
      "watchedDate": "2025-06-12",
      "filmYear": "1996",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/5/0/8/1/35081-lone-star-0-600-0-900-crop.jpg?v=e5290241ec",
      "reviewText": "Really interesting Western that starts like a murder mystery but unravels the complicated relationships in a small, Texas border town. Even though it's almost 30 years old it felt very modern, but like the setup for a TV series. Loved Chris Cooper and Elizabeth Peña (who I had a huge crush on as a kid). Young Matthew McConaughey has a few minutes of screen time as Cooper's dad in flashbacks, but his presence looms large over the whole film."
    },
    {
      "title": "Materialists",
      "link": "https://letterboxd.com/peruvianidol/film/materialists/",
      "watchedDate": "2025-06-12",
      "filmYear": "2025",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/2/4/5/6/2/1024562-materialists-0-600-0-900-crop.jpg?v=ae3470f333",
      "reviewText": "Thirty minutes into this, my wife leaned over to me and whispered, \"this movie is terrible.\" She wasn't entirely wrong. Dakota Johnson is so one-note, she comes across as terribly insincere in a job that requires a fair amount of empathy. But even in her romantic relationships, she gives off the same monotone vibe. Very Madame Web energy. Pedro is Pedro but largely wasted in a limited role. Chris Evans is fine but it's hard to sell him as a struggling actor. The movie also seems extremely cynical about marriage and relationships in general. A stark contrast with Past Lives, which had a lot more emotional weight than this follow-up from Celine Song."
    },
    {
      "title": "On the Waterfront",
      "link": "https://letterboxd.com/peruvianidol/film/on-the-waterfront/",
      "watchedDate": "2025-06-11",
      "filmYear": "1954",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/4/7/0/51470-on-the-waterfront-0-600-0-900-crop.jpg?v=ab41f427a0",
      "reviewText": "Not sure what to say about this other than it's a good-looking picture and Brando is kind of overrated."
    },
    {
      "title": "Drinking Buddies",
      "link": "https://letterboxd.com/peruvianidol/film/drinking-buddies/",
      "watchedDate": "2025-06-11",
      "filmYear": "2013",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/bb/e4/ko/lc/6OwVYT6zTvx8YVmkMYBVydNfHEV-0-600-0-900-crop.jpg?v=2c23c9384b",
      "reviewText": "Good hangs from the master of horny white millennial Chicago hipster mumblecore, Joe Swanberg. Love the cast and the sexual tension throughout gave me PTSD from my 20s. Feels like a prototype for Swanberg's show, Easy, which ran for three seasons and shared a lot of similar characters, locales and themes. I found the end to be pretty unsatisfying though."
    },
    {
      "title": "The 39 Steps",
      "link": "https://letterboxd.com/peruvianidol/film/the-39-steps/",
      "watchedDate": "2025-06-11",
      "filmYear": "1935",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/7/9/6/51796-the-39-steps-0-600-0-900-crop.jpg?v=1128460110",
      "reviewText": "A fun, tight (86 mins!) thriller. I was impressed with what Hitchcock was able to pull off considering this film is 90 years old, not that I've seen much from that era to compare it to. Surprisingly horny for what I assumed was a heavily censored era."
    },
    {
      "title": "25th Hour",
      "link": "https://letterboxd.com/peruvianidol/film/25th-hour/",
      "watchedDate": "2025-06-10",
      "filmYear": "2002",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/u7/my/x3/r6/tQb3wOKzo3XxFSY6ApO7OfLHGUM-0-600-0-900-crop.jpg?v=038db726da",
      "reviewText": "Spent the first 2/3s thinking \"this is not as good as I remember,\" but then that final sequence with Brian Cox just gutted me. It's so different watching this as a 27-year-old, roughly the same age as Monty, and then again at 50, closer to his dad's age. The early digital holds up better than Bamboozled, though the few night scenes are grainy as hell, but it works. Completely forgot PSH is in this and his uncomfortable attraction to young Anna Paquin. \"what are you trying to be, R Kelly?\" Way ahead of its time. Really captures America's post-9/11 love affair with NYC and even name drops Trump. How times have changed."
    },
    {
      "title": "The Surfer",
      "link": "https://letterboxd.com/peruvianidol/film/the-surfer-2024/",
      "watchedDate": "2025-06-10",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/1/6/9/9/0/1016990-the-surfer-2024-0-600-0-900-crop.jpg?v=9553d03257",
      "reviewText": "Really digging late-stage unhinged Cage. Perfectly cast here as a bougie white guy brought low by a tribe of surfers. Maybe the best privledge spiral since Dan Ackroyd in Trading Places. Love the saturated color palette and the dream-like quality of everything. Julian McMahon delivers a great balance of charm and menace. Loved him since Nip/Tuck and wish he was in more stuff. I didn't even recognize him in the trailer. Auzzies are a fun bunch."
    },
    {
      "title": "Evil Does Not Exist",
      "link": "https://letterboxd.com/peruvianidol/film/evil-does-not-exist/",
      "watchedDate": "2025-06-10",
      "filmYear": "2023",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/4/2/2/7/7/1042277-evil-does-not-exist-0-600-0-900-crop.jpg?v=a76547ed16",
      "reviewText": "Gorgeously shot but considerably more ponderous than Drive My Car. I was fully on board until the last act, which was a real head-scratcher. It turns out the real evil was the capitalism we made along the way."
    },
    {
      "title": "The Signal",
      "link": "https://letterboxd.com/peruvianidol/film/the-signal-2014/",
      "watchedDate": "2025-06-09",
      "filmYear": "2014",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/s4/a6/vg/n6/aop90vZ5MBQLd1amdBkpqqfZgtP-0-600-0-900-crop.jpg?v=a853c36f45",
      "reviewText": "Cool-looking movie on what I assume was a limited budget. Works more as a vibe than a coherent story. And what a waste of Olivia Cooke."
    },
    {
      "title": "The Amateur",
      "link": "https://letterboxd.com/peruvianidol/film/the-amateur-2025/",
      "watchedDate": "2025-06-09",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/0/9/1/4/980914-the-amateur-2025-0-600-0-900-crop.jpg?v=f9f2219f27",
      "reviewText": "A fairly competent thriller with a unique premise: what if Jason Bourne was a nerd? Let's be clear, I found it very easy to relate to Rami Malek's character. Sadly, all the best scenes are shown almost in their entirety in the trailer. Really great supporting cast but they're spread thin and some play redundant roles."
    },
    {
      "title": "A Working Man",
      "link": "https://letterboxd.com/peruvianidol/film/a-working-man/",
      "watchedDate": "2025-06-09",
      "filmYear": "2025",
      "memberRating": "1.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/8/2/2/2/5/1082225-a-working-man-0-600-0-900-crop.jpg?v=a265a96ac7",
      "reviewText": "A joyless, nonsensical slog. Besides that the movie is supposed to be set in Chicago but, aside from a few establishing shots, was clearly not shot anywhere near Illinois. If you want to enjoy this movie, take a drink anytime you see a giant-ass full moon on the horizon."
    },
    {
      "title": "Novocaine",
      "link": "https://letterboxd.com/peruvianidol/film/novocaine-2025/",
      "watchedDate": "2025-06-08",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/8/1/0/1/7/1081017-novocaine-2025-0-600-0-900-crop.jpg?v=bf4021de18",
      "reviewText": "When the title card came up I thought, \"please don't let this guy's name be Caine,\" before they immediately cut to his name plate, Nathan Caine. Oh, FFS. This turned out to be fun though. They really stretched the premise in clever and often gruesome ways. This is maybe the first thing I've seen Jack Quaid in where I didn't want to immediately punch him in the face."
    },
    {
      "title": "The Life of Chuck",
      "link": "https://letterboxd.com/peruvianidol/film/the-life-of-chuck/",
      "watchedDate": "2025-06-08",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/7/5/7/6/1/2/757612-the-life-of-chuck-0-600-0-900-crop.jpg?v=7ac670c0be",
      "reviewText": "The trailer really piqued my interest. Tom Hiddleston and Mike Flanagan? Sign me up! Ultimately it didn’t really resonate with me. There were some memorable scenes, but the structure of the movie was baffling and there was way less Hiddleston than I expected. Great to see Mia Sara again and Mark Hamill in full-on grandpa mode was great."
    },
    {
      "title": "The Accountant²",
      "link": "https://letterboxd.com/peruvianidol/film/the-accountant-2025/",
      "watchedDate": "2025-06-06",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/7/8/2/0/0/6/782006-the-accountant-2-0-600-0-900-crop.jpg?v=11a051d3db",
      "reviewText": "I found myself less interested in the central mystery of The Accountant 2 and more curious about what Ben Affleck’s Chris and his brother, John Bernthal’s Braxton, would get into next. Would Chris find love? Would Medina find a comfy chair? Would the Harbor kids release the Epstein files? Someone needs to show this movie to RFK Jr. Can someone please cast Bernthal in a remake/lega-sequel of Remo Williams already?"
    },
    {
      "title": "Predator: Killer of Killers",
      "link": "https://letterboxd.com/peruvianidol/film/predator-killer-of-killers/",
      "watchedDate": "2025-06-06",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/6/2/5/6/7/1262567-predator-killer-of-killers-0-600-0-900-crop.jpg?v=937d8a8ccf",
      "reviewText": "Another awesomely ambitious entry in the Predator franchise by Dan Trachtenberg. Love the art style and the creative assortment of Predator tech. The format of this reminds me of Sorcerer, where we see the backstories of the protagonists before they come together in the final act. My only beef with this movie is the low frame rate, which I found to be very distracting. I guess it’s cheaper to make an animated film when you only have to draw every other frame but it was extremely jarring! Even more stoked now for Predator: Badlands."
    },
    {
      "title": "Ballerina",
      "link": "https://letterboxd.com/peruvianidol/film/ballerina-2025/",
      "watchedDate": "2025-06-05",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/0/6/7/1/470671-ballerina-2025-0-600-0-900-crop.jpg?v=20977cf74a",
      "reviewText": "As much as the Wick series has gotten so up its own ass with its lore — the coins, the hotel, the bulletproof dinner jackets, the sheer assassin per capita of it all — they really have found new and more creative ways to stage action with each film. There’s way less unlimited ammo pistol shots point blank to the face. Ballerina doesn’t reach the heights of John Wick 4, but Ana de Armas acquits herself well in an extremely physically demanding role and the action scenes are wildly creative and varied. There’s one sequence near the end that had me absolutely giddy. I’ve never seen anything like it. It was worth the price of admission alone. But the whole movie is pretty well-paced, aside from all the lore drops and whatnot. There’s just enough reference to Wick himself without overshadowing Ana’s protagonist. A fun time at the movies, for sure."
    },
    {
      "title": "Marathon Man",
      "link": "https://letterboxd.com/peruvianidol/film/marathon-man/",
      "watchedDate": "2025-06-04",
      "filmYear": "1976",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/1/5/4/46154-marathon-man-0-600-0-900-crop.jpg?v=352ff0ffb7",
      "reviewText": "What was going on in the 70s? Lots of paranoid conspiracy thrillers. This one is pretty solid, even if it's hard to keep up with what the actual conspiracy is and who's on what side. Hoffman is great as a guy completely out of his element who gets caught up in the whole thing. The last act is kinda bonkers."
    },
    {
      "title": "MacGruber",
      "link": "https://letterboxd.com/peruvianidol/film/macgruber/",
      "watchedDate": "2025-06-03",
      "filmYear": "2010",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/6/5/8/9/26589-macgruber-0-600-0-900-crop.jpg?v=306108a1c7",
      "reviewText": "Not as riotously funny as I remembered but there's definitely enough hilarious moments that reward repeat viewing. Forte and Wiig are great and VAL KILMER. Great soundtrack for riding around in your Miata."
    },
    {
      "title": "Her",
      "link": "https://letterboxd.com/peruvianidol/film/her/2/",
      "watchedDate": "2025-06-03",
      "filmYear": "2013",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/au/nb/i6/lq/fsoTLnUXEUTNuVCBxAJMY0HPPd-0-600-0-900-crop.jpg?v=16789732be",
      "reviewText": "One of Joaquin's most hinged performances. Love his vulnerability. It's interesting rewatching this now that AI is close to the capabilities depicted here. The epidemic of loneliness that we find ourselves in, exasperated by a global pandemic, has led people to form relationships with chat bots. But in real life the AI is just repeating patterns. Watching this again with that in mind, are Samantha's feelings genuine, or is she merely repeating patterns? The idea makes the movie feel darker and less hopeful. I wonder how this movie will feel in another 12 years."
    },
    {
      "title": "Batman Begins",
      "link": "https://letterboxd.com/peruvianidol/film/batman-begins/",
      "watchedDate": "2025-06-03",
      "filmYear": "2005",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/7/8/4/51784-batman-begins-0-600-0-900-crop.jpg?v=f090edc352",
      "reviewText": "Looking back, Nolan's first foray into superhero movies is a little shaggy. So much happens in the first third, setting up a finale that doesn't quite pay off. The hand-to-hand combat is shot soooo close up and with so many edits that it's practically incomprehensible. Still, I love this version of Batman, and Bale has a great mix of physicality and humor. The supporting cast is filled with heavy hitters, and Katie Holmes. I can't believe this came out 20 years ago."
    },
    {
      "title": "Public Enemies",
      "link": "https://letterboxd.com/peruvianidol/film/public-enemies-2009/",
      "watchedDate": "2025-06-02",
      "filmYear": "2009",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/03/z6/f7/n6/zY7lvAF8yhUKwrrjMpJ023ggBrD-0-600-0-900-crop.jpg?v=7cc67e6729",
      "reviewText": "Only my second time watching this, the first since it was in the theater. I don't remember it leaving much of an impression on me and, watching it again, it still didn't. The movie looks great, shot entirely on digital, and unlike earlier digital films like Bamboozled, it still holds up. All of the performances are pretty one-note and there's not much drama. It feels like it's just checking off boxes of Dillinger's exploits. His relationship with Billie felt so underdeveloped that the ending just doesn't hit as hard as it should. Probably my least favorite Mann film, unfortunately."
    },
    {
      "title": "Captain America: Brave New World",
      "link": "https://letterboxd.com/peruvianidol/film/captain-america-brave-new-world/",
      "watchedDate": "2025-06-01",
      "filmYear": "2025",
      "memberRating": "1.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/7/3/8/2/9/2/738292-captain-america-brave-new-world-0-600-0-900-crop.jpg?v=97dff5b720",
      "reviewText": "The absolute nadir of the MCU. Completely incomprehensible and devoid of any character development. Some stuff happens in this movie but you never care because it's all boring CG and the same choreography you've seen in every Marvel movie. This entry has absolutely nothing to say, which is a shame because there's so much potential having a black Captain America in 2025. The best part was when the credits finally rolled and I could get on with my life."
    },
    {
      "title": "Michael Clayton",
      "link": "https://letterboxd.com/peruvianidol/film/michael-clayton/3/",
      "watchedDate": "2025-06-01",
      "filmYear": "2007",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/9/2/4/1/49241-michael-clayton-0-600-0-900-crop.jpg?v=6a1d790e35",
      "reviewText": "Watched this again with some first-timers and thankfully they agreed it's a masterpiece so we can remain friends."
    },
    {
      "title": "Apostle",
      "link": "https://letterboxd.com/peruvianidol/film/apostle-2018/1/",
      "watchedDate": "2025-05-31",
      "filmYear": "2018",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/5/7/6/6/8/357668-apostle-0-600-0-900-crop.jpg?v=5de87356f8",
      "reviewText": "Couldn't remember anything about this movie other than I loved it. Had to rewatch to cleanse the palate after Havoc. I'm still baffled how Evans followed up this solid thriller with that dud. The big takeaway is Dan Stevens should be in more stuff. It's a crime he's not more famous."
    },
    {
      "title": "Cutter's Way",
      "link": "https://letterboxd.com/peruvianidol/film/cutters-way/",
      "watchedDate": "2025-05-29",
      "filmYear": "1981",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/1/0/4/3/31043-cutter-s-way-0-600-0-900-crop.jpg?v=f8f478a733",
      "reviewText": "Checking out a Jeff Bridges deep cut I hadn't seen. What an odd movie. All the trappings of a neo-noir but at its center are three fucked up friends. John Heard chews up every scene as Alex Cutter, who's trying to help Bridges solve a murder he witnessed. Lisa Eichhorn gives a strong performance as Cutter's wife, Maureen. Bridges' character is named Richard Bone and he lives up to his name in this one, looking like an off-brand Robert Redford. Somehow at no point does anyone call him Dick. Not sure this fully clicked for me and the ending was very late 70s/early 80s. But I dug the three leads and their complicated relationship."
    },
    {
      "title": "Popstar: Never Stop Never Stopping",
      "link": "https://letterboxd.com/peruvianidol/film/popstar-never-stop-never-stopping/1/",
      "watchedDate": "2025-05-29",
      "filmYear": "2016",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/7/0/4/7/6/270476-popstar-never-stop-never-stopping-0-600-0-900-crop.jpg?v=c6e71d71e8",
      "reviewText": "Lonely Island is really good at short form stuff and, even at 86 minutes long, this is painfully drawn out. There are some truly funny moments but if it weren't for the crazy amount of celebrity cameos, this would be a real slog."
    },
    {
      "title": "Starman",
      "link": "https://letterboxd.com/peruvianidol/film/starman/1/",
      "watchedDate": "2025-05-27",
      "filmYear": "1984",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/9/3/9/46939-starman-0-600-0-900-crop.jpg?v=c0046f1463",
      "reviewText": "I loved this movie as a kid, though I probably couldn't tell you why. As an adult, the idea of experiencing grief over the loss of a loved one and then getting a second chance with them, in a sense, really hits different. I love Karen Allen's performance, and this might be my second favorite Jeff Bridges movie. I'd probably seen this a dozen times and only realized recently that it was a John Carpenter movie. What a run he had in the 80s. Just about every movie of his from that time is deeply embedded in my brain. This movie demands a lega-sequel."
    },
    {
      "title": "All the Right Moves",
      "link": "https://letterboxd.com/peruvianidol/film/all-the-right-moves/",
      "watchedDate": "2025-05-26",
      "filmYear": "1983",
      "memberRating": "1.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/7o/oy/3f/gh/kSrtxWweaqce1zuzF2rw7uYFwRB-0-600-0-900-crop.jpg?v=493f56225a",
      "reviewText": "Real 80s after school special vibes here. This movie did not age well if anyone ever enjoyed it to begin with. Wild to think the star of this would go on to become one of the world's biggest movie stars, the DP would one day direct Speed, and the coach would go on to, well, Coach. I would sooner believe that Tom Cruise could save the world from nuclear annihilation than I would believe he could get a full scholarship to college as a defensive back."
    },
    {
      "title": "Pee-wee as Himself",
      "link": "https://letterboxd.com/peruvianidol/film/pee-wee-as-himself-1/",
      "watchedDate": "2025-05-26",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/2/3/0/7/1/1323071-pee-wee-as-himself-1-0-600-0-900-crop.jpg?v=2fb6fc81e8",
      "reviewText": "Paul Reubens is so charming and dryly funny in this doc about his life. I was predisposed to loving this, as Pee-Wee was a big part of my childhood and likely had a big influence on my sense of humor. He's remarkably candid for someone who lived such a private life, even when the subject turns to his arrest and its devastating impact on his career. I'm happy that he got a second chance to share his gifts, and they truly were a gift, with the world. Paul passed away before the documentary was finished, and you get a sense that there's a tiny bit of his story that's unresolved. But what's there is touching and nostalgic and inspiring all at once and made me feel incredibly grateful that I was around at the height of Pee-Wee Herman and everything else Paul gave us after."
    },
    {
      "title": "The Hurt Locker",
      "link": "https://letterboxd.com/peruvianidol/film/the-hurt-locker/",
      "watchedDate": "2025-05-22",
      "filmYear": "2008",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/4/7/4/1/44741-the-hurt-locker-0-600-0-900-crop.jpg?v=ea165af0c3",
      "reviewText": "I probably watched this a half dozen times when it first came out. Just a solid, rewatchable war flick. Great direction by Bigelow who really has a knack for adrenaline junkies. Love Renner and Mackie in this. This got a lot of acclaim at the time but you don't hear it talked about much anymore."
    },
    {
      "title": "Mission: Impossible – The Final Reckoning",
      "link": "https://letterboxd.com/peruvianidol/film/mission-impossible-the-final-reckoning/",
      "watchedDate": "2025-05-22",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/3/4/0/3/503403-mission-impossible-the-final-reckoning-0-600-0-900-crop.jpg?v=00eae3744d",
      "reviewText": "I really loved Dead Reckoning so I was disappointed to find most of its conclusion to be contrived and overstuffed. A ton of exposition up front in case you've never seen a Mission Impossible movie, followed by a whole lot of mechanations to acquire the MacGuffin. That said, the third act is absolutely thrilling. The plane sequence is up there with some of the best set pieces in the franchise and, unlike the much publicized motorcycle jump from the last movie, they left plenty of footage for the theater and the stunt actually makes sense in the context of the movie. Overall a fairly satisfying conclusion and some fun additions to the supporting cast. Also one of the most clever (and subtle) IMAX aspect ratio transitions I've ever seen."
    },
    {
      "title": "A Few Good Men",
      "link": "https://letterboxd.com/peruvianidol/film/a-few-good-men/",
      "watchedDate": "2025-05-21",
      "filmYear": "1992",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/dw/l7/qy/bb/WgWLwk55YaXFZdlMnPJTKlxGcz-0-600-0-900-crop.jpg?v=60ddf4aa47",
      "reviewText": "A quaint throwback to a time when government officials could be held accountable for their actions. I haven't seen this since becoming aware of Aaron Sorkin but watching it again it makes perfect sense that he's responsible for the cracking dialogue in this. A Few Good Men is probably best known for Nicholson's explosive testimony but you gotta appreciate his seething disdain for Cruise's smug, young lawyer from their first scene together. And also Demi's hair, which is impeccable. I hope Cruise goes back to lawyer roles when he gets tired of risking his life for the sake of \"mass entertainment.\""
    },
    {
      "title": "Top Gun: Maverick",
      "link": "https://letterboxd.com/peruvianidol/film/top-gun-maverick/2/",
      "watchedDate": "2025-05-21",
      "filmYear": "2022",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/9/3/4/6/5/293465-top-gun-maverick-0-600-0-900-crop.jpg?v=9f8af0f61b",
      "reviewText": "Ok, yeah. This is an absolute banger."
    },
    {
      "title": "The Taking of Pelham One Two Three",
      "link": "https://letterboxd.com/peruvianidol/film/the-taking-of-pelham-one-two-three/",
      "watchedDate": "2025-05-21",
      "filmYear": "1974",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/8/0/0/47800-the-taking-of-pelham-one-two-three-0-600-0-900-crop.jpg?v=b04395e6e7",
      "reviewText": "This is a fun crime thriller, basically Die Hard on a subway train. Just about the entire cast is a wise-cracking, ball-busting New Yorker. Matthau is great and the last shot is *chef's kiss*."
    },
    {
      "title": "You Were Never Really Here",
      "link": "https://letterboxd.com/peruvianidol/film/you-were-never-really-here/2/",
      "watchedDate": "2025-05-20",
      "filmYear": "2017",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/3/2/4/3/7/332437-you-were-never-really-here-0-600-0-900-crop.jpg?v=56e5177879",
      "reviewText": "I've watched this three times now and I find it to be kind of inscrutable. For a 90 minute film it spends a lot of time luxuriating on moments. There's a lot of implied violence and a lot of actual violence. There's very little dialogue. There are several scenes and shots that still haunt me. Also his mother's house was shot in my uncle's house in Brooklyn, which is still wild to think about."
    },
    {
      "title": "Mission: Impossible – Dead Reckoning",
      "link": "https://letterboxd.com/peruvianidol/film/mission-impossible-dead-reckoning/2/",
      "watchedDate": "2025-05-19",
      "filmYear": "2023",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/3/4/0/2/503402-mission-impossible-dead-reckoning-part-one-0-600-0-900-crop.jpg?v=34b8b35ec9",
      "reviewText": "Third watch got me hyped for the conclusion. I love this series and even though Cruise is getting long in the tooth I hope they can find a way to keep it going. The score in this one absolutely slaps. Trying to temper my expectations for Final Reckoning in three days!"
    },
    {
      "title": "Moonlight",
      "link": "https://letterboxd.com/peruvianidol/film/moonlight-2016/1/",
      "watchedDate": "2025-05-19",
      "filmYear": "2016",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/90/gn/c7/9k/qAwFbszz0kRyTuXmMeKQZCX3Q2O-0-600-0-900-crop.jpg?v=192bde15c6",
      "reviewText": "This movie is just stunning. Watching it for the first time since it was released and I fell in love with it all over again. Just an amazing job by the actors that play Chiron and Kevin at different ages building on the performances that came before. When Black reunites with Kevin in the third act you can see his facade crumble become Little again. Ahhhh and the score is incredible."
    },
    {
      "title": "Wick Is Pain",
      "link": "https://letterboxd.com/peruvianidol/film/wick-is-pain/",
      "watchedDate": "2025-05-17",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/4/9/8/0/7/1349807-wick-is-pain-0-600-0-900-crop.jpg?v=0e66b7bef7",
      "reviewText": "Overly long and self-indulgent, this doc spends a lot of time on the challenges of getting the first John Wick made. (It’s honestly a miracle any movie gets made.) it kind of glosses over the sequels. There was some interesting details about the productions and the relationships between the directors and Keanu, but like the week they spent shooting Keanu moping around the house in the first Wick, it felt like a little too much."
    },
    {
      "title": "Rogue One: A Star Wars Story",
      "link": "https://letterboxd.com/peruvianidol/film/rogue-one-a-star-wars-story/2/",
      "watchedDate": "2025-05-16",
      "filmYear": "2016",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/2/5/8/1/2/8/258128-rogue-one-a-star-wars-story-0-600-0-900-crop.jpg?v=eff30d0282",
      "reviewText": "Had to revisit this after wrapping up Andor S2, which I found to be a bit uneven but did a great job of setting the stage for Rogue One. Now, having seen all of Andor, there’s much more context and emotion behind the sacrifices made by the rebels to get the Death Star plans that leads to the opening of Episode IV. The effects here largely hold up, except for the CG humans, which didn’t look that great when this came out, and look even worse now. This remains one of the best Star Wars entries — a thrilling heist movie with a great cast. Hoping we get to see a Donnie Yen prequel series someday. It tickles me to think that Americans who only know Yen from this and John Wick 4 may think he’s actually blind. It also baffles me to think there are conservatives who watch Star Wars and somehow think they are like the rebels. Andor and Rogue One have become increasingly relevant as America and other parts of the world descend into fascism."
    },
    {
      "title": "Friendship",
      "link": "https://letterboxd.com/peruvianidol/film/friendship-2024/",
      "watchedDate": "2025-05-12",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/2/2/6/9/1/1122691-friendship-2024-0-600-0-900-crop.jpg?v=9ea74152f4",
      "reviewText": "Not sure I could recommend this to just anyone, but I was right at home at a sold out early screening among a bunch of fellow I Think You Should Leave enthusiasts. Tim Robinson brings the same manic energy to this with hilarious results. Paul Rudd is perfectly cast as Tim’s new neighbor and would be friend. It’s not a home run but it could become a cult comedy that’s quoted often."
    },
    {
      "title": "Last Bullet",
      "link": "https://letterboxd.com/peruvianidol/film/last-bullet/",
      "watchedDate": "2025-05-10",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/4/2/6/5/5/1042655-last-bullet-0-600-0-900-crop.jpg?v=8845e501bb",
      "reviewText": "Nicely ties up the trilogy with a little backstory on the first two movies followed by nearly non-stop vehicular and hand-to-hand mayhem, with another A-Team welding montage thrown in for good measure. Another well-executed fun time."
    },
    {
      "title": "Lost Bullet 2",
      "link": "https://letterboxd.com/peruvianidol/film/lost-bullet-2/",
      "watchedDate": "2025-05-08",
      "filmYear": "2022",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/5/2/8/6/6/852866-lost-bullet-2-0-600-0-900-crop.jpg?v=791889869b",
      "reviewText": "Weirdly retcons the last five minutes of the first movie and then proceeds to up the ante in every possible way. The hero inexplicably becomes a cop and the car he drove in the first film gets a major upgrade that elicited such a series of noises from me at one point that I thought for sure I was going to wake the kids. The end is fairly abrupt and ends like the season finale of a TV show that’s confident it’s going to be picked up for another season. It doesn’t feel like a complete movie, but what’s there is fun and breezy and competently made."
    },
    {
      "title": "Lost Bullet",
      "link": "https://letterboxd.com/peruvianidol/film/lost-bullet/",
      "watchedDate": "2025-05-07",
      "filmYear": "2020",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/2/9/9/3/4/629934-lost-bullet-0-600-0-900-crop.jpg?v=95be815c8c",
      "reviewText": "I’m a sucker for a good A-Team welding montage, so when the one in Lost Bullet pays off I was practically giddy. Not a great movie but the director knows what he’s going for and executes it well and there’s not a ton of fat in this 93 minute movie. Definitely has me interested in checking out the sequels."
    },
    {
      "title": "Warfare",
      "link": "https://letterboxd.com/peruvianidol/film/warfare/",
      "watchedDate": "2025-05-06",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/2/4/7/0/1/1124701-warfare-0-600-0-900-crop.jpg?v=f379233a1b",
      "reviewText": "Felt like if Black Hawk Down was a bottle episode. Small in scale and scope but effectively tense throughout. I can imagine, like Black Hawk Down, we might look back at some of the actors here ten years from now after they’ve become wildly famous and marvel at how they were all in this movie."
    },
    {
      "title": "The Insider",
      "link": "https://letterboxd.com/peruvianidol/film/the-insider/",
      "watchedDate": "2025-05-06",
      "filmYear": "1999",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/l7/vs/7t/qj/sYQsmMl4oG56NtFaNkDxuJhhODa-0-600-0-900-crop.jpg?v=2ee2c41378",
      "reviewText": "Revisiting this for the first time since the theater. Mann infuses the story with the tension and stakes of a crime thriller. Pacino and Crowe both give great, restrained performances. There’s a ton of great character actors in this, but Christopher Plummer really nails it as Mike Wallace. Could have been a little tighter but the performances kept me in it to the end."
    },
    {
      "title": "Galaxy Quest",
      "link": "https://letterboxd.com/peruvianidol/film/galaxy-quest/",
      "watchedDate": "2025-05-04",
      "filmYear": "1999",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/2/2/7/51227-galaxy-quest-0-600-0-900-crop.jpg?v=77947eabcc",
      "reviewText": "It’s May the 4th so of course I had to watch Galaxy Quest for the first time since I saw it in the theater. I honestly didn’t remember anything about it besides the premise. I love Star Trek and I get what they were going for here but it didn’t quite work for me. Tim Allen is woefully miscast and Alan Rickman probably didn’t have to stretch too far to play a Shakespearean actor playing a role that’s beneath him. I loved Sam Rockwell’s manic energy and whatever the hell Enrico Colantoni is doing."
    },
    {
      "title": "Deadpool & Wolverine",
      "link": "https://letterboxd.com/peruvianidol/film/deadpool-wolverine/",
      "watchedDate": "2025-05-03",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/2/8/7/0/462870-deadpool-wolverine-0-600-0-900-crop.jpg?v=1aa778d2c6",
      "reviewText": "Enjoyed the cameos in this and Hugh Jackman is fun but Ryan Reynolds is so damn irritating (I guess he's perfectly cast then) and the dick joke per minute is off the charts. It's a shame much of the humor is so tedious because there's some fun action here."
    },
    {
      "title": "Thunderbolts*",
      "link": "https://letterboxd.com/peruvianidol/film/thunderbolts/",
      "watchedDate": "2025-05-02",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/8/7/6/5/3/887653-thunderbolts-0-600-0-900-crop.jpg?v=80380bc773",
      "reviewText": "My expectations were low going in, given that Marvel's post-End Game offerings have been mostly meh. But good on Marvel for making an effort to give at least a few of the characters in Thunderbolts some depth. The backstories of the team members are left to the die hards who suffered through a half dozen mediocre TV shows and spinoff movies. There's some fun action and dialogue. The reveal of the villain and the resolution of their arc (and the movie itself) happens extremely late and way too quickly. I don't know if I'm on board with the implications of the movie's ending. Thunderbolts may have had an easier time at the box office if they just called it what it is."
    },
    {
      "title": "Tombstone",
      "link": "https://letterboxd.com/peruvianidol/film/tombstone/1/",
      "watchedDate": "2025-04-28",
      "filmYear": "1993",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/4/8/3/9/44839-tombstone-0-600-0-900-crop.jpg?v=7242ef82fa",
      "reviewText": "Only Val Kilmer could make tuberculosis look cool."
    },
    {
      "title": "Havoc",
      "link": "https://letterboxd.com/peruvianidol/film/havoc-2025/",
      "watchedDate": "2025-04-26",
      "filmYear": "2025",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/9/3/2/8/0/593280-havoc-1-0-600-0-900-crop.jpg?v=c38106ed32",
      "reviewText": "On paper, a movie by the director of The Raid starring Tom Hardy sounds great but, sadly, the execution is lacking here. Outside of a couple fun set pieces, this is a pretty nondescript crime movie. Even the setting is some unknown, presumably American (based on the sheer number of guns) city, which looks like a combination of back lot sets and something made in Unreal Engine. This movie also has Timothy Olyphant, Forest Whitaker and Luis Guzman but pretty much squanders them. I really dug Apostle and Gangs of London, so I’m not sure what happened here but it’s not good."
    },
    {
      "title": "My Old Ass",
      "link": "https://letterboxd.com/peruvianidol/film/my-old-ass/1/",
      "watchedDate": "2025-04-26",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/5/2/5/3/1/852531-my-old-ass-0-600-0-900-crop.jpg?v=2b684502b7",
      "reviewText": "Man, the hug just guts me every time."
    },
    {
      "title": "Ash",
      "link": "https://letterboxd.com/peruvianidol/film/ash-2025/",
      "watchedDate": "2025-04-25",
      "filmYear": "2025",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/3/6/2/1/3/836213-ash-2025-0-600-0-900-crop.jpg?v=39e3f3c32c",
      "reviewText": "Visually interesting but kind of a slog to get through. Goes to great lengths to set up a mystery that, when it’s finally revealed, is like, “oh, okay.”"
    },
    {
      "title": "Sinners",
      "link": "https://letterboxd.com/peruvianidol/film/sinners-2025/",
      "watchedDate": "2025-04-21",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/1/6/6/0/0/1116600-sinners-2025-0-600-0-900-crop.jpg?v=00ce32e0ba",
      "reviewText": "Watched on Monday April 21, 2025."
    },
    {
      "title": "Jack Reacher: Never Go Back",
      "link": "https://letterboxd.com/peruvianidol/film/jack-reacher-never-go-back/",
      "watchedDate": "2025-04-20",
      "filmYear": "2016",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/54/yn/th/hy/IfB9hy4JH1eH6HEfIgIGORXi5h-0-600-0-900-crop.jpg?v=7f9cc822e8",
      "reviewText": "Wow, I heard this was bad and put it off this long. Cruise is really slumming it here in what looks like a made for TV movie. There’s entire seasons of Amazon’s Reacher that are better than this. The fight scenes are pretty poorly shot and choreographed, especially in a post-John Wick world. And if Cruise did his own stunts, you wouldn’t know it. But Cruise is still Cruise and never fails to win me over, even in dreck like this. Plus I’ve had a crush on Cobie Smulders since her How I Met Your Mother days. Overall, pretty inoffensive but doesn’t reach the highs of the first film and it’s hard not to think of Alan Ritchson as Reacher now."
    },
    {
      "title": "Blue Velvet",
      "link": "https://letterboxd.com/peruvianidol/film/blue-velvet/1/",
      "watchedDate": "2025-04-19",
      "filmYear": "1986",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/3/5/9/51359-blue-velvet-0-600-0-900-crop.jpg?v=b0ee3c20f6",
      "reviewText": "Hoo! They don’t make ‘em like this anymore!"
    },
    {
      "title": "The Lighthouse",
      "link": "https://letterboxd.com/peruvianidol/film/the-lighthouse-2019/2/",
      "watchedDate": "2025-04-08",
      "filmYear": "2019",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/3/3/8/6/3/433863-the-lighthouse-0-600-0-900-crop.jpg?v=ee97005537",
      "reviewText": "Having seen Eggers’ last two movies since this was released, The Lighthouse has lost a little bit of its luster. Still a great two-hander with brilliant performances by Dafoe and Pattinson, but it drags on a bit at times. The 4K release doesn’t do it any favors either, since much of the film is shot in low light with shallow depth of field. Man, that ending though."
    },
    {
      "title": "A Minecraft Movie",
      "link": "https://letterboxd.com/peruvianidol/film/a-minecraft-movie/",
      "watchedDate": "2025-04-05",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/5/4/6/9/1/854691-a-minecraft-movie-0-600-0-900-crop.jpg?v=074e7fed9e",
      "reviewText": "Video game movies are tricky because you have a checklist of things from the game you have to squeeze in references to for the fans but you also have to find a a way to make it fun for the uninitiated. Jared Hess may be the perfect director to deliver seemingly non sequiturs in a fun way. There’s definitely some Napoleon Dynamite DNA here. Jack Black is in full Jack Black mode and shares a Point Break-esque homoerotic bond with a similarly over-the-top Jason Momoa. This checked all the boxes for my Minecraft-loving 6-year-old but also had me cracking up a lot more than I thought I would."
    },
    {
      "title": "Unforgiven",
      "link": "https://letterboxd.com/peruvianidol/film/unforgiven/",
      "watchedDate": "2025-04-05",
      "filmYear": "1992",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/jm/nq/0c/ke/9oPodyvCWyPMZJDjg29tBfFRwtG-0-600-0-900-crop.jpg?v=9afed9f6aa",
      "reviewText": "Most of this movie is fine but the last 20 minutes or so are incredible. So many great lines and seeing Eastwood become the legend that was alluded to for most of the movie is sublime. Hackman really shines here as the villainous sheriff who talks a good game but turns out to be about as good a sheriff as he is a carpenter."
    },
    {
      "title": "Black Bag",
      "link": "https://letterboxd.com/peruvianidol/film/black-bag-2025/1/",
      "watchedDate": "2025-04-02",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/1/6/7/5/5/1116755-black-bag-2025-0-600-0-900-crop.jpg?v=7dbc1baf6f",
      "reviewText": "On second watch I picked up a lot of clues I missed the first time around. This movie is a brisk 94 minutes and doesn’t waste much time. All of the spycraft stuff is just set dressing and an excuse to watch a bunch of smart, sexy people in beautifully-lit environments verbally spar with each other. More movies like this, please!"
    },
    {
      "title": "Ripley",
      "link": "https://letterboxd.com/peruvianidol/film/ripley/",
      "watchedDate": "2025-04-02",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/4/1/3/2/0/1141320-ripley-0-600-0-900-crop.jpg?v=6992c33fc4",
      "reviewText": "I finally got around to finishing this sublime adaptation of Patricia Highsmith’s The Talented Mr. Ripley. Robert Elswit’s cinematography is stunning. Picturesque Italy is captured in gorgeous black-and-white and nearly every shot could be a painting. I loved Andrew Scott as Ripley, a much more calculating take than Matt Damon’s version. And Mauricio Lombardi is delightful as Inspector Ravini, who always seems to be both a step ahead and a step behind Ripley at every moment. The pacing may seem slow as the series likes to luxuriate in every detail, but I loved every minute of it."
    },
    {
      "title": "Subservience",
      "link": "https://letterboxd.com/peruvianidol/film/subservience-2024/",
      "watchedDate": "2025-03-30",
      "filmYear": "2024",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/5/9/6/7/2/959672-subservience-0-600-0-900-crop.jpg?v=16ae748259",
      "reviewText": "This movie features more broken glass than Die Hard. If there’s a lesson to be learned from movies like this and Companion it’s stop having sex with your robots."
    },
    {
      "title": "Under Suspicion",
      "link": "https://letterboxd.com/peruvianidol/film/under-suspicion-2000/",
      "watchedDate": "2025-03-29",
      "filmYear": "2000",
      "memberRating": "1.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/1/1/0/46110-under-suspicion-0-600-0-900-crop.jpg?v=4d8d9e7fb1",
      "reviewText": "This movie is so incredibly awful that even two of the greatest actors of our time couldn’t elevate it. How Hackman and Freeman read this script and agreed to do this movie I’ll never know. The whole thing builds up to some noir-like twist and then it just ends with a whimper. I’d expect something at least a bit more entertaining from the director of Predator 2 and the writer of Point Break. The production looks like a bad network TV procedural, complete with overlays of the cast’s photos over the opening credits. If I had to guess I’d say that Jeffrey Epstein wrote this, or at least someone who had been to his island. Yeesh."
    },
    {
      "title": "Michael Clayton",
      "link": "https://letterboxd.com/peruvianidol/film/michael-clayton/2/",
      "watchedDate": "2025-03-28",
      "filmYear": "2007",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/9/2/4/1/49241-michael-clayton-0-600-0-900-crop.jpg?v=6a1d790e35",
      "reviewText": "I am Shiva, the god of death."
    },
    {
      "title": "1917",
      "link": "https://letterboxd.com/peruvianidol/film/1917/1/",
      "watchedDate": "2025-03-27",
      "filmYear": "2019",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/0/1/5/5/460155-1917-0-600-0-900-crop.jpg?v=9eb1d95df5",
      "reviewText": "The oner is like a high-wire act. Difficult to pull off but leaves its audience breathless when it’s pulled off successfully. It’s been popular in recent series like Adolescence and The Studio, and while 1917 uses some trickery to achieve the illusion of one, long continuous shot, its sheer ambition tops any oners in recent memory. The logistics that must have gone into this to make it work are mind-boggling. The film is gorgeously shot by Roger Deakins and George MacKay gives an impressive and physically challenging performance."
    },
    {
      "title": "Sicario",
      "link": "https://letterboxd.com/peruvianidol/film/sicario-2015/5/",
      "watchedDate": "2025-03-27",
      "filmYear": "2015",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/9/7/6/2/8/197628-sicario-0-600-0-900-crop.jpg?v=06d4163bb2",
      "reviewText": "This popped up on Netflix and my immediate reaction was “I guess I’m watching Sicario again!” God, this movie is incredible. Just a perfect storm of directing, acting, writing, cinematography, scoring. There’s very little downtime in its 2+ hour runtime. Del Toro is especially restrained and badass here. And a great, vulnerable performance by Emily Blunt."
    },
    {
      "title": "Riff Raff",
      "link": "https://letterboxd.com/peruvianidol/film/riff-raff-2024/",
      "watchedDate": "2025-03-26",
      "filmYear": "2024",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/1/6/1/9/7/1016197-riff-raff-2024-0-600-0-900-crop.jpg?v=c94f7c668a",
      "reviewText": "Squanders a fun cast with a dumb script, unfortunately. I enjoyed the scenes with Bill Murray and Pete Davidson but they were few and far between. The entire last half hour is completely nonsensical. Billed as a comedy but the entire movie barely elicited a single chuckle."
    },
    {
      "title": "Drive My Car",
      "link": "https://letterboxd.com/peruvianidol/film/drive-my-car/1/",
      "watchedDate": "2025-03-25",
      "filmYear": "2021",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/7/9/2/9/1/679291-drive-my-car-0-600-0-900-crop.jpg?v=9e1f7c9f35",
      "reviewText": "Re-watching this it hit even harder this time. There’s been a recent batch of films like Ghostlight and Sing Sing where the characters are performing a play that connects to their life experiences and this may be my favorite of them all. The line between the characters in the film and the characters they are portraying in the play is often blurred, especially in that powerful ending. A beautiful film."
    },
    {
      "title": "Dark Angel",
      "link": "https://letterboxd.com/peruvianidol/film/dark-angel/",
      "watchedDate": "2025-03-24",
      "filmYear": "1990",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/9/6/6/3/39663-dark-angel-0-600-0-900-crop.jpg?v=c0936cf9bd",
      "reviewText": "For the longest time I thought I hallucinated this movie. They tried to gaslight me into thinking this movie wasn’t called I Come in Peace when it was released in US theaters in 1990. I distinctly remember the ad where the alien villain says the name of the movie, “I come in peace,” to which Lundgren replies, “and you go in pieces” before blowing his ass up with his own space gun. But here it is, in glorious 4K all these years later and BOY, is this movie dumb. I love the subgenre of alien bad guy who has to be thwarted by a cop that doesn’t play by the rules (Predator 2, The Hidden). Bonus points if they team up with an alien cop (played here inexplicably by ESPN’s Jay Bilas, of all people). But this movie is just not good. I gave it two and a half stars out of pure nostalgia and because the human bad guys are a bunch of preppy white boys called, well, the White Boys, which seems pretty appropriate given the current state of affairs. Somehow Brian Benben went on to star in HBO’s Dream On, married Madeline Stowe and then basically fucked right off the planet Earth as far as I know but good for him!"
    },
    {
      "title": "Predator 2",
      "link": "https://letterboxd.com/peruvianidol/film/predator-2/",
      "watchedDate": "2025-03-23",
      "filmYear": "1990",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/zr/v7/bi/bd/zvliTkCns7f37iUeedDdo7rFyYH-0-600-0-900-crop.jpg?v=06158f2080",
      "reviewText": "Not nearly as good as the original but the sequel is delightfully cheesy and does a great job of adding to the mythology of the franchise. Glover is no Schwarzenegger but does an admirable job despite some pretty corny writing. I'd probably seen this a dozen times in high school and completely forgot Bill Paxton is in it. Also peak Gary Busey."
    },
    {
      "title": "The Gorge",
      "link": "https://letterboxd.com/peruvianidol/film/the-gorge-2025/",
      "watchedDate": "2025-03-22",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/5/4/6/8/7/854687-the-gorge-2025-0-600-0-900-crop.jpg?v=fca29e60dd",
      "reviewText": "Wow, people really didn't dig this? I thought it was a nice change of pace from the usual IP-driven bullshit we're constantly subjected to these days. A fun meet cute with two hot actors, some good needle drops, a Reznor/Ross score, Sigourney Fucking Weaver? It almost didn't even need the sci-fi/action elements, which were merely ok. But I ate up all the stuff between Teller and Taylor-Joy."
    },
    {
      "title": "Decision to Leave",
      "link": "https://letterboxd.com/peruvianidol/film/decision-to-leave/1/",
      "watchedDate": "2025-03-22",
      "filmYear": "2022",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/2/9/3/2/0/629320-decision-to-leave-0-600-0-900-crop.jpg?v=30eaeaf481",
      "reviewText": "On second watch I found this to be a lot funnier but also a lot slower than the first time around. Still a fantastic movie with excellent cinematography and editing. The ending is such a gut punch. Looking back, my review for The Handmaiden applies to Decision to Leave word for word. 😂"
    },
    {
      "title": "Days of Heaven",
      "link": "https://letterboxd.com/peruvianidol/film/days-of-heaven/",
      "watchedDate": "2025-03-19",
      "filmYear": "1978",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/x3/jx/v5/l2/rwxTYjOZmX2rGhz7avLe1qsjNqe-0-600-0-900-crop.jpg?v=5fe1a56460",
      "reviewText": "I'm not sure this totally clicked for me (like a lot of Malick's work) but hot damn is it a gorgeous movie (like a lot of Malick's work). I didn't know what to make of it until reading Ebert's review, where he suggested that Linda, the little sister, is the main character and that's why the passion of the love triangle feels muted. That interpretation makes me want to revisit this again someday with that in mind. A good movie to watch if you feel like your job sucks. At least you don't have to deal with locusts."
    },
    {
      "title": "Adolescence",
      "link": "https://letterboxd.com/peruvianidol/film/adolescence-2025/",
      "watchedDate": "2025-03-18",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/2/6/8/2/8/1326828-adolescence-2025-0-600-0-900-crop.jpg?v=dde7c2d9f0",
      "reviewText": "As a parent, this series wrecked me. It feels extremely relevant and timely in it's depiction of online bullying and toxic masculinity. I'm not sure each episode needed to be shot in one take but it's done masterfully here. If there are any sneaky edits they're extremely hard time spot, which makes the performances, particularly Stephen Graham and Owen Cooper's, that much more mesmerizing. At Second City they teach you \"today is the day,\" that every good story is the day something happens that changes its characters. Every episode of this series takes that to heart, even if it's not immediately obvious why we're seeing that day. Truly one of the must watch series of the year."
    },
    {
      "title": "Runaway Jury",
      "link": "https://letterboxd.com/peruvianidol/film/runaway-jury/",
      "watchedDate": "2025-03-16",
      "filmYear": "2003",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/4/0/5/45405-runaway-jury-0-600-0-900-crop.jpg?v=118d3396b2",
      "reviewText": "Hackman and an all-star lineup of character actors elevate this idealistic courtroom drama that centers on gun control. With 20+ years of gun deaths since this was released, the whole thing seems wildly improbable now. But damn, Hackman is really great in this, even if no one else, including Dustin Hoffman, rises to his level."
    },
    {
      "title": "Parasite",
      "link": "https://letterboxd.com/peruvianidol/film/parasite-2019/2/",
      "watchedDate": "2025-03-15",
      "filmYear": "2019",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/2/6/4/0/6/426406-parasite-0-600-0-900-crop.jpg?v=8f5653f710",
      "reviewText": "Bong's American films have a distinct lack of subtlety compared to his South Korean ones. Watching this again after Mickey 17 it really struck me. This movie is transcendent. It's easy to see why it remains one of, if not THE best Best Picture Oscar winners of the last decade or more. On this third watch I couldn't help think of The Prestige. Parasite is like a magic trick, with three distinct parts, and concludes with a real Transported Man. The ending is *chef's kiss*."
    },
    {
      "title": "Black Bag",
      "link": "https://letterboxd.com/peruvianidol/film/black-bag-2025/",
      "watchedDate": "2025-03-14",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/1/6/7/5/5/1116755-black-bag-2025-0-600-0-900-crop.jpg?v=b6b9dffb20",
      "reviewText": "Went into this expecting more of a spy movie and what I got instead was a delightful whodunnit where all the characters are smart and lie for a living. Soderbergh brings his A-game and his signature low-key horny vibes. Fassbender and Blanchett do a great job of keeping their cards close to their vest. This movie was kind of inscrutable until the climactic reveal at which point everything clicked. Definitely interested in giving this a rewatch."
    },
    {
      "title": "Presence",
      "link": "https://letterboxd.com/peruvianidol/film/presence-2024/",
      "watchedDate": "2025-03-13",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/2/7/9/3/7/1027937-presence-2024-0-600-0-900-crop.jpg?v=e47f97445a",
      "reviewText": "Fuckin' zoomers, man. I didn't see a joint until I was in college and these kids are on some Fear and Loathing shit. Anyway, I spent most of this movie mad because my 100-year-old house isn't anywhere near as nice as the one in this movie. An interesting concept, but one that is better realized in A Ghost Story, which I also didn't love but featured Rooney Mara eating a whole pie in one take. Nothing as daring on display here and a little too much exposition. But it was good to see Cleary from The Knick as a suburban dad."
    },
    {
      "title": "Companion",
      "link": "https://letterboxd.com/peruvianidol/film/companion-2025/",
      "watchedDate": "2025-03-12",
      "filmYear": "2025",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/7/7/1/7/2/977172-companion-2025-0-600-0-900-crop.jpg?v=66c5c946ec",
      "reviewText": "I liked this movie better the first time I saw it, when it was called REVENGE. Seriously though, I had an okay time with this one. It seems to think it's more clever then it is. Rupert Friend gave me a chuckle and Sophie Thatcher (who went to my high school!) did a pretty great job with what she was given. Wish the poster wasn't so spoilery."
    },
    {
      "title": "Thief",
      "link": "https://letterboxd.com/peruvianidol/film/thief/2/",
      "watchedDate": "2025-03-11",
      "filmYear": "1981",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/2/2/4/45224-thief-0-600-0-900-crop.jpg?v=775424c4c3",
      "reviewText": "This movie just gets better every time I watch it. So many great shots and great lines. And such an authentically Chicago-ass movie right down to the Portillo's wrappers on the dash and someone using a Jewel bag as luggage. Makes me wish they'd make a GTA game set in 1980s Chicago."
    },
    {
      "title": "Darkman",
      "link": "https://letterboxd.com/peruvianidol/film/darkman/",
      "watchedDate": "2025-03-10",
      "filmYear": "1990",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/0/4/4/47044-darkman-0-600-0-900-crop.jpg?v=0ce4651ae6",
      "reviewText": "This should be on the Mt. Rushmore of superhero movies. Without this there's no Spider-Man, and without Spider-Man and it's sequels, there's probably no MCU. Marvel has had like 30 shots at this point to make a movie this fun and have maybe come close a handful of times. Watching this again has me excited for Liam Neeson's Naked Gun reboot."
    },
    {
      "title": "Oh, Canada",
      "link": "https://letterboxd.com/peruvianidol/film/oh-canada/",
      "watchedDate": "2025-03-10",
      "filmYear": "2024",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/0/4/0/1/5/1004015-oh-canada-0-600-0-900-crop.jpg?v=9261d4907f",
      "reviewText": "A character study about a mediocre white guy who became successful in spite of himself, coming to terms with his life in front of a documentary crew as he's dying from cancer. Great performance by Richard Gere but woof."
    },
    {
      "title": "Virtuosity",
      "link": "https://letterboxd.com/peruvianidol/film/virtuosity/",
      "watchedDate": "2025-03-09",
      "filmYear": "1995",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/3/2/1/47321-virtuosity-0-600-0-900-crop.jpg?v=7d3dbd4729",
      "reviewText": "An extremely dumb B-movie that somehow lucked out in convincing Denzel to lead it and finding a young Russell Crowe to play its over-the-top VR villain come to life. The writing is awful but you can still see Crowe is a star in the making, and Denzel just naturally elevates everything he's in. It's hilarious to me that despite its sci-fi premise, nothing about this world aside from the concept of VR in the 1990s is particularly futuristic."
    },
    {
      "title": "Master and Commander: The Far Side of the World",
      "link": "https://letterboxd.com/peruvianidol/film/master-and-commander-the-far-side-of-the-world/",
      "watchedDate": "2025-03-08",
      "filmYear": "2003",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/du/jf/g4/jt/4o4JyEQldHQiqJn0BBRFppDmI65-0-600-0-900-crop.jpg?v=4d07bad0bd",
      "reviewText": "I don't think I'd seen this since it came out and at that time I thought it was pretty forgettable. But wow, this thing really holds up and is a helluva movie. There's scenes where I'm just like, \"how did they film this without anyone dying?\" That's when you know you're watching greatness. Being a dad definitely gave me a different perspective, particularly around the young crew members. Why did we get like 30 MCU movies but just one of these?"
    },
    {
      "title": "A Bridge Too Far",
      "link": "https://letterboxd.com/peruvianidol/film/a-bridge-too-far/",
      "watchedDate": "2025-03-08",
      "filmYear": "1977",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/ck/3j/e7/yn/lszOk3Xmh7qpLaM9J4K9E6ADLk1-0-600-0-900-crop.jpg?v=aacf86062a",
      "reviewText": "Like the operation this WW2 movie depicts, A Bridge Too Far is overly-ambitious and doesn't quite succeed. The cast is stacked with a who's who of famous actors, but like the Avengers movies, there's too many characters to give any meaningful time to develop. A lot of the action looks like stock footage, even though it's not. The movie gets more interesting in the last third as it focuses more on the plight of the soldiers on the ground and less on the logistics that the first third painfully drags out. It could have easily been an hour shorter and much improved if it just focused on the soldiers and didn't try to give equal screen time to all the higher-ups played by big name actors."
    },
    {
      "title": "Mickey 17",
      "link": "https://letterboxd.com/peruvianidol/film/mickey-17/",
      "watchedDate": "2025-03-07",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/2/0/2/8/1/620281-mickey-17-0-600-0-900-crop.jpg?v=93e4d2af6d",
      "reviewText": "I had a huge grin on my face through most of this movie. Everyone is just hamming it up and having a good time. Landed in a way that Snowpiercer didn't for me. Robert Pattinson continues to make interesting choices, both in his projects and characters."
    },
    {
      "title": "V for Vendetta",
      "link": "https://letterboxd.com/peruvianidol/film/v-for-vendetta/",
      "watchedDate": "2025-03-05",
      "filmYear": "2005",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/4/0/0/51400-v-for-vendetta-0-600-0-900-crop.jpg?v=c962ca4bec",
      "reviewText": "Decided to revisit this for no particular reason. This movie predicted the Ulcered Sphincter of Ass-erica that we find ourselves in today. It's a little heavy-handed in its imagery, but that finale is just what we need right now, except instead of Guy Fawkes masks they're wearing Luigi hats."
    },
    {
      "title": "Le Samouraï",
      "link": "https://letterboxd.com/peruvianidol/film/le-samourai/",
      "watchedDate": "2025-03-05",
      "filmYear": "1967",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/8/8/1/7/48817-le-samourai-0-600-0-900-crop.jpg?v=11267d74cc",
      "reviewText": "This movie is a vibe. Looks great but I was distracted by the protagonist's fashion choices. He commits a murder early in the movie and then there's a whole half hour of him at the police station and despite there being a ton of witnesses, no one is like \"yeah, it was that Inspector Gadget-looking motherfucker right there.\" A tan trenchcoat and fedora is like the most sus, cliched outfit ever. Anyway, I couldn't stop thinking about it and it kept me from fully enjoying this movie."
    },
    {
      "title": "The Legend of Fong Sai Yuk",
      "link": "https://letterboxd.com/peruvianidol/film/the-legend-of-fong-sai-yuk/",
      "watchedDate": "2025-03-05",
      "filmYear": "1993",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/0/8/6/1/40861-the-legend-0-600-0-900-crop.jpg?v=d8e1b1eb50",
      "reviewText": "Probably the funniest movie Jet Li has made. In most of his movies he plays a very serious martial artist, but here he's letting loose and having fun. Some incredibly inventive wire work and choreography and a few laugh out loud props that had me screaming. There's a sequence near the beginning where Li is battling the wife of a local merchant and must knock her to the ground to win the hand of their daughter that is just wildly outrageous. If that's not enough, Li's mom, played by Josephine Siao, takes a turn, posing as Li's older brother. Delightful. The 4k transfer looks great."
    },
    {
      "title": "The Poseidon Adventure",
      "link": "https://letterboxd.com/peruvianidol/film/the-poseidon-adventure/",
      "watchedDate": "2025-03-03",
      "filmYear": "1972",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/5/6/7/51567-the-poseidon-adventure-0-600-0-900-crop.jpg?v=66fd1216a2",
      "reviewText": "Fairly entertaining with some great back and forth between Gene Hackman's renegade preacher and Ernest Borgnine's ex-cop. One too many screaming damsel characters. Leslie Nielsen as the captain!"
    },
    {
      "title": "Night Moves",
      "link": "https://letterboxd.com/peruvianidol/film/night-moves/",
      "watchedDate": "2025-03-02",
      "filmYear": "1975",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/0/7/0/1/30701-night-moves-0-600-0-900-crop.jpg?v=b65152bdf2",
      "reviewText": "The Hackman marathon continues. I didn't quite care for this 70s noir where Hackman's detective, Harry Mosby, isn't particularly good at his job, or maybe it's just that the central \"mystery\" just isn't that compelling. The real mystery doesn't become evident until nearly the end and even then it feels like a lot is left unsolved, including Harry's own personal life. Man, people sure were horny in the 70s. It seems that everyone in this movie is looking to score, including a young Melanie Griffith. (I didn't even realize it was her until the credits rolled.) Hackman was good though. Just about the only thing keeping me from falling asleep."
    },
    {
      "title": "No Way Out",
      "link": "https://letterboxd.com/peruvianidol/film/no-way-out-1987/",
      "watchedDate": "2025-03-01",
      "filmYear": "1987",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/79/cr/fo/t2/f1u4r6jZwFie18yjJ2uhYXOXsjl-0-600-0-900-crop.jpg?v=873cc9eae7",
      "reviewText": "This movie is a prime example of how a twist ending doesn't make a bad/average movie better in retrospect. No Way Out is a decent thriller but the ending is so nonsensical. Went in looking to fill some gaps in my Gene Hackman watches and was disappointed to get way more Costner. Hackman is good here, playing sleazy and desperate in equal measure but he just doesn't get enough screen time. Instead, Costner, who I've always felt is less an actor than a \"movie star\" runs around the Pentagon like a maniac for half the movie. Was hoping Hackman would be more adversarial but after the \"incident\" he's largely out of play until the end. Will Patton seems like he's in a completely different movie than everyone else but is maybe the best part."
    },
    {
      "title": "Fist of Legend",
      "link": "https://letterboxd.com/peruvianidol/film/fist-of-legend/",
      "watchedDate": "2025-02-27",
      "filmYear": "1994",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/0/7/6/5/40765-fist-of-legend-0-600-0-900-crop.jpg?v=ce49ed6888",
      "reviewText": "I have fond memories of Fist of Legend, my first introduction to Jet Li. There's a ton of kinetic, hard-hitting fight scenes in this, including a prolonged fight with an imposing final boss-type at the end. There are some painful lulls in between but the fights are so well-choreographed and filmed, compared to anything I'd ever seen before in the 90s. This 4k blu-ray looks great but the sound is unfortunately mono. Looking forward to filling out my 4k collection with more Jet Li films, including Tai Chi Master and Fong Sai Yuk."
    },
    {
      "title": "The Hidden",
      "link": "https://letterboxd.com/peruvianidol/film/the-hidden/",
      "watchedDate": "2025-02-26",
      "filmYear": "1987",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/07/47/cd/lc/5CEVBtcNEhz9zJxAKpdaYUAL700-0-600-0-900-crop.jpg?v=171817c2dd",
      "reviewText": "This movie is amazing. It dives right in and keeps getting crazier and more (inadvertently?) funny as it goes. Extremely 80s."
    },
    {
      "title": "Body Parts",
      "link": "https://letterboxd.com/peruvianidol/film/body-parts/",
      "watchedDate": "2025-02-25",
      "filmYear": "1991",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/0/6/1/1/30611-body-parts-0-600-0-900-crop.jpg?v=6661a5e163",
      "reviewText": "\"CAN'T YOU SEE THIS ARM IS KILLING ME?!\"An underrated and unhinged horror classic. I remember seeing this in the theater as a sophomore in high school and it still delights me now more than ever. Just a brilliant premise carried out to its ridiculously over-the-top conclusion. Jeff Fahey plays the lead with earnestness and his sweater game is on point. Brad Dourif pops up in this so you know it's good."
    },
    {
      "title": "This Is the Tom Green Documentary",
      "link": "https://letterboxd.com/peruvianidol/film/this-is-the-tom-green-documentary/",
      "watchedDate": "2025-02-24",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/9/7/7/7/6/1297776-this-is-the-tom-green-documentary-0-600-0-900-crop.jpg?v=00ddafd010",
      "reviewText": "Say what you will about Tom Green's humor but he's undeniably a comedy pioneer. This doc, directed by Green himself, covers his rise to stardom and what he's been up to more recently since leaving LA to live on a farm in his native Ottawa. I remember a lot of his early work on MTV but there was so much fun stuff I missed and it's great to see that Tom is still at it."
    },
    {
      "title": "Demolition Man",
      "link": "https://letterboxd.com/peruvianidol/film/demolition-man/",
      "watchedDate": "2025-02-24",
      "filmYear": "1993",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/8/6/8/46868-demolition-man-0-600-0-900-crop.jpg?v=2a6b346a45",
      "reviewText": "This movie predicted Uber Eats, Zoom calls, AI agents, and self-driving cars and was directed by a guy whose only credit before this was apparently a C+C Music Factory video. It's not a top tier 90s action movie but it's incredibly watchable, largely thanks to Wesley Snipes' charisma and action chops and Sandra Bullock going all-in as Stallone's hopelessly optimistic and 20th century-loving partner. There are some fun action set pieces, including one of the most memorable demises of a villain. How this got made I have no idea but I wish they still made stuff like this."
    },
    {
      "title": "The Social Network",
      "link": "https://letterboxd.com/peruvianidol/film/the-social-network/1/",
      "watchedDate": "2025-02-23",
      "filmYear": "2010",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/nw/cm/pa/ai/sGQv3ZMZBDBnl3z42Q0mEQ5uiDe-0-600-0-900-crop.jpg?v=54ee59f7cd",
      "reviewText": "Zuckerberg sucks. Not sure how much of this movie is true but Fincher's direction, Sorkin's writing, and Reznor and Ross' score add up to a hell of a movie. Looking forward to the legacy-quel in a few years that covers Facebook's (and Zuck's) role in the downfall of society."
    },
    {
      "title": "To Live and Die in L.A.",
      "link": "https://letterboxd.com/peruvianidol/film/to-live-and-die-in-la/",
      "watchedDate": "2025-02-21",
      "filmYear": "1985",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/7/6/9/46769-to-live-and-die-in-l-a--0-600-0-900-crop.jpg?v=4a55db27ed",
      "reviewText": "Just a fun, sleazy, 80s crime movie featuring a pretty epic chase scene and one ridiculous turn after another. Willem Dafoe shines as an expert counterfeiter being pursued by two increasingly incompetent secret service agents. Not a great movie by any means but you can tell this probably inspired Tarantino and others to make similarly over-the-top crime capers."
    },
    {
      "title": "The Brutalist",
      "link": "https://letterboxd.com/peruvianidol/film/the-brutalist/",
      "watchedDate": "2025-02-18",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/8/4/2/8/478428-the-brutalist-0-600-0-900-crop.jpg?v=2f8cae2ea5",
      "reviewText": "I appreciate the ambition here but the last 20 minutes or so elicited a big Aunt Linda reaction from me. I had heard almost universally that the first half was a masterpiece and the end was disappointing but it seems like they oversold the former and undersold the latter. Beautiful looking film and a good performance by Brody, but best picture? Meh."
    },
    {
      "title": "Nickel Boys",
      "link": "https://letterboxd.com/peruvianidol/film/nickel-boys/",
      "watchedDate": "2025-02-18",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/6/5/8/9/926589-nickel-boys-0-600-0-900-crop.jpg?v=c90912e607",
      "reviewText": "A fascinating film that immerses you in the experience of these two young men. Hard to sustain over 2 hours and 20 minutes but the end hits hard. Sadly relevant given our current political climate."
    },
    {
      "title": "SNL50: Beyond Saturday Night",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-beyond-saturday-night/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/9/9/0/2/8/1299028-snl50-beyond-saturday-night-0-600-0-900-crop.jpg?v=eb23391bf7",
      "reviewText": "A pretty entertaining docu-series covering some lesser known aspects of the show (the audition process, the writers, Lorne Michaels' season 11 return) and an entire episode on the cowbell sketch. As someone who dreamed of being on SNL practically since birth, I found a lot to love here. It's like the comedy version of The Last Dance but with less of a cohesive through line between episodes."
    },
    {
      "title": "SNL50: The Homecoming Concert",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-homecoming-concert/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/1/1/6/5/2/1311652-snl50-the-homecoming-concert-0-600-0-900-crop.jpg?v=9b3187bd1c",
      "reviewText": "A joyous mix of SNL cast doing musical numbers and a who's who of former musical guests doing their hits and collaborating with other artists. I was constantly surprised so I won't spoil it here, but if you love SNL and music in general, you'll dig this!"
    },
    {
      "title": "SNL50: The Homecoming Concert",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-homecoming-concert/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/1/1/6/5/2/1311652-snl50-the-homecoming-concert-0-600-0-900-crop.jpg?v=9b3187bd1c",
      "reviewText": "A joyous mix of SNL cast doing musical numbers and a who's who of former musical guests doing their hits and collaborating with other artists. I was constantly surprised so I won't spoil it here, but if you love SNL and music in general, you'll dig this!"
    },
    {
      "title": "SNL50: The Anniversary Special",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-anniversary-special/",
      "watchedDate": "2025-02-16",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/0/8/6/1/2/1308612-snl50-the-anniversary-special-0-600-0-900-crop.jpg?v=cdf893e1c4",
      "reviewText": "A lot of fun seeing new sketches with a mix of cast members from the show's 50 years and random famous people. It felt like they could have went a little harder though."
    },
    {
      "title": "Punch-Drunk Love",
      "link": "https://letterboxd.com/peruvianidol/film/punch-drunk-love/",
      "watchedDate": "2025-02-10",
      "filmYear": "2002",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/7/9/1/4/47914-punch-drunk-love-0-600-0-900-crop.jpg?v=032fc20313",
      "reviewText": "Bought the 4k Criterion of this even though I hadn't seen it since it came out and only remember being disappointed with PTA's follow-up to Boogie Nights and Magnolia. 20+ years later he's made some more great movies (There Will Be Blood, Phantom Thread) and some stinkers (Inherent Vice, Licorice Pizza) putting this somewhere in the middle for me. Having watched Billy Madison and Happy Gilmore about a hundred times in college, I was pleasantly surprised by Sandler's dramatic turn back then. In the years since he's gotten worse at comedy and better at drama, even if he seldom does serious roles. I love the low-budget feel of this, Emily Watson's tender performance, and PSH, my god. To think of all the brilliant performances we've missed out on since his passing. Tragic. He's the perfect foil to Sandler's Barry Egan."
    },
    {
      "title": "Wild Things",
      "link": "https://letterboxd.com/peruvianidol/film/wild-things/",
      "watchedDate": "2025-02-10",
      "filmYear": "1998",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/5/0/6/51506-wild-things-0-600-0-900-crop.jpg?v=bc7b982455",
      "reviewText": "I feel like maybe I saw this before but it was so forgettable that nothing stuck. I definitely remember the poster. Anyway, this movie is very 90s in just about every way. A modern-ish noir with lots of twists and turns and plot points that fall apart if you think about them for more than half a second. It's like a Lifetime movie made for Cinemax, with Denise Richards providing lots of male gaze bits. It's not a good movie by any means but it's pretty fun and trashy all the way through to the credits, where a bunch of stuff is revealed that happened off-camera."
    },
    {
      "title": "Wonder Boys",
      "link": "https://letterboxd.com/peruvianidol/film/wonder-boys/",
      "watchedDate": "2025-02-07",
      "filmYear": "2000",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/6/9/8/45698-wonder-boys-0-600-0-900-crop.jpg?v=68d29ccfd2",
      "reviewText": "One of my all-time favorite screenplays, I must have seen this movie a dozen times, though not recently enough to spot Rob McElhenney for the split second he appears in it. Peak Michael Douglas and a fun supporting performance from Robert Downey Jr. Watching this movie is like slipping into Grady's old robe."
    },
    {
      "title": "Dog Man",
      "link": "https://letterboxd.com/peruvianidol/film/dog-man/",
      "watchedDate": "2025-02-07",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/9/3/7/3/3/693733-dog-man-0-600-0-900-crop.jpg?v=c978774be5",
      "reviewText": "This was more fun than I was expecting. Dog Man is the hero but it's really Pete Davidson's movie. There was a lot to relate to in being a parent and dog owner. At one point Petey asks L'il Petey, \"how come I made you but you're not like me?\" To which L'il Petey responds, \"maybe I am but you just don't like that part.\" That gutted me. Some great humor and 80s references for parents and came in at under 90 minutes."
    },
    {
      "filmTitle": "Sing Sing",
      "link": "https://letterboxd.com/peruvianidol/film/sing-sing-2023/",
      "watchedDate": "2025-02-02",
      "filmYear": "2023",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/4/1/9/5/7/1041957-sing-sing-2023-0-600-0-900-crop.jpg?v=f893b22924",
      "reviewText": "There’s a vulnerability in acting that almost seems incongruous with prison life. Yet this story, about the real-life Rehabilitation Through the Arts program at Sing Sing, proves that wrong, blending fact with fiction with a cast of real RTA alums. Coleman Domingo gives a powerful performance and deserves all of the awards buzz. But the real standout for me was Clarence Maclin, one of the RTA members, who plays his vital arc with convincing nuance. A great pairing with Ghostlight, which also shows the redemptive power of theater."
    },
    {
      "filmTitle": "Land of Bad",
      "link": "https://letterboxd.com/peruvianidol/film/land-of-bad/",
      "watchedDate": "2025-01-30",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/7/2/7/5/5/872755-land-of-bad-0-600-0-900-crop.jpg?v=0d2d580e81",
      "reviewText": "A perfectly cromulent dadcore movie with two Hemsworths (but not the good one) and a thicc Russell Crowe as the guy in the chair. Strains credulity near the end but mostly enjoyable otherwise."
    },
    {
      "filmTitle": "Babygirl",
      "link": "https://letterboxd.com/peruvianidol/film/babygirl-2024/",
      "watchedDate": "2025-01-29",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/9/1/2/5/989125-babygirl-2024-0-600-0-900-crop.jpg?v=b175884970",
      "reviewText": "The horniest movie since Sanctuary, which it has a lot in common with. Kidman is great, you don’t often see older women depicted in positions of power while also screwing a much younger guy. Dickinson is kind of an empty vessel here, but maybe that was the point. I don’t buy for a minute that Antonio Banderas can’t get it done in the bedroom."
    },
    {
      "filmTitle": "Number 24",
      "link": "https://letterboxd.com/peruvianidol/film/number-24/",
      "watchedDate": "2025-01-27",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/0/5/8/9/5/1105895-number-24-0-600-0-900-crop.jpg?v=e7ca84c935",
      "reviewText": "A timely tale of the Norwegian resistance during WW2, and Norway’s most decorated hero, Gunnar Sønsteby. Framed by a Q&A many years after the war, Gunnar tells the audience of young Norwegians, “All these stories that you see that are published in the papers, they tell them. It’s the owners. What to print and what not to print. Every single time. So in the case of war, well, those papers should be lit instead. They’re mere kindling.” That really stuck with me given the current state of things. The flashbacks to the war are pretty standard fare, but Gunnar’s reckoning with his actions after being questioned by a young woman at the Q&A was quite poignant. Worth watching."
    },
    {
      "filmTitle": "Zero Effect",
      "link": "https://letterboxd.com/peruvianidol/film/zero-effect/",
      "watchedDate": "2025-01-27",
      "filmYear": "1998",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/5e/g1/tb/du/qmgUyhyJQwHzZ7ulaYCJLBon7gG-0-600-0-900-crop.jpg?v=6b30952605",
      "reviewText": "Such an underrated 90s gem. Maybe my favorite Bill Pullman movie. Kim Dickens is great, playing vulnerable, calculating and mysterious in equal turns. And Ben Stiller! It’s wild to me that the same director also did Walk Hard AND Red One. This movie practically begs for a TV show."
    },
    {
      "filmTitle": "Blink Twice",
      "link": "https://letterboxd.com/peruvianidol/film/blink-twice/",
      "watchedDate": "2025-01-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/7/5/6/0/4/2/756042-blink-twice-0-600-0-900-crop.jpg?v=2f35ddcd4e",
      "reviewText": "Wow, that was deeply unsettling. Blink Twice sets the table and then just kinda of lets you stew in a sense of unease before finally revealing itself. From there it gets wild. I never thought much of Channing Tatum as an actor but he’s perfectly cast here, delivering a mix of charm and menace. The ending is *chef’s kiss*."
    },
    {
      "filmTitle": "Gangs of New York",
      "link": "https://letterboxd.com/peruvianidol/film/gangs-of-new-york-2002/",
      "watchedDate": "2025-01-23",
      "filmYear": "2002",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/9/8/4/6/49846-gangs-of-new-york-0-600-0-900-crop.jpg?v=5c4435acc6",
      "reviewText": "There’s a lot to love here, particularly Daniel Day-Lewis’ performance as Bill the Butcher. It feels like both DiCaprio and Diaz are miscast and Scorsese just tries to do too much at the end. There’s a lot of build-up to a climactic confrontation that’s largely disrupted by a historical event. This movie is probably more relevant to today’s political climate than it was in 2002. If only we could see we should be fighting the “$300 men” instead of each other."
    },
    {
      "filmTitle": "Nosferatu",
      "link": "https://letterboxd.com/peruvianidol/film/nosferatu-2024/",
      "watchedDate": "2025-01-22",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/5/9/5/0/5/359505-nosferatu-2024-0-600-0-900-crop.jpg?v=a12d4ad648",
      "reviewText": "Incredible. A feast for the eyes. Riveting from beginning to end. Perhaps my favorite Eggers film so far. Willem Dafoe is my king."
    },
    {
      "filmTitle": "2073",
      "link": "https://letterboxd.com/peruvianidol/film/2073/",
      "watchedDate": "2025-01-21",
      "filmYear": "2024",
      "memberRating": "1.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/2/8/8/2/922882-2073-0-600-0-900-crop.jpg?v=58a1e20c8e",
      "reviewText": "This “documentary” is like “Somebody Should Do Something About All the Problems” framed in a vague speculative fiction dystopia. It lists off problems that, to no one’s surprise, are bad! And if left unchecked, could lead to a disastrous future, as if it’s not already here. It asks us to take action before it’s too late but has no ideas about what those actions might be. One of the many problems it covers is AI, but it seems like AI was used to make the doc? 84 minutes of my life I’ll never get back."
    },
    {
      "filmTitle": "I Saw the Devil",
      "link": "https://letterboxd.com/peruvianidol/film/i-saw-the-devil/",
      "watchedDate": "2025-01-10",
      "filmYear": "2010",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/m3/dw/c1/xn/4o52BPrgvq7b2xFy1OdVSIoIn1T-0-600-0-900-crop.jpg?v=7cdd6fab3f",
      "reviewText": "Well that was bleak."
    },
    {
      "filmTitle": "Se7en",
      "link": "https://letterboxd.com/peruvianidol/film/se7en/1/",
      "watchedDate": "2025-01-08",
      "filmYear": "1995",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/3/4/5/51345-se7en-0-600-0-900-crop.jpg?v=76a14ef6b4",
      "reviewText": "Gorgeous 4K transfer. The last 20 minutes of this is perfect. Even after maybe a dozen viewings it’s still incredibly tense."
    },
    {
      "filmTitle": "A Real Pain",
      "link": "https://letterboxd.com/peruvianidol/film/a-real-pain/",
      "watchedDate": "2025-01-06",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/1/3/2/5/8/913258-a-real-pain-0-600-0-900-crop.jpg?v=893a943872",
      "reviewText": "This was really bizarre to watch as I recognized aspects of myself in both Kieran Culkin and Jesse Eisenberg’s characters that are often in conflict. It was like seeing my inner voice projected on the screen. Their journey together and their interactions with the people around them almost felt like set dressing to inform the relationship between these two cousins. I’ll have to give it another watch. The last shot shook me."
    },
    {
      "filmTitle": "Your Friend, Nate Bargatze",
      "link": "https://letterboxd.com/peruvianidol/film/your-friend-nate-bargatze/",
      "watchedDate": "2025-01-01",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/6/2/7/5/2/1262752-your-friend-nate-bargatze-0-600-0-900-crop.jpg?v=cfb5590e05",
      "reviewText": "I like Nate but his dry, clean humor doesn’t elicit much more than a hearty chuckle from me."
    },
    {
      "filmTitle": "We Live in Time",
      "link": "https://letterboxd.com/peruvianidol/film/we-live-in-time/",
      "watchedDate": "2024-12-31",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/9/1/7/8/6/991786-we-live-in-time-0-600-0-900-crop.jpg?v=14245ba118",
      "reviewText": "Not sure this needed to have such a non-linear narrative, except “time” is in the title, so I guess? I enjoyed the chemistry between Garfield and Pugh, but it probably would have worked the same as a conventional narrative. Some good moments but ultimately I don’t think it was terribly memorable."
    },
    {
      "filmTitle": "Challengers",
      "link": "https://letterboxd.com/peruvianidol/film/challengers/1/",
      "watchedDate": "2024-12-29",
      "filmYear": "2024",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/4/2/3/0/1/842301-challengers-0-600-0-900-crop.jpg?v=a7cd63cbef",
      "reviewText": "Struggled to stay awake through this as I was doped up on NyQuil as my wife and I watched this in a hotel room, both struggling with some unknown virus. On top of that the hotel TV had motion-smoothing turned on, which was extremely distracting. All that said, this movie still slaps. Incredible score and just a fun horny time with three great leads."
    },
    {
      "filmTitle": "Nightbitch",
      "link": "https://letterboxd.com/peruvianidol/film/nightbitch/",
      "watchedDate": "2024-12-28",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/5/1/2/2/6/651226-nightbitch-0-600-0-900-crop.jpg?v=9717400486",
      "reviewText": "Amy Adams is great in this spin on Teen Wolf. Lots to relate to here as tired parent."
    },
    {
      "filmTitle": "Red Rooms",
      "link": "https://letterboxd.com/peruvianidol/film/red-rooms/",
      "watchedDate": "2024-12-26",
      "filmYear": "2023",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/1/8/7/9/8/818798-red-rooms-0-600-0-900-crop.jpg?v=af37112bc2",
      "reviewText": "Absolutely chilling. Feels very of the moment with our obsession with true crime and its depiction of the dark web. Juliette Gariépy delivers an incredible performance, creepy and understated at the same time. This movie kept me guessing until the very end."
    },
    {
      "filmTitle": "Heretic",
      "link": "https://letterboxd.com/peruvianidol/film/heretic-2024/",
      "watchedDate": "2024-12-25",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/2/5/3/3/1/1025331-heretic-2024-0-600-0-900-crop.jpg?v=c79c5c8121",
      "reviewText": "My mom told me she once invited a Jehovah's Witness in for a chat and they by the time they left they were no longer a Jehovah's Witness and now I have questions. Anyway, this was fiendishly clever and it seems like the type of movie that will benefit from repeat viewings. Chilling performance from Hugh Grant."
    },
    {
      "filmTitle": "It's a Wonderful Life",
      "link": "https://letterboxd.com/peruvianidol/film/its-a-wonderful-life/9/",
      "watchedDate": "2024-12-24",
      "filmYear": "1946",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/4/9/50949-it-s-a-wonderful-life-0-600-0-900-crop.jpg?v=64b72dd083",
      "reviewText": "\"...this rabble you're talking about, they do most of the working and paying and living and dying in this community. Well, is it too much to have them work and pay and live and die in a couple of decent rooms and a bath?\"Turns out we're all living in Pottersville and Mr. Potter is President-elect."
    },
    {
      "filmTitle": "Y2K",
      "link": "https://letterboxd.com/peruvianidol/film/y2k-2024/",
      "watchedDate": "2024-12-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/6/2/5/7/986257-y2k-0-600-0-900-crop.jpg?v=f5b3bd7137",
      "reviewText": "Kyle Mooney's humor is definitely not for everyone but this movie had me laughing my ass off. Heavy on the late 90s nostalgia and includes maybe the best cameo of the year. Brilliantly spoofs movies of that era and mixes genres in a fun way. It's almost a millennial Wet Hot American Summer. Didn't love this as much as Brigsby Bear but was not disappointed."
    },
    {
      "filmTitle": "The Order",
      "link": "https://letterboxd.com/peruvianidol/film/the-order-2024/",
      "watchedDate": "2024-12-24",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/7/5/3/9/3/975393-the-order-2024-0-600-0-900-crop.jpg?v=4a956cfea6",
      "reviewText": "I dug the 80s aesthetic here and loved Jude Law as a grizzled FBI agent chasing down a group of white nationalists. The whole thing didn't add up to much, mostly because there's just not enough time to develop its characters. There's definitely some Heat and Sicario influences at play but The Order lacks the depth of those films. Might have been better as the next season of True Detective."
    },
    {
      "filmTitle": "The Substance",
      "link": "https://letterboxd.com/peruvianidol/film/the-substance/1/",
      "watchedDate": "2024-12-23",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/3/8/1/4/0/838140-the-substance-0-600-0-900-crop.jpg?v=ab9e1072f8",
      "reviewText": "Watched this again with my wife and it was delightful watching her squirm and squeal through the increasingly disturbing moments. Props to Demi for reading this script and going, \"hell yes, let's do this.\""
    },
    {
      "title": "Juror #2",
      "link": "https://letterboxd.com/peruvianidol/film/juror-2/",
      "watchedDate": "2024-12-21",
      "filmYear": "2024",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/9/7/7/2/2/997722-juror-2-0-600-0-900-crop.jpg?v=14601fa694",
      "reviewText": "Real TV movie of the week vibes. 12 Angry Men meets Idiocracy. There's so many elements that strain credulity and the ending was pretty unsatisfying. I'm not sure if people are giving this a pass because Eastwood directed it or if I saw a completely different movie. Yeesh."
    },
    {
      "filmTitle": "28 Weeks Later",
      "link": "https://letterboxd.com/peruvianidol/film/28-weeks-later/",
      "watchedDate": "2024-12-21",
      "filmYear": "2007",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/7/2/50972-28-weeks-later-0-600-0-900-crop.jpg?v=811010e540",
      "reviewText": "Very much Force Majeure with zombies. The first two-thirds or so is pretty action-packed. It kind of loses steam towards the end. Looks better than the first movie just by virtue of using a better camera but lacks Danny Boyle's style. Great to see Jeremy Renner, Idris Elba and Rose Byrne before they were household names. Turns out bringing Americans in to solve your problems is maybe not the best idea."
    },
    {
      "filmTitle": "Sonic the Hedgehog 3",
      "link": "https://letterboxd.com/peruvianidol/film/sonic-the-hedgehog-3/",
      "watchedDate": "2024-12-21",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/4/4/1/4/8/844148-sonic-the-hedgehog-3-0-600-0-900-crop.jpg?v=4878f94b09",
      "reviewText": "Completely nonsensical plot. It didn't help that I didn't see Sonic 2. But my 5-year-old was excited to see this in the theater — only his third movie in one. I spent most of the runtime trying to get my 2-year-old to sit still and not be a complete nuisance but my overall impression was that it was visually interesting and had double the Jim Carrey, which I had no complaints about. My kids gave it two thumbs up, take that as you will."
    },
    {
      "filmTitle": "28 Days Later",
      "link": "https://letterboxd.com/peruvianidol/film/28-days-later/",
      "watchedDate": "2024-12-20",
      "filmYear": "2002",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/qr/28/nz/3f/xaYdxi1PBEAYvqknvAmMPK5Eff3-0-600-0-900-crop.jpg?v=22d7237ed9",
      "reviewText": "Such a great setup for a zombie movie but the middle lags quite a bit and it turns out that men are more sick than zombies. The final act is pretty satisfying though. It's a shame this movie looks so terrible as it was shot on a Canon XL 1. It'll be interesting to see Boyle revisit this with 28 Years Later."
    },
    {
      "filmTitle": "Super/Man: The Christopher Reeve Story",
      "link": "https://letterboxd.com/peruvianidol/film/super-man-the-christopher-reeve-story/",
      "watchedDate": "2024-12-19",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/1/6/9/2/8/1016928-super-man-the-christopher-reeve-story-0-600-0-900-crop.jpg?v=40dde60ca4",
      "reviewText": "Superman was one of the first movies I remember seeing in the theater. It really captured my imagination and Christopher Reeve's performance a huge part of it. I don't know that I ever saw him in anything else until after he passed. He was just always Superman. This doc mostly covers his life after being paralyzed, his advocacy for the disabled, and the family, friends, and legacy he left behind. It had me in tears for most of the last 20 minutes. It's devastating to see our heroes fall but some manage to rise up and be more heroic than ever. Reeve was certainly one of those heroes."
    },
    {
      "filmTitle": "Paris, Texas",
      "link": "https://letterboxd.com/peruvianidol/film/paris-texas/1/",
      "watchedDate": "2024-12-19",
      "filmYear": "1984",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/4/6/9/51469-paris-texas-0-600-0-900-crop.jpg?v=c8f2743612",
      "reviewText": "Gorgeous 4k remaster. This movie is a slow burn but the last half hour is so remarkable it's haunted me since the first time I saw it."
    },
    {
      "filmTitle": "No Country for Old Men",
      "link": "https://letterboxd.com/peruvianidol/film/no-country-for-old-men/1/",
      "watchedDate": "2024-12-14",
      "filmYear": "2007",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/dr/hr/pz/ez/ehLb2SQ3djlA1FrQKbP2WO3VH09-0-600-0-900-crop.jpg?v=6489920a92",
      "reviewText": "An absolute masterpiece. I love this movie more each time I see it. The thing I noticed most this time around is how much happens off screen. The story and characters are so well put together that they don’t even need to show you things that other movies would relish making a scene of. Great performances all around and gorgeous cinematography by Deakins."
    },
    {
      "filmTitle": "Carry-On",
      "link": "https://letterboxd.com/peruvianidol/film/carry-on-2024/",
      "watchedDate": "2024-12-13",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/0/5/8/7/6/905876-carry-on-2024-0-600-0-900-crop.jpg?v=bc2c1c0d8f",
      "reviewText": "Way more fun than it has any right to be. The plot is ridiculous but the cast is stacked with a who's who of great character actors. Taron Egerton is solid, if not overqualified to be a TSA agent. A lot of comparisons to Die Hard, but this is more like Phone Booth except it's actually enjoyable."
    },
    {
      "filmTitle": "The Man from U.N.C.L.E.",
      "link": "https://letterboxd.com/peruvianidol/film/the-man-from-uncle/1/",
      "watchedDate": "2024-12-07",
      "filmYear": "2015",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/4/5/8/2/2/145822-the-man-from-u-n-c-l-e--0-600-0-900-crop.jpg?v=2cc57633aa",
      "reviewText": "Stylish and fun in a way that Guy Ritchie excels at. I watched reruns of the show as a kid and, while it was fun, it never looked this cool. It’s a shame that Armie Hammer turned out to be a weird vampire sex perv or whatever. I would have loved for this to be a franchise. Also on second watch I realized that Jared Harris plays Solo’s boss, doing a hilariously bad American accent and I loved every minute of it."
    },
    {
      "filmTitle": "Anthony Jeselnik: Bones and All",
      "link": "https://letterboxd.com/peruvianidol/film/anthony-jeselnik-bones-and-all/",
      "watchedDate": "2024-12-05",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/6/6/4/1/9/1266419-anthony-jeselnik-bones-and-all-0-600-0-900-crop.jpg?v=dbbca95550",
      "reviewText": "It came as no surprise in this special when Jeselnik talked about his comedy hero, Norm MacDonald. Both he and Norm have a similar deadpan style where you don’t know where a joke is going but when the punchline drops it’s almost always a surprise. Jeselnik tells a bunch of stories from his 20 years in stand up with such bravado, never once cracking a smile at his own jokes. I can’t say his humor is for everybody but I laughed my ass off."
    },
    {
      "filmTitle": "Brigsby Bear",
      "link": "https://letterboxd.com/peruvianidol/film/brigsby-bear/1/",
      "watchedDate": "2024-12-04",
      "filmYear": "2017",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/1g/pp/xg/9f/lRLoSm2Yp0lRvme5xxE31qbDbYv-0-600-0-900-crop.jpg?v=a84f272046",
      "reviewText": "I wanted to revisit this with Kyle Mooney’s new movie, Y2K coming out this week. I think this was my favorite movie of 2017 and I still love it the second time around. Mooney plays it with such earnestness that you really care for his character. Shades of Be Kind, Rewind and The Truman Show. Mark Hamill is perfectly cast. Now I’m really stoked to check out Y2K."
    },
    {
      "filmTitle": "Police Story 3: Super Cop",
      "link": "https://letterboxd.com/peruvianidol/film/police-story-3-super-cop/",
      "watchedDate": "2024-12-04",
      "filmYear": "1992",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/5/7/2/45572-police-story-3-super-cop-0-600-0-900-crop.jpg?v=3c5469ed8d",
      "reviewText": "I appreciate Supercop more than I love it. It’s truly a miracle that no one died making this movie, particularly Michelle Yeoh, who is absolutely fearless and very much Jackie’s equal in terms of skill and screen presence. The plot is ridiculously over-the-top but grounded with humor, like many of Jackie’s movies. Props to the stunt team who managed several set pieces on par with modern Mission: Impossible movies years earlier. There are very few movie stars that would risk their lives just to entertain us for a couple of hours but I’m glad they exist."
    },
    {
      "filmTitle": "Crouching Tiger, Hidden Dragon",
      "link": "https://letterboxd.com/peruvianidol/film/crouching-tiger-hidden-dragon/",
      "watchedDate": "2024-12-03",
      "filmYear": "2000",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/9/0/5/51905-crouching-tiger-hidden-dragon-0-600-0-900-crop.jpg?v=6ce0305909",
      "reviewText": "I was so happy to revisit this gorgeous movie on 4K bluray. It had been a long time since I’d last seen it but it really holds up as one of the best wuxia films of all time. Great cast, stunning cinematography and a moving score."
    },
    {
      "filmTitle": "O Brother, Where Art Thou?",
      "link": "https://letterboxd.com/peruvianidol/film/o-brother-where-art-thou/",
      "watchedDate": "2024-12-01",
      "filmYear": "2000",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/a0/sz/qf/mq/erBsxkzVwkXuvuzUBpVnNxxPYhO-0-600-0-900-crop.jpg?v=80375a32fa",
      "reviewText": "One of my favorite Coen Brothers movies, I must have seen it a dozen times but probably not in at least 15 years or so. Clooney is so wacky and charming and the supporting cast is wonderful, like most Coen movies. All these years later it felt like it lost some of its luster but it’s still a fun time."
    },
    {
      "filmTitle": "Kiss Kiss Bang Bang",
      "link": "https://letterboxd.com/peruvianidol/film/kiss-kiss-bang-bang-2005/",
      "watchedDate": "2024-12-01",
      "filmYear": "2005",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/ek/qa/d5/cb/18GHWx66uADdY7GM9NL8WRY5GSw-0-600-0-900-crop.jpg?v=cc723e4c2b",
      "reviewText": "First time revisiting this and it’s still pretty great. Some of the dialogue hasn’t aged well but that could be said for a lot of 20-year-old movies. Downey Jr and Kilmer have great chemistry. Love how this movie subverts cliches left and right. I wish Shane Black just made a career doing screwball buddy detective movies like this and The Nice Guys."
    },
    {
      "filmTitle": "Conclave",
      "link": "https://letterboxd.com/peruvianidol/film/conclave/",
      "watchedDate": "2024-11-28",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/7/7/2/5/3/877253-conclave-0-600-0-900-crop.jpg?v=f9cbf50dec",
      "reviewText": "More like MEN TALKING, amirite? In all seriousness, as an atheist, I didn't expect to be so riveted by this movie. Gorgeously shot and almost plays like a murder mystery. So many twists and turns culminating in such a fantastic and timely reveal. Gave me hope that maybe good can ultimately prevail in the face of a bunch of shitty men."
    },
    {
      "filmTitle": "Vera Drake",
      "link": "https://letterboxd.com/peruvianidol/film/vera-drake/",
      "watchedDate": "2024-11-28",
      "filmYear": "2004",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/5/5/9/7/45597-vera-drake-0-600-0-900-crop.jpg?v=45229e256c",
      "reviewText": "Joined my wife mid-way through this and then went back and watched the parts I missed. What an odd movie. I'm almost not sure where this movie stands on the issue of abortion but it could prove to be a lot more relevant if the Project 2025 weirdos have their way."
    },
    {
      "filmTitle": "A Different Man",
      "link": "https://letterboxd.com/peruvianidol/film/a-different-man/",
      "watchedDate": "2024-11-27",
      "filmYear": "2024",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/9/1/2/9/1/891291-a-different-man-0-600-0-900-crop.jpg?v=f19de2db41",
      "reviewText": "Darkly funny, which I was not at all expecting. Part Charlie Kaufman, part David Cronenberg. Adam Pearson is so outrageously confident and Renate Reinsve is delightful. This would make a great double feature with The Substance."
    },
    {
      "filmTitle": "Gladiator",
      "link": "https://letterboxd.com/peruvianidol/film/gladiator-2000/1/",
      "watchedDate": "2024-11-26",
      "filmYear": "2000",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/9/5/2/51952-gladiator-2000-0-600-0-900-crop.jpg?v=0071a74571",
      "reviewText": "This movie never gets old. So many good lines. Epic score. Rousing action. Revisiting this after the sequel (which I quite enjoyed) only elevated the greatness of the original for me."
    },
    {
      "filmTitle": "Abigail",
      "link": "https://letterboxd.com/peruvianidol/film/abigail-2024/",
      "watchedDate": "2024-11-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/0/1/2/8/5/1001285-abigail-0-600-0-900-crop.jpg?v=39f001008d",
      "reviewText": "I had low expectations going into this because the marketing for the movie ruined the whole premise but I had great time with it. Funny and gory, it should have come as no surprise that this was made by the team behind Ready or Not. Dan Stevens is great, as always, but just about everyone in the cast brings something unique. This movie is a ton of fun."
    },
    {
      "filmTitle": "Speed",
      "link": "https://letterboxd.com/peruvianidol/film/speed/",
      "watchedDate": "2024-11-22",
      "filmYear": "1994",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/0/4/50904-speed-0-600-0-900-crop.jpg?v=08424df13d",
      "reviewText": "Classic 90s action movie. Highly implausible but peak Keanu and Sandra Bullock make it work. Dennis Hopper feels miscast as the villain. Maybe with better writing it wouldn't have been as noticable, but I give it a pass because Hopper is Hopper and this movie is just non-stop thrills. Couldn't tell you anything about Speed 2 without confusing it with Under Seige but the first one slaps."
    },
    {
      "filmTitle": "Gladiator II",
      "link": "https://letterboxd.com/peruvianidol/film/gladiator-ii/",
      "watchedDate": "2024-11-21",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/8/6/9/7/8/486978-gladiator-ii-0-600-0-900-crop.jpg?v=0fb2edf525",
      "reviewText": "I’m growing weary of all these “lega-sequels” but I was, in fact, entertained! Paul Mescal takes up the mantle for Russell Crowe’s Maximus, whose presence looms large over the movie, and does a serviceable job. Denzel Washington is just having a blast here. He’s bringing Training Day energy, which would otherwise seem out of place if it weren’t for the comically over-the-top twin emperors of Rome. The set pieces are solid and the whole affair leads up to a rousing and satisfying conclusion. Love that Ridley Scott is still banging out movies, even if they don’t all hit as hard as this one."
    },
    {
      "filmTitle": "The Terminator",
      "link": "https://letterboxd.com/peruvianidol/film/the-terminator/1/",
      "watchedDate": "2024-11-20",
      "filmYear": "1984",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/g2/2g/f0/6b/the-terminator-original-0-600-0-900-crop.jpg?v=677a47d94a",
      "reviewText": "The setup of this movie is so brilliantly economical. Seeing this in the theater before Arnold became a superstar and Terminator 2 became a pop culture phenomenon, the night club scene must have been wild. The shootout at the police station must have seemed utterly terrifying but today it’s just a Tuesday. The effects don’t hold up very well, particularly in the otherwise gorgeous 4K transfer, but this is such a well-crafted film and a template for Cameron’s later work that would go on to shatter box office records again and again."
    },
    {
      "filmTitle": "Birth",
      "link": "https://letterboxd.com/peruvianidol/film/birth-2004/",
      "watchedDate": "2024-11-14",
      "filmYear": "2004",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/47/69/xz/jf/8iYcbxHwArwiqtPSU0aeuGawGrP-0-600-0-900-crop.jpg?v=76abf7d9b0",
      "reviewText": "I was interested in checking out this early work of Jonathan Glazer and it did not disappoint. From the very beginning, like Nicole Kidman, you’re not fully convinced whether 10-year-old Cameron Bright is actually the reincarnation of her dead husband. The score is both chilling and whimsical at times, and the cast features some great supporting actors, including Danny Huston, who plays Kidman’s (adult) fiancée. Watching him unravel as Kidman gets pulled deeper into this kid’s story culminates in such a delightful way. I really had no idea where this was going until the very end."
    },
    {
      "filmTitle": "My Old Ass",
      "link": "https://letterboxd.com/peruvianidol/film/my-old-ass/",
      "watchedDate": "2024-11-12",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/5/2/5/3/1/852531-my-old-ass-0-600-0-900-crop.jpg?v=2b684502b7",
      "reviewText": "A short and sweet coming-of-age movie with a dash of magic(?), for lack of a better word. I was expecting it to lean a bit more into its initial premise but it keeps it at arms length. Aubrey Plaza and Maisy Stella couldn’t be more different but they make it work. And I randomly watched back-to-back movies with Percy Hynes White, who is charming and down-to-earth here. I was ready to write this off as just another breezy rom-com but the ending really landed for me and reminded me of one of my favorite movies that I won’t name because that would spoil this one."
    },
    {
      "filmTitle": "Anora",
      "link": "https://letterboxd.com/peruvianidol/film/anora/",
      "watchedDate": "2024-11-11",
      "filmYear": "2024",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/5/9/5/4/0/959540-anora-0-600-0-900-crop.jpg?v=6f92877033",
      "reviewText": "Despite finding nearly every character in this movie unlikable and entitled, I was captivated the whole time. I would describe Anora as Pretty Woman meets Uncut Gems. Mikey Madison gives a really brave performance. Sean Baker again shows he’s a unique and incredibly talented filmmaker. I was surprised how funny this movie was. Also, it’s clear the actor that plays Vanya never played a video game in his life."
    },
    {
      "filmTitle": "I Like Movies",
      "link": "https://letterboxd.com/peruvianidol/film/i-like-movies/",
      "watchedDate": "2024-11-10",
      "filmYear": "2022",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/8/3/1/5/3/883153-i-like-movies-0-600-0-900-crop.jpg?v=f0181e54fc",
      "reviewText": "A really sweet and earnest coming-of-age movie. I also like movies and grew up in the video store age, so I found a lot to relate to. Isaiah Lehtinen is really great and believably awkward as the lead character, Lawrence. I almost wish the movie was longer than its 100 minute run time. I would have liked to see more of Lawrence and his manager Alana’s relationship develop. It seemed a little rushed."
    },
    {
      "filmTitle": "Spartacus",
      "link": "https://letterboxd.com/peruvianidol/film/spartacus/",
      "watchedDate": "2024-11-09",
      "filmYear": "1960",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/1/9/6/51196-spartacus-0-600-0-900-crop.jpg?v=81703ce87a",
      "reviewText": "This movie is painfully long but I have to give it props for its sheer ambition and scope. Kirk Douglas is such a charmer you can believe he’d be able to lead a slave uprising. Given recent events I was all jazzed when the slaves were eating the rich but uh, well, I guess we’re all truly fucked."
    }
  ]
}