{
  "lastUpdated": "2025-03-08T01:16:53.302Z",
  "movies": [
    {
      "title": "Mickey 17",
      "link": "https://letterboxd.com/peruvianidol/film/mickey-17/",
      "watchedDate": "2025-03-07",
      "filmYear": "2025",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/2/0/2/8/1/620281-mickey-17-0-600-0-900-crop.jpg?v=93e4d2af6d",
      "reviewText": "I had a huge grin on my face through most of this movie. Everyone is just hamming it up and having a good time. Landed in a way that Snowpiercer didn't for me. Robert Pattinson continues to make interesting choices, both in his projects and characters."
    },
    {
      "title": "The Legend of Fong Sai Yuk",
      "link": "https://letterboxd.com/peruvianidol/film/the-legend-of-fong-sai-yuk/",
      "watchedDate": "2025-03-05",
      "filmYear": "1993",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/0/8/6/1/40861-the-legend-0-600-0-900-crop.jpg?v=d8e1b1eb50",
      "reviewText": "Probably the funniest movie Jet Li has made. In most of his movies he plays a very serious martial artist, but here he's letting loose and having fun. Some incredibly inventive wire work and choreography and a few laugh out loud props that had me screaming. There's a sequence near the beginning where Li is battling the wife of a local merchant and must knock her to the ground to win the hand of their daughter that is just wildly outrageous. If that's not enough, Li's mom, played by Josephine Siao, takes a turn, posing as Li's older brother. Delightful. The 4k transfer looks great."
    },
    {
      "title": "The Poseidon Adventure",
      "link": "https://letterboxd.com/peruvianidol/film/the-poseidon-adventure/",
      "watchedDate": "2025-03-03",
      "filmYear": "1972",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/5/6/7/51567-the-poseidon-adventure-0-600-0-900-crop.jpg?v=66fd1216a2",
      "reviewText": "Fairly entertaining with some great back and forth between Gene Hackman's renegade preacher and Ernest Borgnine's ex-cop. One too many screaming damsel characters. Leslie Nielsen as the captain!"
    },
    {
      "title": "Night Moves",
      "link": "https://letterboxd.com/peruvianidol/film/night-moves/",
      "watchedDate": "2025-03-02",
      "filmYear": "1975",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/0/7/0/1/30701-night-moves-0-600-0-900-crop.jpg?v=b65152bdf2",
      "reviewText": "The Hackman marathon continues. I didn't quite care for this 70s noir where Hackman's detective, Harry Mosby, isn't particularly good at his job, or maybe it's just that the central \"mystery\" just isn't that compelling. The real mystery doesn't become evident until nearly the end and even then it feels like a lot is left unsolved, including Harry's own personal life. Man, people sure were horny in the 70s. It seems that everyone in this movie is looking to score, including a young Melanie Griffith. (I didn't even realize it was her until the credits rolled.) Hackman was good though. Just about the only thing keeping me from falling asleep."
    },
    {
      "title": "No Way Out",
      "link": "https://letterboxd.com/peruvianidol/film/no-way-out-1987/",
      "watchedDate": "2025-03-01",
      "filmYear": "1987",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/79/cr/fo/t2/f1u4r6jZwFie18yjJ2uhYXOXsjl-0-600-0-900-crop.jpg?v=873cc9eae7",
      "reviewText": "This movie is a prime example of how a twist ending doesn't make a bad/average movie better in retrospect. No Way Out is a decent thriller but the ending is so nonsensical. Went in looking to fill some gaps in my Gene Hackman watches and was disappointed to get way more Costner. Hackman is good here, playing sleazy and desperate in equal measure but he just doesn't get enough screen time. Instead, Costner, who I've always felt is less an actor than a \"movie star\" runs around the Pentagon like a maniac for half the movie. Was hoping Hackman would be more adversarial but after the \"incident\" he's largely out of play until the end. Will Patton seems like he's in a completely different movie than everyone else but is maybe the best part."
    },
    {
      "title": "Fist of Legend",
      "link": "https://letterboxd.com/peruvianidol/film/fist-of-legend/",
      "watchedDate": "2025-02-27",
      "filmYear": "1994",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/0/7/6/5/40765-fist-of-legend-0-600-0-900-crop.jpg?v=ce49ed6888",
      "reviewText": "I have fond memories of Fist of Legend, my first introduction to Jet Li. There's a ton of kinetic, hard-hitting fight scenes in this, including a prolonged fight with an imposing final boss-type at the end. There are some painful lulls in between but the fights are so well-choreographed and filmed, compared to anything I'd ever seen before in the 90s. This 4k blu-ray looks great but the sound is unfortunately mono. Looking forward to filling out my 4k collection with more Jet Li films, including Tai Chi Master and Fong Sai Yuk."
    },
    {
      "title": "The Hidden",
      "link": "https://letterboxd.com/peruvianidol/film/the-hidden/",
      "watchedDate": "2025-02-26",
      "filmYear": "1987",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/07/47/cd/lc/5CEVBtcNEhz9zJxAKpdaYUAL700-0-600-0-900-crop.jpg?v=171817c2dd",
      "reviewText": "This movie is amazing. It dives right in and keeps getting crazier and more (inadvertently?) funny as it goes. Extremely 80s."
    },
    {
      "title": "Body Parts",
      "link": "https://letterboxd.com/peruvianidol/film/body-parts/",
      "watchedDate": "2025-02-25",
      "filmYear": "1991",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/0/6/1/1/30611-body-parts-0-600-0-900-crop.jpg?v=6661a5e163",
      "reviewText": "\"CAN'T YOU SEE THIS ARM IS KILLING ME?!\"An underrated and unhinged horror classic. I remember seeing this in the theater as a sophomore in high school and it still delights me now more than ever. Just a brilliant premise carried out to its ridiculously over-the-top conclusion. Jeff Fahey plays the lead with earnestness and his sweater game is on point. Brad Dourif pops up in this so you know it's good."
    },
    {
      "title": "Demolition Man",
      "link": "https://letterboxd.com/peruvianidol/film/demolition-man/",
      "watchedDate": "2025-02-24",
      "filmYear": "1993",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/8/6/8/46868-demolition-man-0-600-0-900-crop.jpg?v=2a6b346a45",
      "reviewText": "This movie predicted Uber Eats, Zoom calls, AI agents, and self-driving cars and was directed by a guy whose only credit before this was apparently a C+C Music Factory video. It's not a top tier 90s action movie but it's incredibly watchable, largely thanks to Wesley Snipes' charisma and action chops and Sandra Bullock going all-in as Stallone's hopelessly optimistic and 20th century-loving partner. There are some fun action set pieces, including one of the most memorable demises of a villain. How this got made I have no idea but I wish they still made stuff like this."
    },
    {
      "title": "The Social Network",
      "link": "https://letterboxd.com/peruvianidol/film/the-social-network/1/",
      "watchedDate": "2025-02-23",
      "filmYear": "2010",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/nw/cm/pa/ai/sGQv3ZMZBDBnl3z42Q0mEQ5uiDe-0-600-0-900-crop.jpg?v=54ee59f7cd",
      "reviewText": "Zuckerberg sucks. Not sure how much of this movie is true but Fincher's direction, Sorkin's writing, and Reznor and Ross' score add up to a hell of a movie. Looking forward to the legacy-quel in a few years that covers Facebook's (and Zuck's) role in the downfall of society."
    },
    {
      "title": "To Live and Die in L.A.",
      "link": "https://letterboxd.com/peruvianidol/film/to-live-and-die-in-la/",
      "watchedDate": "2025-02-21",
      "filmYear": "1985",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/6/7/6/9/46769-to-live-and-die-in-l-a--0-600-0-900-crop.jpg?v=4a55db27ed",
      "reviewText": "Just a fun, sleazy, 80s crime movie featuring a pretty epic chase scene and one ridiculous turn after another. Willem Dafoe shines as an expert counterfeiter being pursued by two increasingly incompetent secret service agents. Not a great movie by any means but you can tell this probably inspired Tarantino and others to make similarly over-the-top crime capers."
    },
    {
      "title": "Nickel Boys",
      "link": "https://letterboxd.com/peruvianidol/film/nickel-boys/",
      "watchedDate": "2025-02-18",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/6/5/8/9/926589-nickel-boys-0-600-0-900-crop.jpg?v=c90912e607",
      "reviewText": "A fascinating film that immerses you in the experience of these two young men. Hard to sustain over 2 hours and 20 minutes but the end hits hard. Sadly relevant given our current political climate."
    },
    {
      "title": "SNL50: The Homecoming Concert",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-homecoming-concert/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/1/1/6/5/2/1311652-snl50-the-homecoming-concert-0-600-0-900-crop.jpg?v=9b3187bd1c",
      "reviewText": "A joyous mix of SNL cast doing musical numbers and a who's who of former musical guests doing their hits and collaborating with other artists. I was constantly surprised so I won't spoil it here, but if you love SNL and music in general, you'll dig this!"
    },
    {
      "title": "SNL50: The Anniversary Special",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-anniversary-special/",
      "watchedDate": "2025-02-16",
      "filmYear": "2025",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/0/8/6/1/2/1308612-snl50-the-anniversary-special-0-600-0-900-crop.jpg?v=cdf893e1c4",
      "reviewText": "A lot of fun seeing new sketches with a mix of cast members from the show's 50 years and random famous people. It felt like they could have went a little harder though."
    },
    {
      "title": "SNL50: The Homecoming Concert",
      "link": "https://letterboxd.com/peruvianidol/film/snl50-the-homecoming-concert/",
      "watchedDate": "2025-02-17",
      "filmYear": "2025",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/3/1/1/6/5/2/1311652-snl50-the-homecoming-concert-0-600-0-900-crop.jpg?v=9b3187bd1c",
      "reviewText": "A joyous mix of SNL cast doing musical numbers and a who's who of former musical guests doing their hits and collaborating with other artists. I was constantly surprised so I won't spoil it here, but if you love SNL and music in general, you'll dig this!"
    },
    {
      "title": "Wild Things",
      "link": "https://letterboxd.com/peruvianidol/film/wild-things/",
      "watchedDate": "2025-02-10",
      "filmYear": "1998",
      "memberRating": "2.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/5/0/6/51506-wild-things-0-600-0-900-crop.jpg?v=bc7b982455",
      "reviewText": "I feel like maybe I saw this before but it was so forgettable that nothing stuck. I definitely remember the poster. Anyway, this movie is very 90s in just about every way. A modern-ish noir with lots of twists and turns and plot points that fall apart if you think about them for more than half a second. It's like a Lifetime movie made for Cinemax, with Denise Richards providing lots of male gaze bits. It's not a good movie by any means but it's pretty fun and trashy all the way through to the credits, where a bunch of stuff is revealed that happened off-camera."
    },
    {
      "title": "Dog Man",
      "link": "https://letterboxd.com/peruvianidol/film/dog-man/",
      "watchedDate": "2025-02-07",
      "filmYear": "2025",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/9/3/7/3/3/693733-dog-man-0-600-0-900-crop.jpg?v=c978774be5",
      "reviewText": "This was more fun than I was expecting. Dog Man is the hero but it's really Pete Davidson's movie. There was a lot to relate to in being a parent and dog owner. At one point Petey asks L'il Petey, \"how come I made you but you're not like me?\" To which L'il Petey responds, \"maybe I am but you just don't like that part.\" That gutted me. Some great humor and 80s references for parents and came in at under 90 minutes."
    },
    {
      "filmTitle": "Sing Sing",
      "link": "https://letterboxd.com/peruvianidol/film/sing-sing-2023/",
      "watchedDate": "2025-02-02",
      "filmYear": "2023",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/4/1/9/5/7/1041957-sing-sing-2023-0-600-0-900-crop.jpg?v=f893b22924",
      "reviewText": "There’s a vulnerability in acting that almost seems incongruous with prison life. Yet this story, about the real-life Rehabilitation Through the Arts program at Sing Sing, proves that wrong, blending fact with fiction with a cast of real RTA alums. Coleman Domingo gives a powerful performance and deserves all of the awards buzz. But the real standout for me was Clarence Maclin, one of the RTA members, who plays his vital arc with convincing nuance. A great pairing with Ghostlight, which also shows the redemptive power of theater."
    },
    {
      "filmTitle": "Land of Bad",
      "link": "https://letterboxd.com/peruvianidol/film/land-of-bad/",
      "watchedDate": "2025-01-30",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/7/2/7/5/5/872755-land-of-bad-0-600-0-900-crop.jpg?v=0d2d580e81",
      "reviewText": "A perfectly cromulent dadcore movie with two Hemsworths (but not the good one) and a thicc Russell Crowe as the guy in the chair. Strains credulity near the end but mostly enjoyable otherwise."
    },
    {
      "filmTitle": "Babygirl",
      "link": "https://letterboxd.com/peruvianidol/film/babygirl-2024/",
      "watchedDate": "2025-01-29",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/9/1/2/5/989125-babygirl-2024-0-600-0-900-crop.jpg?v=b175884970",
      "reviewText": "The horniest movie since Sanctuary, which it has a lot in common with. Kidman is great, you don’t often see older women depicted in positions of power while also screwing a much younger guy. Dickinson is kind of an empty vessel here, but maybe that was the point. I don’t buy for a minute that Antonio Banderas can’t get it done in the bedroom."
    },
    {
      "filmTitle": "Number 24",
      "link": "https://letterboxd.com/peruvianidol/film/number-24/",
      "watchedDate": "2025-01-27",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/1/0/5/8/9/5/1105895-number-24-0-600-0-900-crop.jpg?v=e7ca84c935",
      "reviewText": "A timely tale of the Norwegian resistance during WW2, and Norway’s most decorated hero, Gunnar Sønsteby. Framed by a Q&A many years after the war, Gunnar tells the audience of young Norwegians, “All these stories that you see that are published in the papers, they tell them. It’s the owners. What to print and what not to print. Every single time. So in the case of war, well, those papers should be lit instead. They’re mere kindling.” That really stuck with me given the current state of things. The flashbacks to the war are pretty standard fare, but Gunnar’s reckoning with his actions after being questioned by a young woman at the Q&A was quite poignant. Worth watching."
    },
    {
      "filmTitle": "Zero Effect",
      "link": "https://letterboxd.com/peruvianidol/film/zero-effect/",
      "watchedDate": "2025-01-27",
      "filmYear": "1998",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/5e/g1/tb/du/qmgUyhyJQwHzZ7ulaYCJLBon7gG-0-600-0-900-crop.jpg?v=6b30952605",
      "reviewText": "Such an underrated 90s gem. Maybe my favorite Bill Pullman movie. Kim Dickens is great, playing vulnerable, calculating and mysterious in equal turns. And Ben Stiller! It’s wild to me that the same director also did Walk Hard AND Red One. This movie practically begs for a TV show."
    },
    {
      "filmTitle": "Blink Twice",
      "link": "https://letterboxd.com/peruvianidol/film/blink-twice/",
      "watchedDate": "2025-01-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/7/5/6/0/4/2/756042-blink-twice-0-600-0-900-crop.jpg?v=2f35ddcd4e",
      "reviewText": "Wow, that was deeply unsettling. Blink Twice sets the table and then just kinda of lets you stew in a sense of unease before finally revealing itself. From there it gets wild. I never thought much of Channing Tatum as an actor but he’s perfectly cast here, delivering a mix of charm and menace. The ending is *chef’s kiss*."
    },
    {
      "filmTitle": "Gangs of New York",
      "link": "https://letterboxd.com/peruvianidol/film/gangs-of-new-york-2002/",
      "watchedDate": "2025-01-23",
      "filmYear": "2002",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/4/9/8/4/6/49846-gangs-of-new-york-0-600-0-900-crop.jpg?v=5c4435acc6",
      "reviewText": "There’s a lot to love here, particularly Daniel Day-Lewis’ performance as Bill the Butcher. It feels like both DiCaprio and Diaz are miscast and Scorsese just tries to do too much at the end. There’s a lot of build-up to a climactic confrontation that’s largely disrupted by a historical event. This movie is probably more relevant to today’s political climate than it was in 2002. If only we could see we should be fighting the “$300 men” instead of each other."
    },
    {
      "filmTitle": "Nosferatu",
      "link": "https://letterboxd.com/peruvianidol/film/nosferatu-2024/",
      "watchedDate": "2025-01-22",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/3/5/9/5/0/5/359505-nosferatu-2024-0-600-0-900-crop.jpg?v=a12d4ad648",
      "reviewText": "Incredible. A feast for the eyes. Riveting from beginning to end. Perhaps my favorite Eggers film so far. Willem Dafoe is my king."
    },
    {
      "filmTitle": "2073",
      "link": "https://letterboxd.com/peruvianidol/film/2073/",
      "watchedDate": "2025-01-21",
      "filmYear": "2024",
      "memberRating": "1.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/2/2/8/8/2/922882-2073-0-600-0-900-crop.jpg?v=58a1e20c8e",
      "reviewText": "This “documentary” is like “Somebody Should Do Something About All the Problems” framed in a vague speculative fiction dystopia. It lists off problems that, to no one’s surprise, are bad! And if left unchecked, could lead to a disastrous future, as if it’s not already here. It asks us to take action before it’s too late but has no ideas about what those actions might be. One of the many problems it covers is AI, but it seems like AI was used to make the doc? 84 minutes of my life I’ll never get back."
    },
    {
      "filmTitle": "I Saw the Devil",
      "link": "https://letterboxd.com/peruvianidol/film/i-saw-the-devil/",
      "watchedDate": "2025-01-10",
      "filmYear": "2010",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/m3/dw/c1/xn/4o52BPrgvq7b2xFy1OdVSIoIn1T-0-600-0-900-crop.jpg?v=7cdd6fab3f",
      "reviewText": "Well that was bleak."
    },
    {
      "filmTitle": "Se7en",
      "link": "https://letterboxd.com/peruvianidol/film/se7en/1/",
      "watchedDate": "2025-01-08",
      "filmYear": "1995",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/3/4/5/51345-se7en-0-600-0-900-crop.jpg?v=76a14ef6b4",
      "reviewText": "Gorgeous 4K transfer. The last 20 minutes of this is perfect. Even after maybe a dozen viewings it’s still incredibly tense."
    },
    {
      "filmTitle": "A Real Pain",
      "link": "https://letterboxd.com/peruvianidol/film/a-real-pain/",
      "watchedDate": "2025-01-06",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/1/3/2/5/8/913258-a-real-pain-0-600-0-900-crop.jpg?v=893a943872",
      "reviewText": "This was really bizarre to watch as I recognized aspects of myself in both Kieran Culkin and Jesse Eisenberg’s characters that are often in conflict. It was like seeing my inner voice projected on the screen. Their journey together and their interactions with the people around them almost felt like set dressing to inform the relationship between these two cousins. I’ll have to give it another watch. The last shot shook me."
    },
    {
      "filmTitle": "Your Friend, Nate Bargatze",
      "link": "https://letterboxd.com/peruvianidol/film/your-friend-nate-bargatze/",
      "watchedDate": "2025-01-01",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/6/2/7/5/2/1262752-your-friend-nate-bargatze-0-600-0-900-crop.jpg?v=cfb5590e05",
      "reviewText": "I like Nate but his dry, clean humor doesn’t elicit much more than a hearty chuckle from me."
    },
    {
      "filmTitle": "We Live in Time",
      "link": "https://letterboxd.com/peruvianidol/film/we-live-in-time/",
      "watchedDate": "2024-12-31",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/9/1/7/8/6/991786-we-live-in-time-0-600-0-900-crop.jpg?v=14245ba118",
      "reviewText": "Not sure this needed to have such a non-linear narrative, except “time” is in the title, so I guess? I enjoyed the chemistry between Garfield and Pugh, but it probably would have worked the same as a conventional narrative. Some good moments but ultimately I don’t think it was terribly memorable."
    },
    {
      "filmTitle": "Challengers",
      "link": "https://letterboxd.com/peruvianidol/film/challengers/1/",
      "watchedDate": "2024-12-29",
      "filmYear": "2024",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/4/2/3/0/1/842301-challengers-0-600-0-900-crop.jpg?v=a7cd63cbef",
      "reviewText": "Struggled to stay awake through this as I was doped up on NyQuil as my wife and I watched this in a hotel room, both struggling with some unknown virus. On top of that the hotel TV had motion-smoothing turned on, which was extremely distracting. All that said, this movie still slaps. Incredible score and just a fun horny time with three great leads."
    },
    {
      "filmTitle": "Nightbitch",
      "link": "https://letterboxd.com/peruvianidol/film/nightbitch/",
      "watchedDate": "2024-12-28",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/6/5/1/2/2/6/651226-nightbitch-0-600-0-900-crop.jpg?v=9717400486",
      "reviewText": "Amy Adams is great in this spin on Teen Wolf. Lots to relate to here as tired parent."
    },
    {
      "filmTitle": "Red Rooms",
      "link": "https://letterboxd.com/peruvianidol/film/red-rooms/",
      "watchedDate": "2024-12-26",
      "filmYear": "2023",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/1/8/7/9/8/818798-red-rooms-0-600-0-900-crop.jpg?v=af37112bc2",
      "reviewText": "Absolutely chilling. Feels very of the moment with our obsession with true crime and its depiction of the dark web. Juliette Gariépy delivers an incredible performance, creepy and understated at the same time. This movie kept me guessing until the very end."
    },
    {
      "filmTitle": "Heretic",
      "link": "https://letterboxd.com/peruvianidol/film/heretic-2024/",
      "watchedDate": "2024-12-25",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/2/5/3/3/1/1025331-heretic-2024-0-600-0-900-crop.jpg?v=c79c5c8121",
      "reviewText": "My mom told me she once invited a Jehovah's Witness in for a chat and they by the time they left they were no longer a Jehovah's Witness and now I have questions. Anyway, this was fiendishly clever and it seems like the type of movie that will benefit from repeat viewings. Chilling performance from Hugh Grant."
    },
    {
      "filmTitle": "It's a Wonderful Life",
      "link": "https://letterboxd.com/peruvianidol/film/its-a-wonderful-life/9/",
      "watchedDate": "2024-12-24",
      "filmYear": "1946",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/4/9/50949-it-s-a-wonderful-life-0-600-0-900-crop.jpg?v=64b72dd083",
      "reviewText": "\"...this rabble you're talking about, they do most of the working and paying and living and dying in this community. Well, is it too much to have them work and pay and live and die in a couple of decent rooms and a bath?\"Turns out we're all living in Pottersville and Mr. Potter is President-elect."
    },
    {
      "filmTitle": "Y2K",
      "link": "https://letterboxd.com/peruvianidol/film/y2k-2024/",
      "watchedDate": "2024-12-24",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/8/6/2/5/7/986257-y2k-0-600-0-900-crop.jpg?v=f5b3bd7137",
      "reviewText": "Kyle Mooney's humor is definitely not for everyone but this movie had me laughing my ass off. Heavy on the late 90s nostalgia and includes maybe the best cameo of the year. Brilliantly spoofs movies of that era and mixes genres in a fun way. It's almost a millennial Wet Hot American Summer. Didn't love this as much as Brigsby Bear but was not disappointed."
    },
    {
      "filmTitle": "The Order",
      "link": "https://letterboxd.com/peruvianidol/film/the-order-2024/",
      "watchedDate": "2024-12-24",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/7/5/3/9/3/975393-the-order-2024-0-600-0-900-crop.jpg?v=4a956cfea6",
      "reviewText": "I dug the 80s aesthetic here and loved Jude Law as a grizzled FBI agent chasing down a group of white nationalists. The whole thing didn't add up to much, mostly because there's just not enough time to develop its characters. There's definitely some Heat and Sicario influences at play but The Order lacks the depth of those films. Might have been better as the next season of True Detective."
    },
    {
      "filmTitle": "The Substance",
      "link": "https://letterboxd.com/peruvianidol/film/the-substance/1/",
      "watchedDate": "2024-12-23",
      "filmYear": "2024",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/3/8/1/4/0/838140-the-substance-0-600-0-900-crop.jpg?v=ab9e1072f8",
      "reviewText": "Watched this again with my wife and it was delightful watching her squirm and squeal through the increasingly disturbing moments. Props to Demi for reading this script and going, \"hell yes, let's do this.\""
    },
    {
      "filmTitle": "Juror #2",
      "link": "https://letterboxd.com/peruvianidol/film/juror-2/",
      "watchedDate": "2024-12-21",
      "filmYear": "2024",
      "memberRating": "2.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/9/7/7/2/2/997722-juror-2-0-600-0-900-crop.jpg?v=14601fa694",
      "reviewText": "Real TV movie of the week vibes. 12 Angry Men meets Idiocracy. There's so many elements that strain credulity and the ending was pretty unsatisfying. I'm not sure if people are giving this a pass because Eastwood directed it or if I saw a completely different movie. Yeesh."
    },
    {
      "filmTitle": "28 Weeks Later",
      "link": "https://letterboxd.com/peruvianidol/film/28-weeks-later/",
      "watchedDate": "2024-12-21",
      "filmYear": "2007",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/0/9/7/2/50972-28-weeks-later-0-600-0-900-crop.jpg?v=811010e540",
      "reviewText": "Very much Force Majeure with zombies. The first two-thirds or so is pretty action-packed. It kind of loses steam towards the end. Looks better than the first movie just by virtue of using a better camera but lacks Danny Boyle's style. Great to see Jeremy Renner, Idris Elba and Rose Byrne before they were household names. Turns out bringing Americans in to solve your problems is maybe not the best idea."
    },
    {
      "filmTitle": "Sonic the Hedgehog 3",
      "link": "https://letterboxd.com/peruvianidol/film/sonic-the-hedgehog-3/",
      "watchedDate": "2024-12-21",
      "filmYear": "2024",
      "memberRating": "3.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/8/4/4/1/4/8/844148-sonic-the-hedgehog-3-0-600-0-900-crop.jpg?v=4878f94b09",
      "reviewText": "Completely nonsensical plot. It didn't help that I didn't see Sonic 2. But my 5-year-old was excited to see this in the theater — only his third movie in one. I spent most of the runtime trying to get my 2-year-old to sit still and not be a complete nuisance but my overall impression was that it was visually interesting and had double the Jim Carrey, which I had no complaints about. My kids gave it two thumbs up, take that as you will."
    },
    {
      "filmTitle": "28 Days Later",
      "link": "https://letterboxd.com/peruvianidol/film/28-days-later/",
      "watchedDate": "2024-12-20",
      "filmYear": "2002",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/qr/28/nz/3f/xaYdxi1PBEAYvqknvAmMPK5Eff3-0-600-0-900-crop.jpg?v=22d7237ed9",
      "reviewText": "Such a great setup for a zombie movie but the middle lags quite a bit and it turns out that men are more sick than zombies. The final act is pretty satisfying though. It's a shame this movie looks so terrible as it was shot on a Canon XL 1. It'll be interesting to see Boyle revisit this with 28 Years Later."
    },
    {
      "filmTitle": "Super/Man: The Christopher Reeve Story",
      "link": "https://letterboxd.com/peruvianidol/film/super-man-the-christopher-reeve-story/",
      "watchedDate": "2024-12-19",
      "filmYear": "2024",
      "memberRating": "3.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/0/1/6/9/2/8/1016928-super-man-the-christopher-reeve-story-0-600-0-900-crop.jpg?v=40dde60ca4",
      "reviewText": "Superman was one of the first movies I remember seeing in the theater. It really captured my imagination and Christopher Reeve's performance a huge part of it. I don't know that I ever saw him in anything else until after he passed. He was just always Superman. This doc mostly covers his life after being paralyzed, his advocacy for the disabled, and the family, friends, and legacy he left behind. It had me in tears for most of the last 20 minutes. It's devastating to see our heroes fall but some manage to rise up and be more heroic than ever. Reeve was certainly one of those heroes."
    },
    {
      "filmTitle": "Paris, Texas",
      "link": "https://letterboxd.com/peruvianidol/film/paris-texas/1/",
      "watchedDate": "2024-12-19",
      "filmYear": "1984",
      "memberRating": "4.5",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/5/1/4/6/9/51469-paris-texas-0-600-0-900-crop.jpg?v=c8f2743612",
      "reviewText": "Gorgeous 4k remaster. This movie is a slow burn but the last half hour is so remarkable it's haunted me since the first time I saw it."
    },
    {
      "filmTitle": "No Country for Old Men",
      "link": "https://letterboxd.com/peruvianidol/film/no-country-for-old-men/1/",
      "watchedDate": "2024-12-14",
      "filmYear": "2007",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/dr/hr/pz/ez/ehLb2SQ3djlA1FrQKbP2WO3VH09-0-600-0-900-crop.jpg?v=6489920a92",
      "reviewText": "An absolute masterpiece. I love this movie more each time I see it. The thing I noticed most this time around is how much happens off screen. The story and characters are so well put together that they don’t even need to show you things that other movies would relish making a scene of. Great performances all around and gorgeous cinematography by Deakins."
    },
    {
      "filmTitle": "Carry-On",
      "link": "https://letterboxd.com/peruvianidol/film/carry-on-2024/",
      "watchedDate": "2024-12-13",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/9/0/5/8/7/6/905876-carry-on-2024-0-600-0-900-crop.jpg?v=bc2c1c0d8f",
      "reviewText": "Way more fun than it has any right to be. The plot is ridiculous but the cast is stacked with a who's who of great character actors. Taron Egerton is solid, if not overqualified to be a TSA agent. A lot of comparisons to Die Hard, but this is more like Phone Booth except it's actually enjoyable."
    },
    {
      "filmTitle": "The Man from U.N.C.L.E.",
      "link": "https://letterboxd.com/peruvianidol/film/the-man-from-uncle/1/",
      "watchedDate": "2024-12-07",
      "filmYear": "2015",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/4/5/8/2/2/145822-the-man-from-u-n-c-l-e--0-600-0-900-crop.jpg?v=2cc57633aa",
      "reviewText": "Stylish and fun in a way that Guy Ritchie excels at. I watched reruns of the show as a kid and, while it was fun, it never looked this cool. It’s a shame that Armie Hammer turned out to be a weird vampire sex perv or whatever. I would have loved for this to be a franchise. Also on second watch I realized that Jared Harris plays Solo’s boss, doing a hilariously bad American accent and I loved every minute of it."
    },
    {
      "filmTitle": "Anthony Jeselnik: Bones and All",
      "link": "https://letterboxd.com/peruvianidol/film/anthony-jeselnik-bones-and-all/",
      "watchedDate": "2024-12-05",
      "filmYear": "2024",
      "memberRating": "4.0",
      "posterUrl": "https://a.ltrbxd.com/resized/film-poster/1/2/6/6/4/1/9/1266419-anthony-jeselnik-bones-and-all-0-600-0-900-crop.jpg?v=dbbca95550",
      "reviewText": "It came as no surprise in this special when Jeselnik talked about his comedy hero, Norm MacDonald. Both he and Norm have a similar deadpan style where you don’t know where a joke is going but when the punchline drops it’s almost always a surprise. Jeselnik tells a bunch of stories from his 20 years in stand up with such bravado, never once cracking a smile at his own jokes. I can’t say his humor is for everybody but I laughed my ass off."
    },
    {
      "filmTitle": "Brigsby Bear",
      "link": "https://letterboxd.com/peruvianidol/film/brigsby-bear/1/",
      "watchedDate": "2024-12-04",
      "filmYear": "2017",
      "memberRating": "5.0",
      "posterUrl": "https://a.ltrbxd.com/resized/sm/upload/1g/pp/xg/9f/lRLoSm2Yp0lRvme5xxE31qbDbYv-0-600-0-900-crop.jpg?v=a84f272046",
      "reviewText": "I wanted to revisit this with Kyle Mooney’s new movie, Y2K coming out this week. I think this was my favorite movie of 2017 and I still love it the second time around. Mooney plays it with such earnestness that you really care for his character. Shades of Be Kind, Rewind and The Truman Show. Mark Hamill is perfectly cast. Now I’m really stoked to check out Y2K."
    }
  ]
}